[
  {
    "Post_ID": "MEM-111-14",
    "Posting_Author": "The Office of Congressman Reid Ribble",
    "Congress_Number": null,
    "State_District": "Washington, D.C.",
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Internship",
    "Office_Type": null,
    "Responsibilities": [
      "office administration",
      "legislative research"
    ],
    "Qualifications": [
      "excellent writing and communication skills",
      "strong organizational abilities",
      "good work ethic",
      "ability to work independently",
      "drive to take the initiative in a fast-paced environment"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "MEM-111-14\nThe Office of Congressman Reid Ribble is seeking qualified candidates to intern in our Washington, D.C. office for the Spring 2014 semester.\nWe are interested in candidates of all academic disciplines.\nInterns will assist the staff with a variety of tasks, including office administration, legislative research, constituent correspondence, and other duties as assigned.\nAdministration will include daily tasks such as welcoming guests, being aware of the Congressman’s and staff’s schedules, answering phones, constituent tours, mail administration, and other duties.\nLegislative research and constituent correspondence will include being aware of current and pending legislation, researching legislation for constituent correspondence, attending briefings, and other duties.\nCandidates should have excellent writing and communication skills, strong organizational abilities, a good work ethic, an ability to work independently, and the drive to take the initiative in a fast-paced environment.\n1",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-110-14",
    "Posting_Author": "Congressman Jerry McNerney (CA-09)",
    "Congress_Number": null,
    "State_District": "CA-09",
    "Location": "Washington D.C.",
    "Job_Function": "Internship or null ",
    "Title_Parsed": "Not Provided",
    "Office_Type": "Congressional office and Capitol Hill experience",
    "Responsibilities": [
      "attending Congressional briefings",
      "giving tours of the Capitol",
      "conducting research",
      "responsive to constituent inquiries",
      "processing tour and flag requests"
    ],
    "Qualifications": [
      "professional and courteous demeanor",
      "excellent communication skills",
      "ability to multi-task",
      "fastidious attention to detail",
      "interest in the legislative and governmental process"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "An equal opportunity employer",
    "Cleaned_Text": "Congressman Jerry McNerney (CA-09) is currently accepting applications for internship positions in his Washington D.C. office. This unpaid internship will provide valuable hands-on experience in a Congressional office and a greater understanding of the legislative process. Responsibilities will include, but are not limited to, attending Congressional briefings, giving tours of the Capitol, conducting research, responding to constituent inquiries, and processing tour and flag requests.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-105-14",
    "Posting_Author": "Congresswoman Betty McCollum",
    "Congress_Number": null,
    "State_District": "Minnesota's Fourth Congressional District",
    "Location": "Washington, D.C.",
    "Job_Function": "Internship",
    "Title_Parsed": null,
    "Office_Type": "Representative's Office",
    "Responsibilities": [
      "Supporting administrative staff: answering phones, database entry, and sorting mail.",
      "Supporting legislative staff: tracking constituent correspondence, drafting letters, and conducting light research.",
      "Attending briefings and hearings for legislative staff.",
      "Compiling news clips.",
      "Promoting constituent outreach efforts by communicating with constituents and constituent groups, attending meetings and events, and drafting correspondence."
    ],
    "Qualifications": [
      "Highly motivated and enthusiastic applicants.",
      "Ability to work well in a team environment.",
      "Strong communication skills.",
      "Ability to prioritize tasks effectively.",
      "Experience with database entry is an asset."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Organizational skills",
      "Communication skills",
      "Database management"
    ],
    "Equal_Opportunity_Information": "Congresswoman McCollum's office is an Equal Opportunity Employer and welcomes submissions from all qualified applicants.",
    "Cleaned_Text": "MEM-105-14 Congresswoman Betty McCollum, Minnesota’s Fourth Congressional District, Internship. Intern needed to start immediately. Stipend available. Please indicate any connections to Minnesota in your cover letter's first paragraph. We are seeking energetic and proficient interns in the Washington, D.C. office of Congresswoman Betty McCollum. An internship in Congresswoman McCollum’s office will provide valuable experience to students as they prepare for their professional careers. Interns have the opportunity to work with and assist all members of the staff, including legislative, administrative, outreach and press duties. Washington, DC interns will be encouraged to take advantage of the many hearings, workshops and seminars that are held on Capitol Hill. In addition, we are happy to work with your college or university to arrange for academic credit. Applicants should be highly motivated and enthusiastic, as there are far more applicants than available positions. Minnesota ties are strongly preferred.\n\nResponsibilities Include:\nSupporting administrative staff: answering phones, database entry, and sorting mail. Supporting legislative staff: tracking constituent correspondence, drafting letters, and conducting light research. Attending briefings and hearings for legislative staff. Compiling news clips. Promoting constituent outreach efforts by communicating with constituents and constituent groups, attending meetings and events, and drafting correspondence.\n\n Hours:\nInternships are available year-round. They are available on a part-time or fulltime basis. Minimum 25 hours a week. Transportation and housing are the responsibility of interns.\n\nApplication process: Applicants should send a cover letter, available hours and a resume. Those interested in a Washington, D.C. internship should email scheduler_mn04dc@mail.house.gov. Please indicate any Minnesota ties. More information: http://mccollum.house.gov/serving-you/internships",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-103-14",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "<p>The Republican office of the Committee on House Administration seeks energetic and self-motivated undergraduate or graduate level students as well as recent graduates with an interest in government and public policy to apply for its Spring 2014 internships. Working closely with Committee staff, interns will have the opportunity to gain first-hand knowledge of the inner-workings of a congressional committee and learn about the day-to-day administrative operations of the House of Representatives. Interns are responsible for assisting Committee staff with official proceedings (hearings/markups), oversight, research and other projects as well as providing general front office support. Unlike most House internships, this is a paid internship.</p><p>To apply, please send a cover letter and resume to CHARep.Intern@mail.house.gov. Please limit your resume to one page only.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-102-14",
    "Posting_Author": "House Democratic Leadership Office",
    "Congress_Number": null,
    "State_District": "NJ01",
    "Location": "DC",
    "Job_Function": "Internship",
    "Title_Parsed": "Legislative team for spring 2014",
    "Office_Type": "Democratic",
    "Responsibilities": [
      "answering and screening telephone calls",
      "greeting visitors",
      "assisting staff"
    ],
    "Qualifications": [
      "high degree of professionalism",
      "well-organized",
      "hard-working",
      "detailoriented"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "none specified in this text"
    ],
    "Equal_Opportunity_Information": "NJ01.DCINTERN@mail.house.gov",
    "Cleaned_Text": "House Democratic Leadership Office seeks interns to join Legislative team for spring 2014. Candidates should be well-organized, hard-working and detailoriented. High degree of professionalism required. Duties include answering and screening telephone calls, greeting visitors, assisting staff and other administrative duties as needed. Please email cover letter, resume and references to: NJ01.DCINTERN@mail.house.gov",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-101-14",
    "Posting_Author": "The Office of Congressman Steven Horsford (NV-4)",
    "Congress_Number": 3,
    "State_District": "",
    "Location": "(NV-4)",
    "Job_Function": "",
    "Title_Parsed": "Office Assistant",
    "Office_Type": "",
    "Responsibilities": null,
    "Qualifications": null,
    "Salary_Min": 0,
    "Salary_Max": 0,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The Congress of the United States is an Equal Opportunity Employer and encourages diversity.",
    "Cleaned_Text": "MEM-101-14\n\nThe Office of Congressman Steven Horsford (NV-4) seeks motivated, organized, and reliable college students or recent graduates wishing to gain Capitol Hill experience for full/part-time, 10-week, UNPAID internships.\n\nDuties include assisting the legislative, communications, and administrative staff with day-to-day operations including attending briefings, answering phones,\ndafting constituent response letters and performing legislative research.\n\nStudents/recent graduates with ties to Nevada's 4th Congressional District or a diverse background are strongly encouraged to apply, though these are not requirements for qualification. Applications will be accepted on a rolling basis.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-377-13",
    "Posting_Author": "Democratic Staff is currently ... seeking an undergraduate or graduate press intern.",
    "Congress_Number": null,
    "State_District": "The Committee on Education and the Workforce",
    "Location": "not specified",
    "Job_Function": null,
    "Title_Parsed": "press intern",
    "Office_Type": "Internship",
    "Responsibilities": [
      "helping draft materials",
      "manage the Committee press list",
      "organize and staff Committee press conferences",
      "provide communications support at Committee hearings and markups",
      "assisting with the production of daily news clips relating to Committee issues",
      "performing administrative duties"
    ],
    "Qualifications": [
      "being able to start in January and commit through April/May",
      "email[ing] their cover letter, resume, ... two short, relevant writing samples"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": " MEM-377-13\nThe Committee on Education and the Workforce, Democratic Staff is currently seeking an undergraduate or graduate press intern for the Spring of 2014. The intern will perfo…",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-372-13",
    "Posting_Author": "The Congressional Black Caucus)",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "The Congressional Black Caucus is accepting applications for internship positions available for spring 2014. This unpaid internship will provide valuable hands on experience in developing and executing initiatives for a Congressional Caucus and will provide an understanding the Caucus’s role in the legislative process. This is an excellent opportunity for college students and recent graduates seeking Capitol Hill experience. All majors are encouraged to apply. Interested applicants should e-mail a resume, cover letter, and writing sample to Latrice.Powell@mail.house.gov with “Spring 2014 Internship” in the subject.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-316-13",
    "Posting_Author": "Congresswoman Maxine Waters (CA-43)",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "press and social media intern",
    "Title_Parsed": "Intern",
    "Office_Type": null,
    "Responsibilities": [
      "compiling press clips",
      "monitoring daily news",
      "drafting talking points and press releases",
      "updating social media"
    ],
    "Qualifications": [
      "previous experience in public relations or journalism",
      "strong written communications skills",
      "ability to work in a fast-paced environment",
      "professional manner"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "public relations",
      "journalism",
      "written communications"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  }
]