[
  {
    "Post_ID": "MEM-109-14",
    "Posting_Author": "Congressman Steven Horsford",
    "Congress_Number": null,
    "State_District": "Nevada, 4th Congressional District",
    "Location": "North Las Vegas, NV",
    "Job_Function": "Community Liaison/Caseworker",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "monitors and updates the Congressman and Deputy District Director on district and local issues",
      "acts as a liaison to federal, district, and local agencies for the Congressman and constituents"
    ],
    "Qualifications": [
      "recent experience with, and understanding of U.S. Military and Department of Veteran's Affairs structure, the procedures, and policies"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-108-14",
    "Posting_Author": "Committee on Ethics",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "Staff Assistant",
    "Title_Parsed": "Staff Assistant",
    "Office_Type": "Permanent",
    "Responsibilities": [
      "answering telephones",
      "assisting with the committee investigations production process",
      "assisting with the tracking and processing of committee correspondence",
      "providing administrative support in setting up committee meetings",
      "entering data and navigating databases with accuracy"
    ],
    "Qualifications": [
      "excellent organizational skills",
      "professional telephone manner",
      "good computer skills",
      "proficiency in Microsoft Word and Excel",
      "ability to work cooperatively and courteously with others",
      "ability to use good judgment in responding to inquiries and requests",
      "flexibility in assisting with daily tasks and projects"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Microsoft Word",
      "Excel",
      "databases",
      "organizational skills",
      "telephones",
      "computer skills",
      "good judgment",
      "flexibility"
    ],
    "Equal_Opportunity_Information": "We are an equal opportunity employer.",
    "Cleaned_Text": "answering telephones; assisting with the committee investigations production process; assisting with the tracking and processing ofcommittee correspondence; providing administrative support in setting upcommittee meetings; and entering data and navigating databases with accuracy.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-106-14",
    "Posting_Author": "Southern conservative Democrat",
    "Congress_Number": null,
    "State_District": "Unknown",
    "Location": "DC office in the District",
    "Job_Function": "Communications Director",
    "Title_Parsed": "Communications Director",
    "Office_Type": "Member",
    "Responsibilities": [
      "manage press operations",
      "pitching stories and responding to press inquiries",
      "writing press releases, op-eds, and statements",
      "coordinating in-district events",
      "booking appearances on radio and television",
      "ensuring an active online presence"
    ],
    "Qualifications": [
      "proactive team player",
      "excellent written and oral communications skills",
      "substantial press experience",
      "ability to work quickly and carefully under tight deadlines"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Energy and Commerce Committee issues",
      "Southern ties",
      "campaign experience"
    ],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-104-14",
    "Posting_Author": "Not Found",
    "Congress_Number": null,
    "State_District": "null",
    "Location": "Los Angeles, CA 90017",
    "Job_Function": "Staff Assistant",
    "Title_Parsed": "Staff Assistant",
    "Office_Type": "District Office",
    "Responsibilities": [
      "answer phones; handle mail and faxes; greet and direct visitors; maintain order & efficiency of front and back offices; order supplies; organize office files; coordinate with the Capitol Office to arrange tour and flag requests; coordinate vendor service needs; research the status of some legislation; draft some correspondence; assist the District Director and all District Office staff with additional tasks, as needed.",
      "Casework duties include (but not limited to): Assist constituents with their individual cases pertaining to federal agencies. Help constituents to obtain timely consideration and cut through red tape. As the front-line caseworker, help constituents with nonfederal questions to find appropriate resources."
    ],
    "Qualifications": [
      "Prefer some experience working directly with the community.",
      "Solid interpersonal, Writing and organizational skills are essential.",
      "The successful applicant will be a team player, have a positive attitude and the ability to work and set priorities in a fast-paced environment.",
      "Spanish language skills considered a plus."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "null"
    ],
    "Equal_Opportunity_Information": "Not Found",
    "Cleaned_Text": " Staff Assistant duties Include (but are not limited to): answer phones; handle mail and faxes; greet and direct visitors; maintain order & efficiency of front and back offices order supplies; organize office files; coordinate with the Capitol Office to arrange tour and flag requests; coordinate vendor service needs; research the status of some legislation; draft some correspondence; assist the District Director and all District Office staff with additional tasks, as needed. In the absence of the District Scheduler, the staff assistant will serve as back-up and help facilitate any scheduling requests. Casework duties include (but are not limited to): Assist constituents with their individual cases pertiing to federal agencies. Help constituents to obtain timely consideration and cut through red tape. As the front-line caseworker, help constituents with nonfederal questions to find appropriate resources.\n\nEX P ERIENCE REQUIRED:\nPrefer some experience working directly with the community. Solid interpersonal, Writing and organizational skills are essential. The successful applicant will be a team player, have a positive attitude and the ability to work and set priorities in a fast-paced environment. Spanish language skills considered a plus.\nTO APPLY: Please fax or email cover letter and resume to:\nOffice of Congressman Xavier Becerra\n350 S. Bixel Street, Suite 120\nLos Angeles, CA 90017\nFax (213) 481-1427\nEmail: Resume.California@mail.house.gov",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-100-14",
    "Posting_Author": "The Member of Congress of the 114th Congress",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, D.C.",
    "Job_Function": "Staff Assistant",
    "Title_Parsed": "Staff Assistant: We are seeking a highly energetic, motivated, and organized individual to join the team of a Senior Democratic member of Congress. The candidate will have strong interpersonal skills, be comfortable with managing multiple tasks and work well under pressure.",
    "Office_Type": "Intern Coordinator (Senior Congressional Office)",
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The Equal Employment Opportunity Commission is a sponsor of this application.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-376-13",
    "Posting_Author": "Dem member",
    "Congress_Number": null,
    "State_District": "",
    "Location": "Hill",
    "Job_Function": "press secretary",
    "Title_Parsed": "-- Dem member seeks press secretary for DC office, Hill",
    "Office_Type": "-",
    "Responsibilities": [],
    "Qualifications": [
      "DCPRSecCV@gmail.com",
      "(plus) Hill experience a plus",
      "not required"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "press secretary -- Dem member seeks press secretary for DC office, Hill experience a plus, not required. Please submit resumes to DCPRSecCV@gmail.com",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-375-13",
    "Posting_Author": "",
    "Congress_Number": null,
    "State_District": "IL-18",
    "Location": null,
    "Job_Function": "Communications Director",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "working with the Congressman to help craft talking points, speeches and op-eds; writing press releases and e-newsletters; booking and pitching media outlets nationally and in district; and maintaining and updating the Member's website."
    ],
    "Qualifications": [
      ""
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-374-13",
    "Posting_Author": null,
    "Congress_Number": 13,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "Legislative Assistant to handle the Member’s work on the House Financial Services Committee",
    "Office_Type": "Washington, DC office",
    "Responsibilities": [
      "preparing and staffing the Member for committee hearings and markups",
      "monitoring legislative developments within Committees and on the House floor",
      "developing and advancing legislation and other policy priorities of the Member"
    ],
    "Qualifications": [
      "superior organizational skills",
      "strong written and oral communication skills",
      "strong interpersonal skills"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "Freshman Democratic Member seeks an organized, energetic and savvy Legislative Assistant to handle the Member’s work on the House Financial Services Committee, with a focus on economic development, affordable housing and infrastructure needs of America’s legacy cities. The selected candidate will be joining a fast-paced, team-oriented Washington, DC office.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-373-13",
    "Posting_Author": "Ohio Republican House Member",
    "Congress_Number": null,
    "State_District": "Ohio",
    "Location": "None",
    "Job_Function": "staff",
    "Title_Parsed": "press assistant",
    "Office_Type": "House of Representatives",
    "Responsibilities": null,
    "Qualifications": null,
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "new media",
      "HTML",
      "Final Cut Pro"
    ],
    "Equal_Opportunity_Information": "We are an equal opportunity employer.",
    "Cleaned_Text": "{\"text\": \"Ohio Republican House Member seeking press assistant to join staff. Applicants should be self-starting, hard-working and creative. Must have strong writing and verbal skills and be extremely detail oriented. Job responsibilities include: managing all new media platforms (Facebook, Twitter, You Tube and Instagram), updating the web site, writing press releases and columns, creating videos and graphics, taking photos and running telephone town halls. Experience with new media, HTML, Final Cut Pro, Movie Maker and Photoshop helpful. Possibility of eventual promotion to press secretary a possibility based on job performance over time. Interested applicants should send cover letter, resume and writing sample to oh.ushouse.job@gmail.com.\", \"clean\": true}",
    "DW_NOMINATE": null,
    "LES": null
  }
]