[
  {
    "Post_ID": "MEM-120-14",
    "Posting_Author": "Compilation of Precedents Office",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "DIGITAL EDITOR",
    "Title_Parsed": "Digital Editor",
    "Office_Type": "nonpartisan and affiliated with the House Parliamentarian’s Office",
    "Responsibilities": [
      "Maintaining, updating, and editing the Office’s SQL database for content and accuracy for publishable materials.",
      "Researching and composing reports from database to assist with Office’s needs.",
      "Utilizing technological knowledge to expand and enhance the database’s capabilities while maintaining accuracy and precision.",
      "Working closely with the IT Director on developing other research methods and composition techniques based on current capabilities and in accordance with Government Printing Office’s technology/standards.",
      "Assisting the Legal Editors in preparation for publications of various products.",
      "Acting as a liaison between the Office and the GPO in production and distribution of products.",
      "Creating new research reports from a variety of sources (including internal database, various government and legal databases, and working with various House staff) as needed."
    ],
    "Qualifications": [
      "Bachelor’s degree required.",
      "Excellent computer database management essential. Knowledge of SQL, XML, Microsoft Office, and publication software preferred.",
      "Excellent editing skills and commitment to detail essential.",
      "Legal or citation checking helpful.",
      "Commitment to nonpartisan atmosphere essential.",
      "Knowledge of Hill or legislative processes helpful, but not essential.",
      "Ability to work both independently and in a collaborative matter essential.",
      "Ability to be a self-starter also essential."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "SQL",
      "XML",
      "Microsoft Office",
      "publication software"
    ],
    "Equal_Opportunity_Information": "The Compilation of Precedents Office is an equal opportunity employer.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-119-14",
    "Posting_Author": "New Jersey Democrat",
    "Congress_Number": null,
    "State_District": "New Jersey",
    "Location": "Washington, D.C.",
    "Job_Function": "Transportation Legislative Assistant Opening",
    "Title_Parsed": "Legislative Assistant to Member on Transportation and Infrastructure Committee",
    "Office_Type": "Member's Office",
    "Responsibilities": [
      "Preparing and staffing the Member for committee hearings and markups",
      "Developing and advancing legislation and other policy priorities of the Member",
      "Researching and advising the Member on bills and other issues",
      "Representing the Member in meetings",
      "Drafting constituent correspondence"
    ],
    "Qualifications": [
      "A transportation background",
      "Hill experience"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "Applicant will be selected without regard to race, color, religion, sex, national origin, age, disability or genetic information.",
    "Cleaned_Text": "Transportation Legislative Assistant Opening: New Jersey Democrat is seeking a legislative assistant to handle the Member's work on the Transportation and Infrastructure Committee. Responsibilities include: preparing and staffing the Member for committee hearings and markups, developing and advancing legislation and other policy priorities of the Member, researching and advising the Member on bills and other issues, representing the Member in meetings, and drafting constituent correspondence. Other issues to be handled include: labor, education, agriculture, and arts and humanities. The ideal candidate will have a transportation background and Hill experience.\nPlease e-mail cover letter, resume and two brief writing samples to nj08jobs@gmail.com.\nPlease no calls or drop-ins.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-118-14",
    "Posting_Author": "Steven Horsford",
    "Congress_Number": null,
    "State_District": "Nevada",
    "Location": "North Las Vegas - District Office",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "upates the Congressman and District Office staff on district and local issues.",
      "Monitors and updates the Congressman and District Office staff on district and local issues",
      "Acts as a liaison for constituent requests"
    ],
    "Qualifications": [
      "Administrative experience with strong written and verbal communication skills",
      "'",
      "Strong congressional office policies and procedures understanding",
      "Recent administrative experience"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      ""
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "Congressman Steven Horsford seeks Staff Assistant for District Office in North Las Vegas. Applicants must be motivated to serve the 4th Congressional District of Nevada... The application deadline is January 31, 2014.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-109-14",
    "Posting_Author": "Congressman Steven Horsford",
    "Congress_Number": null,
    "State_District": "Nevada",
    "Location": "North Las Vegas",
    "Job_Function": "Community Liaison/Caseworker",
    "Title_Parsed": "Community Liaison/Caseworker",
    "Office_Type": "District Office",
    "Responsibilities": [
      "Monitors and updates the Congressman and Deputy District Director on district and local issues.",
      "Acts as a liaison to federal, district, and local agencies for the Congressman and constituents and answers casework correspondence and verbal communications with constituents."
    ],
    "Qualifications": [
      "Recent experience with, and understanding of U.S. Military",
      "understanding of Department of Veteran's Affairs structure, the procedures, and policies"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "Congressman Steven Horsford seeks Community Liaison/Caseworker for District Office in North Las Vegas. Applicants must be motivated to serve the 4th Congressional District of Nevada and possess a strong work ethic. The Community Liaison/Caseworker monitors and updates the Congressman and Deputy District Director on district and local issues. This position acts as a liaison to federal, district, and local agencies for the Congressman and constituents and answers casework correspondence and verbal communications with constituents.\n\nRecent experience with, and understanding of U.S. Military and Department of Veteran's Affairs structure, the procedures, and policies is required. Electronically submit cover letter, resume, professional references, and writing sample to NV04Jobs@mail.house.gov. Application deadline is Wednesday, January 22, 2014.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-108-14",
    "Posting_Author": "",
    "Congress_Number": null,
    "State_District": "",
    "Location": "",
    "Job_Function": "",
    "Title_Parsed": "",
    "Office_Type": "",
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-107-14",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "Labor Policy Counsel (Pensions)",
    "Title_Parsed": "Labor Policy Counsel (Pensions)",
    "Office_Type": "House Committee Democrats",
    "Responsibilities": [
      "(Pensions):",
      "jurisdiction over private sector employment issues"
    ],
    "Qualifications": [
      ""
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Equal opportunity employer.",
    "Cleaned_Text": "(Pensions): House Committee Democrats with jurisdiction over private sector employment issues seek highly motivated counsel or advisor to handle pension and retirement policy matters, including legislative and oversight work related to defined benefit pension plans, 401(k)’s, ERISA, the Pension Benefit Guaranty Corporation (PBGC), and the Employee Benefits Security Administration (EBSA). While the core of the work will be focused on retirement issues, this position may cover additional areas within labor policy, to be determined. Candidates must have familiarity with ERISA and employment and labor law generally, with at least three years of experience working in these areas. Candidates must have excellent research and writing skills. Candidates must thrive in a fast-moving environment; be team-oriented, creative, and strategic; and have a positive, can-do attitude. Experience working on Capitol Hill is a plus. This position provides an opportunity to work for highly engaged, energetic Members of Congress and policy staff with a strong commitment to strengthening workers’ rights and working families’ retirement security .Equal Opportunity employer. Salary commensurate with experience. Send cover letter and resume to edlabor.press@mail.house.gov.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-104-14",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": "MEM",
    "Location": "Los Angeles, CA 90017 Suite 120",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": "District Office",
    "Responsibilities": [
      "answer phones; handle mail and faxes; greet and direct visitors; maintain order & efficiency of front and back offices; order supplies; organize office files; coordinate with the Capitol Office to arrange tour and flag requests; coordinate vendor service needs; research the status of some legislation; draft some correspondence; assist the District Director and all District Office staff with additional tasks, as needed.",
      "Assist constituents with their individual cases pertaining to federal agencies. Help constituents to obtain timely consideration and cut through red tape. As the “front-line” caseworker, help constituents with nonfederal questions to find appropriate resources."
    ],
    "Qualifications": [
      "Prefer some experience working directly with the community.",
      "Solid interpersonal, Writing and organizational skills are essential. The successful applicant will be a team player, have a positive attitude and the ability to work and set priorities in a fast-paced environment.",
      "Spanish language skills considered a plus."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Spanish language skills"
    ],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  }
]