[
  {
    "Post_ID": "MEM-117-14",
    "Posting_Author": "Congressman Denny Heck (WA-10)",
    "Congress_Number": 117,
    "State_District": "WA",
    "Location": "Washington or Pacific Northwest",
    "Job_Function": "",
    "Title_Parsed": "",
    "Office_Type": "",
    "Responsibilities": [
      "helping staff with correspondence and research",
      "leading tours of the U.S. Capitol",
      "greeting guests",
      "answering phones",
      "assisting with other front-office duties"
    ],
    "Qualifications": [
      "highly motivated",
      "well-organized",
      "responsible",
      "good oral and written communication skills",
      "knowledgeable about current events",
      "demonstrate interest in public policy and government"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "The office of Congressman Denny Heck (WA-10) is looking for interns on a full or part-time basis. A qualified candidate is highly motivated, well-organized, responsible, and possesses good oral and written communication skills. In addition, candidates should be knowledgeable about current events and demonstrate interest in public policy and government.\n\nDuties will include helping staff with correspondence and research, leading tours of the U.S. Capitol, as well as greeting guests, answering phones, and assisting with other front-office duties. Washington or Pacific Northwest ties are preferred.\n\nWhile this is an unpaid internship, the office is happy to assist interns who qualify for academic credit.\n\nAll interested applicants should send a cover letter and resume to Paige.Langer@mail.house.gov",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-116-14",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "The Democratic office of the Committee on House Administration seeks energetic and self-motivated undergraduate or graduate level students as well as recent graduates with an interest in government and public policy to apply for its Spring 2014 internship. Working closely with Committee staff, interns will have the opportunity to gain first-hand knowledge of the inner-workings of a congressional committee and learn about the day-to-day administrative operations of the House of Representatives. Interns are responsible for assisting Committee staff with official proceedings (hearings/markups), elections oversight, member services, and other projects as well as providing general front office support. Please note that this is not a paid internship. Interested applicants should send a cover letter, resume, and available hours to aislan.sims@mail.house.gov with the subject headline, “CHA Dem Internship.”",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-115-14",
    "Posting_Author": "",
    "Congress_Number": null,
    "State_District": "",
    "Location": "Washington, D.C. or NY",
    "Job_Function": "",
    "Title_Parsed": "",
    "Office_Type": "",
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "Energetic NY Freshman Democrat is seeking a full-time (4-5 days a week) or part-time (20 hours or 3 days a week) press intern for the spring of 2014 in his Washington, D.C. or NY office. Responsibilities will include, but are not limited to compiling press clips, monitoring national and local daily news, drafting talking points and press releases, updating social media and working closely with the legislative staff. The ideal candidate will possess strong written communications skills, ability to work in a fast-paced environment, professionalism, and a good sense of humor. Please note that the internship is unpaid and housing is not provided, but students can qualify for academic credit depending on the requirements of the college or university. Interested applicants should e-mail a cover letter, resume, short writing sample (in the form of a speech or press release), and dates of availability with ",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-114-14",
    "Posting_Author": "Energetic NY Freshman Democrat ",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC office",
    "Job_Function": null,
    "Title_Parsed": "Intern",
    "Office_Type": null,
    "Responsibilities": [
      "attending Congressional briefings",
      "responding to constituent correspondence",
      "assisting with flag requests",
      "general office duties"
    ],
    "Qualifications": [
      "interest in the legislative process",
      "excellent communication skills",
      "ability to multi-task",
      "attention to detail",
      "sense of humor",
      "previous internship/work experience (desired)"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Equal opportunity employer.",
    "Cleaned_Text": "Energetic NY Freshman Democrat is seeking a highly motivated intern to join his Washington, DC office for a part time unpaid internship. Candidates should possess a professional and courteous demeanor, interest in the legislative process, excellent communication skills, the ability to multi-task, attention to detail, and a sense of humor. Main responsibilities include, but are not limited to, attending Congressional briefings, responding to constituent correspondence, assisting with flag requests, and general office duties. Candidates with New York ties and previous internship/work experience are strongly encouraged to apply. Please email a resume, cover letter, and a short writing sample to NYResumeInbox@mail.house.gov. No calls or walk-ins please.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-113-14",
    "Posting_Author": "Congresswoman Katherine Clark is accepting applications for unpaid internships in her congressional office in Washington, DC.",
    "Congress_Number": null,
    "State_District": "Massachusetts’s 5th District",
    "Location": "her congressional office in Washington, DC.",
    "Job_Function": "a great opportunity for students to experience how a congressional office operates and gain real insight into the legislative process while serving the people of",
    "Title_Parsed": "null",
    "Office_Type": "unpaid internship",
    "Responsibilities": [
      "working with staff to research issues and process information",
      "attending briefings on behalf of the office",
      "assisting with administrative tasks",
      "other projects as they arise"
    ],
    "Qualifications": [
      "students interested in government, politics, and public policy",
      "experience in research and communication is an asset"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "null",
    "Cleaned_Text": "Congresswoman Katherine Clark is accepting applications for unpaid internships in her congressional office in Washington, DC. This internship is a great opportunity for students to experience how a congressional office operates and gain real insight into the legislative process while serving the people of Massachusetts’s 5th District. Internship duties will include working with staff to research issues and process information, attending briefings on behalf of the office, assisting with administrative tasks, and other projects as they arise. An internship is an exciting opportunity for students interested in government, politics, and public policy, and will serve as a beneficial experience while exploring careers in these areas.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-112-14",
    "Posting_Author": "Senior Texas Democrat",
    "Congress_Number": null,
    "State_District": "Texas",
    "Location": "Washington D.C. office",
    "Job_Function": "Internship",
    "Title_Parsed": null,
    "Office_Type": "Member’s office",
    "Responsibilities": [
      "assisting the administrative and legislative staff with writing",
      "legislative research",
      "constituent services",
      "attending various briefings and hearings"
    ],
    "Qualifications": [
      "self-motivated",
      "detail oriented",
      "strong oral and written communication skills",
      "Texas ties preferred but not required"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "We are an equal opportunity employer)",
    "Cleaned_Text": "Senior Texas Democrat seeks full-time and part-time unpaid interns for the Spring 2014 semester in the member’s Washington D.C. office. Responsibilities will include assisting the administrative and legislative staff with writing, legislative research, constituent services, and attending various briefings and hearings.\nCandidates should be self-motivated, detail oriented and possess strong oral and written communication skills.* This is an excellent opportunity to gain experience on Capitol Hill while learning about the legislative process. Texas ties are preferred but not required.* If you are interested in this internship opportunity, please e-mail a cover letter, resume, references and a writing sample to Nawaid.Ladak@mail.house.gov.\n\n*    *No phone calls or walk-ins.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-105-14",
    "Posting_Author": "Congresswoman Betty McCollum",
    "Congress_Number": null,
    "State_District": "Minnesota's Fourth Congressional District",
    "Location": "Washington, D.C.",
    "Job_Function": "Intern",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Supporting administrative staff: answering phones, database entry, and sorting mail.",
      "Supporting legislative staff: tracking constituent correspondence, drafting letters, and conducting light research.",
      "Attending briefings and hearings for legislative staff.",
      "Compiling news clips.",
      "Promoting constituent outreach efforts by communicating with constituents and constituent groups, attending meetings and events, and drafting correspondence."
    ],
    "Qualifications": [
      "Being highly motivated and enthusiastic",
      "Having academic credit possibilities",
      "Having Minnesota ties"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "Intern needed to start immediately. Stipend available. Please indicate any connections to Minnesota in your cover letter's first paragraph.\n\nWe are seeking energetic and proficient interns in the Washington, D.C. office of\ncongresswoman Betty McCollum.\n\nAn internship in Congresswoman McColleumn's office will provide valuable experience to students as they prepare for their professional careers. Interns have the opportunity to work with and assist all members of the staff, including legislative, administrative, outreach and press duties.* *Washington, DC interns will be encouraged to take advantage of the many hearings, workshops and seminars that are held on Capitol Hill.\n\nIn addition, we are happy to work with your college or university to arrange for academic credit. Applicants should be highly motivated and enthusiastic, as there are far more applicants than available positions.* *Minnesota ties are strongly preferred.\n\nResponsibilities Include:\nSupporting administrative staff: answering phones, database entry, and sorting mail. Supporting legislative staff: tracking constituent correspondence, drafting letters, and conducting light research. Attending briefings and hearings for legislative staff. Compiling news clips. Promoting constituent outreach efforts by communicating with constituents and constituent groups, attending meetings and events, and drafting correspondence.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-103-14",
    "Posting_Author": "",
    "Congress_Number": null,
    "State_District": "",
    "Location": "",
    "Job_Function": "",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "assist staff with official proceedings",
      "provide general front office support"
    ],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "MEM-103-14 The Republican office of the Committee on House Administration seeks energetic and self-motivated undergraduate or graduate level students as well as recent graduates with an interest in government and public policy to apply for its Spring 2014 internships. Working closely with Committee staff, interns will have the opportunity to gain first-hand knowledge of the inner-workings of a congressional committee and learn about the day-to-day administrative operations of the House of Representatives. Interns are responsible for assisting Committee staff with official proceedings (hearings/markups), oversight, research and other projects as well as providing general front office support. Unlike most House internships, this is a paid internship. To apply, please send a cover letter and resume to CHARep.Intern@mail.house.gov. Please limit your resume to one page only.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-102-14",
    "Posting_Author": "House Democratic Leadership Office",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Legislative team for spring 2014",
    "Job_Function": "Administrative",
    "Title_Parsed": "Internship Vacancy",
    "Office_Type": "Democratic",
    "Responsibilities": [
      "answerining and screening telephone calls",
      "greeting visitors",
      "assisting staff and other administrative duties"
    ],
    "Qualifications": [
      "well-organized",
      "hard-working and detailoriented",
      "high degree of professionalism"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "House Democratic Leadership Office seeks interns to join Legislative team for spring 2014. Candidates should be well-organized, hard-working and detailoriented. High degree of professionalism required. Duties include answering and screening telephone calls, greeting visitors, assisting staff and other administrative duties as needed. Please email cover letter, resume and references to: NJ01.DCINTERN@mail.house.gov",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-101-14",
    "Posting_Author": "The Office of Congressman Steven Horsford (NV-4)",
    "Congress_Number": 1,
    "State_District": "NV-4",
    "Location": "Nevada’s 4th Congressional District",
    "Job_Function": "",
    "Title_Parsed": "Intern",
    "Office_Type": "Congressional Internship",
    "Responsibilities": [
      "Assisting the legislative, communications, and administrative staff with day-to-day operations including attending briefings, answering phones, conducting Capitol Tours, drafting constituent response letters"
    ],
    "Qualifications": [
      "Students/recent graduates with ties to Nevada’s 4th Congressional District or a diverse background"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "",
    "DW_NOMINATE": -0.3219999969005585,
    "LES": 0.2571782469749451
  },
  {
    "Post_ID": "MEM-316-13",
    "Posting_Author": "The Office of Congresswoman Maxine Waters (CA-43)",
    "Congress_Number": null,
    "State_District": "CA-43",
    "Location": "Washington, D.C.",
    "Job_Function": "press and social media intern",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "compiling press clips",
      "monitoring daily news",
      "drafting talking points and press releases",
      "updating social media"
    ],
    "Qualifications": [
      "previous experience in public relations or journalism",
      "strong written communications skills",
      "ability to work in a fast-paced environment",
      "professional manner"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "public relations",
      "journalism"
    ],
    "Equal_Opportunity_Information": "The Equal Employment Opportunity Commission is committed to making employment decisions without bias on the basis of race, color, religion, sex, national origin, age, disability, or genetic information.",
    "Cleaned_Text": "MEM-316-13\nThe Office of Congresswoman Maxine Waters (CA-43) is seeking a full-time or part-time press and social media intern for the spring of 2014 in her Washington, D.C. office. Responsibilities will include, but are not limited to compiling press clips, monitoring daily news, drafting talking points and press releases, updating social media and working closely with the communications director. The ideal candidate will have previous experience in public relations or journalism, possess strong written communications skills, ability to work in a fast-paced environment, and professional manner. Please note that the internship is unpaid and housing is not provided, but student can qualify for academic credit depending on the requirements of the college or university. Interested applicants should e-mail a cover letter, resume, short writing sample (in the form of a speech or press release) and dates of availability with “Spring Press Intern 2014’ in the subject line to latoya.veal@mail.house.gov. No phone calls or drop-ins please.\n\n6",
    "DW_NOMINATE": -0.656000018119812,
    "LES": 1.28559672832489
  }
]