[
  {
    "Post_ID": "MEM-122-14",
    "Posting_Author": "Congressman Kurt Schrader’s Washington, D.C. office",
    "Congress_Number": null,
    "State_District": "Washington, D.C.",
    "Location": "Washington, D.C.",
    "Job_Function": "Front office duties, and tasks such as drafting correspondence, research projects, and attending hearings",
    "Title_Parsed": "Congressman Kurt Schrader’s Washington, D.C. office is now accepting internship applications for the spring term.",
    "Office_Type": null,
    "Responsibilities": [
      "Assisting team with phones, mail, tours, flag-requests, drafting correspondence, and research projects"
    ],
    "Qualifications": [
      "Positive and energetic, have excellent people and organizational skills"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "All applicants will receive equal consideration",
    "Cleaned_Text": "MEM-122-14 Congressman Kurt Schrader’s Washington, D.C. office is now accepting internship applications for the spring term. Interns will be responsible for assisting team with phones, mail, tours, flag.requests, and related front office duties. Additional tasks, including drafting correspondence, research projects, and attending hearings may be assigned on a case by case basis. Ideal candidates are positive and energetic, have excellent people and organizational skills, and are eager to assist with the legislative and administrative needs of the staff. Applicants should be available to work part-time (approximately 20 hours) per week.\n\nUndergraduate and post-graduate students are eligible to apply. Positions are unpaid and serve to provide professional and educational value to participants,\nbudgets have been established for the intern.  Oregon ties are preferred.\n\nIf interested, please contact our office at mailto:Julia.Stafford@mail.house.gov with 'Spring Internship' in the subjest line. Please include a cover letter, resume and a writing sample.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-121-14",
    "Posting_Author": "null",
    "Congress_Number": null,
    "State_District": null,
    "Location": "null",
    "Job_Function": "null",
    "Title_Parsed": "Internship in a House Congressional office for an unpaid internship during the spring semester",
    "Office_Type": "null",
    "Responsibilities": [
      "assisting staff",
      "answering phones",
      "other office duties"
    ],
    "Qualifications": null,
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "null",
    "Cleaned_Text": "Seeking motivated student to serve in a House Congressional office for an unpaid internship during the spring semester, beginning as soon as possible. Excellent opportunity for Hill experience with senior Republican member from the House Energy and Commerce Committee. Job responsibilities include assisting staff, answering phones, and other office duties. Please email your Resume to robert.hankins@mail.house.gov.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-120-14",
    "Posting_Author": "The Office of Congressman Jim Costa (CA-16)",
    "Congress_Number": null,
    "State_District": "CA-16",
    "Location": null,
    "Job_Function": "Legislative and administrative staff support",
    "Title_Parsed": null,
    "Office_Type": "Internship",
    "Responsibilities": [
      "Attending briefings and hearings",
      "Answering phones",
      "Sorting mail",
      "Drafting constituent correspondence letters",
      "Giving Capitol tours",
      "Doing legislative research",
      "Multi-tasking",
      "Excellent communication skills"
    ],
    "Qualifications": [
      "Having ability to multi-task",
      "Possess excellent communication skills",
      "Interest in the legislative and governmental process"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "Not required but preferred for California applicants. ",
    "Cleaned_Text": "We are seeking motivated, organized, and reliable individuals to assist the legislative and administrative staff with day-to-day duties. Such duties include attending briefings and hearings, answering phones, sorting mail, drafting constituent correspondence letters, giving Capitol tours, doing legislative research and various other tasks. Applicants should possess excellent communication skills, have the ability to multi-task, and have an interest in the legislative and governmental process. Interns will gain valuable Hill and office experience, as well as have access to many unique networking opportunities. California ties are preferred, but not required. Please send a resume, cover letter and writing sample to megan.funkhouser@mail.house.gov. In your cover letter, please address your times and dates of availability.",
    "DW_NOMINATE": -0.3790000081062317,
    "LES": 0.9714145660400391
  },
  {
    "Post_ID": "MEM-117-14",
    "Posting_Author": "Congressman Denny Heck (WA-10)",
    "Congress_Number": 114,
    "State_District": "WA-10",
    "Location": "Washington",
    "Job_Function": "",
    "Title_Parsed": "",
    "Office_Type": "Internship",
    "Responsibilities": [
      "helping staff with correspondence and research",
      "leading tours of the U.S. Capitol",
      "greeting guests",
      "answering phones"
    ],
    "Qualifications": [
      "highly motivated",
      "well-organized",
      "responsible",
      "good oral and written communication skills",
      "knowledgeable about current events",
      "demonstrate interest in public policy and government"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "The office of Congressman Denny Heck (WA-10) is looking for interns on a full or part-time basis. A qualified candidate is highly motivated, well-organized, responsible, and possesses good oral and written communication skills. In addition, candidates should be knowledgeable about current events and demonstrate interest in public policy and government.\n\nDuties will include helping staff with correspondence and research, leading tours of the U.S. Capitol, as well as greeting guests, answering phones, and assisting with other front-office duties. Washington or Pacific Northwest ties are preferred.\n \\\n\\\n   While this is an unpaid internship, the office is happy to assist interns who qualify for academic credit. All interested applicants should send a cover letter and \\resume to \\Paige.Langer@mail.house\\.gov\\",
    "DW_NOMINATE": -0.4600000083446503,
    "LES": 0.347923070192337
  },
  {
    "Post_ID": "MEM-116-14",
    "Posting_Author": "Aislan Sims",
    "Congress_Number": 116,
    "State_District": "DC",
    "Location": "Washington DC",
    "Job_Function": "Intern",
    "Title_Parsed": null,
    "Office_Type": "Committee Staff",
    "Responsibilities": [
      "Assisting with official proceedings (hearings/markups), elections oversight, member services, and other projects"
    ],
    "Qualifications": [
      "Undergraduate or graduate level degree in relevant field.",
      "Experience working in government or public policy."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Administrative support",
      "Policy development",
      "Communications skills"
    ],
    "Equal_Opportunity_Information": "The Democratic office is an Equal Opportunity Employer. Applications from all qualified candidates are encouraged.",
    "Cleaned_Text": "MEM-116-14\n\nThe Democratic office of the Committee on House Administration seeks energetic and self-motivated undergraduate or graduate level students as well as recent graduates with an interest in government and public policy to apply for its Spring 2014 internship. Working closely with Committee staff, interns will have the opportunity to gain first-hand knowledge of the inner-workings of a congressional committee and learn about the day-to-day administrative operations of the House of Representatives. Interns are responsible for assisting Committee staff with official proceedings (hearings/markups), elections oversight, member services, and other projects as well as providing general front office support. Please note that this is not a paid internship. Interested applicants should send a cover letter, resume, and available hours to aislan.sims@mail.house.gov with the subject headline, “CHA Dem Internship.”\n\n",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-115-14",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": "NY office",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": "NY office or Washington, D.C. ",
    "Responsibilities": [
      "compiling press clips",
      "monitoring national and local daily news",
      "drafting talking points and press releases",
      "updating social media"
    ],
    "Qualifications": [
      "strong written communications skills",
      "ability to work in a fast-paced environment",
      "professionalism",
      "good sense of humor. (not necessary but nice)"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "No phone calls or drop-ins, please.",
    "Cleaned_Text": "Energetic NY Freshman Democrat is seeking a full-time (4-5 days a week) or part-time (20 hours or 3 days a week) press intern for the spring of 2014 in his Washington, D.C. or NY office.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-114-14",
    "Posting_Author": "",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": "Internship",
    "Title_Parsed": null,
    "Office_Type": "DC Office",
    "Responsibilities": [
      "attending Congressional briefings",
      "responding to constituent correspondence",
      "assisting with flag requests",
      "general office duties"
    ],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Yes",
    "Cleaned_Text": "Energetic NY Freshman Democrat is seeking a highly motivated intern to join his Washington, DC office for a part time unpaid internship. Candidates should possess a professional and courteous demeanor, interest in the legislative process, excellent communication skills, the ability to multi-task, attention to detail, and a sense of humor. Main responsibilities include, but are not limited to, attending Congressional briefings, responding to constituent correspondence, assisting with flag requests, and general office duties. Candidates with New York ties and previous internship/work experience are strongly encouraged to apply. Please email a resume, cover letter, and a short writing sample to NYResumeInbox@mail.house.gov. Equal opportunity employer. No calls or walk-ins please.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-113-14",
    "Posting_Author": "Congresswoman Katherine Clark",
    "Congress_Number": null,
    "State_District": "Massachusetts's 5th District",
    "Location": "Washington, DC",
    "Job_Function": "Internship",
    "Title_Parsed": "",
    "Office_Type": "Congressional",
    "Responsibilities": [
      "Working with staff to research issues and process information",
      "Attending briefings on behalf of the office",
      "Assisting with administrative tasks",
      "Other projects as they arise"
    ],
    "Qualifications": [
      "Students interested in government, politics, and public policy"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-112-14",
    "Posting_Author": "Senior Texas Democrat",
    "Congress_Number": null,
    "State_District": "Texas",
    "Location": "Washington D.C.",
    "Job_Function": "Administrative and Legislative Staff Support",
    "Title_Parsed": "Staff Position - Spring Internship",
    "Office_Type": "Member's office",
    "Responsibilities": [
      "assist with writing",
      "legislative research",
      "constituent services"
    ],
    "Qualifications": [
      "self-motivated",
      "detail oriented",
      "strong oral and written communication skills"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Capitol Hill experience"
    ],
    "Equal_Opportunity_Information": "This is an equal opportunity employer.",
    "Cleaned_Text": "Senior Texas Democrat seeks full-time and part-time unpaid interns for the Spring 2014 semester in the member’s Washington D.C. office.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-111-14",
    "Posting_Author": "The Office of Congressman Reid Ribble",
    "Congress_Number": 4,
    "State_District": null,
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Intern",
    "Office_Type": null,
    "Responsibilities": [
      "assisting the staff with a variety of tasks"
    ],
    "Qualifications": [
      "excellent writing and communication skills",
      "strong organizational abilities",
      "good work ethic"
    ],
    "Salary_Min": 1000,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "equal job opportunity employer",
    "Cleaned_Text": "{\n    \"responsibilities\": [\n        \"assisting the staff with a variety of tasks\",\n        \"office administration\",\n        \"legislative research\",\n        \"constituent correspondence\"\n    ],\n    \"qualifications\": [\n        \"excellent writing and communication skills\",\n        \"strong organizational abilities\",\n        \"good work ethic\"\n    ]}",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-110-14",
    "Posting_Author": "Congressman Jerry McNerney (CA-09)",
    "Congress_Number": null,
    "State_District": "CA-09",
    "Location": "Washington D.C.",
    "Job_Function": null,
    "Title_Parsed": "Internship",
    "Office_Type": null,
    "Responsibilities": [
      "attending Congressional briefings",
      "giving tours of the Capitol",
      "conducting research",
      "responding to constituent inquiries",
      "processing tour and flag requests"
    ],
    "Qualifications": [
      "a professional and courteous demeanor",
      "excellent communication skills",
      "ability to multi-task",
      "fastidious attention to detail",
      "interest in the legislative and governmental process"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "This firm provides equal employment opportunities to all qualified candidates without regard to race, color, religion creed, sex, national origin, citizenship status, age disability or veterans' standing.",
    "Cleaned_Text": "Congressman Jerry McNerney (CA-09) is currently accepting applications for internship positions in his Washington D.C. office. This unpaid internship will provide valuable hands-on experience in a Congressional office and a greater understanding of the legislative process.\nResponsibilities will include, but are not limited to, attending Congressional briefings, giving tours of the Capitol, conducting research, responding to constituent inquiries, and processing tour and flag requests. Qualified applicants should possess a professional and courteous demeanor, excellent communication skills, the ability to multi-task, fastidious attention to detail, and interest in the legislative and governmental process.\nThis is an excellent opportunity for college students and recent graduates seeking Capitol Hill experience. All majors are encouraged to apply.\nTies to California’s Ninth Congressional District are preferred, but not required. Interested applicants should email a resume and cover letter to nick.sullivan@mail.house.gov with “CA-09 Internship” in the subject line. Include dates of availability.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-105-14",
    "Posting_Author": "Congresswoman Betty McCollum",
    "Congress_Number": null,
    "State_District": "Minnesota's Fourth Congressional District",
    "Location": "Washington, D.C.",
    "Job_Function": "Internship",
    "Title_Parsed": null,
    "Office_Type": "Congresswoman's office",
    "Responsibilities": [
      "Supporting administrative staff: answering phones, database entry, and sorting mail.",
      "Supporting legislative staff: tracking constituent correspondence, drafting letters, and conducting light research.",
      "Attending briefings and hearings for legislative staff.",
      "Compiling news clips.",
      "Promoting constituent outreach efforts by communicating with constituents and constituent groups, attending meetings and events, and drafting correspondence."
    ],
    "Qualifications": [
      "Be highly motivated and enthusiastic as there are far more applicants than available positions.",
      "Minnesota ties are strongly preferred."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "Congresswoman McCollum is committed to equality",
    "Cleaned_Text": "{",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-103-14",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "The Republican office of the Committee on House Administration intern",
    "Office_Type": "Spring",
    "Responsibilities": [
      "Assisting Committee staff with official proceedings (hearings/markups)",
      "Oversight, research and other projects",
      "Providing general front office support"
    ],
    "Qualifications": [
      "Undergraduate or graduate level students",
      "Students with an interest in government and public policy"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "This is the Equal Employment Opportunity information for this job, as it is required by law: The House of Representatives administers employment discrimination prohibitions established by Executive Order 11246.",
    "Cleaned_Text": "The Republican office of the Committee on House Administration seeks energetic and self-motivated undergraduate or graduate level students as well as recent graduates with an interest in government and public policy to apply for its Spring 2014 internships. Working closely with Committee staff, interns will have the opportunity to gain first-hand knowledge of the inner-workings of a congressional committee and learn about the day-to-day administrative operations of the House of Representatives. Interns are responsible for assisting Committee staff with official proceedings (hearings/markups), oversight, research and other projects as well as providing general front office support. Unlike most House internships, this is a paid internship. To apply, please send a cover letter and resume to CHARep.Intern@mail.house.gov. Please limit your resume to one page only.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-102-14",
    "Posting_Author": "House Democratic Leadership Office",
    "Congress_Number": null,
    "State_District": "Nevada's 4th Congressional District",
    "Location": "Washington D.C.",
    "Job_Function": "Internship",
    "Title_Parsed": "Intern",
    "Office_Type": "Legislative team for spring 2014",
    "Responsibilities": [
      "answer and screen telephone calls",
      "greet visitors",
      "assist staff and other administrative duties as needed"
    ],
    "Qualifications": [
      "students/recent graduates with ties to Nevadas 4th Congressional District or a diverse background"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "House Democratic Leadership Office seeks interns to join Legislative team for spring 2014. Candidates should be well-organized, hard-working and detailoriented. High degree of professionalism required. Duties include answering and screening telephone calls, greeting visitors, assisting staff and other administrative duties as needed. Please email cover letter, resume and references to: NJ01.DCINTERN@mail.house.gov Students/recent graduates with ties to Nevadas 4th Congressional District or a diverse background are strongly encouraged to apply, though these are not requirements for qualification. Applications will be accepted on a rolling basis. Please send a single PDF file containing your resume, cover letter and a brief writing sample to NV04internships@gmail.com.",
    "DW_NOMINATE": null,
    "LES": null
  }
]