[
  {
    "Post_ID": "MEM-374-13",
    "Posting_Author": null,
    "Congress_Number": 13,
    "State_District": null,
    "Location": "Washington, DC office",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": "Member",
    "Responsibilities": [
      "Preparing and staffing the Member for committee hearings and markups",
      "Monitoring legislative developments within Committees and on the House floor",
      "Developing and advancing legislation and other policy priorities of the Member",
      "Contributing to floor speeches and other external communications",
      "Researching and advising the Member on bills and other issues",
      "Representing the Member in meetings",
      "Drafting constituent correspondence"
    ],
    "Qualifications": [
      "Superior organizational skills",
      "Strong written and oral communication skills",
      "Strong interpersonal skills",
      "Ability to multi-task and thrive in a fast-paced environment"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Economic development"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-373-13",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": "Ohio",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "managing all new media platforms (Facebook, Twitter, You Tube and Instagram)"
    ],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Ohio republican house member seeks press assistant to join staff.",
    "Cleaned_Text": "MEM-373-13\nOhio Republican House Member seeking press assistant to join staff. Applicants should be self-starting, hard-working and creative. Must have strong writing and verbal skills and be extremely detail oriented. Job responsibilities include: managing all new media platforms (Facebook, Twitter, You Tube and Instagram), updating the web site, writing press releases and columns, creating videos and graphics, taking photos and running telephone town halls. Experience with new media, HTML, Final Cut Pro, Movie Maker and Photoshop helpful. Possibility of eventual promotion to press secretary a possibility based on job performance over time. Interested applicants should send cover letter, resume and writing sample to oh.ushouse.job@gmail.com.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-370-13",
    "Posting_Author": null,
    "Congress_Number": 13,
    "State_District": null,
    "Location": null,
    "Job_Function": "Press Secretary - Senior Republican",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "drafting/distributing press releases; writing weekly newsletters, Op-Eds;",
      "maintaining and updating website content; preparation of talking points and speeches; establishing and maintaining strong relations with district and DC media and executing an aggressive earned local media campaign."
    ],
    "Qualifications": [
      "energetic, creative, strategic, quick-thinking.",
      "politically astute and can quickly master a range of issues in time-sensitive situations.",
      "must be able to work independently without frequent direct supervision.",
      "experience working on campaigns or with members of Congress.",
      "self-motivated individual.",
      "strong organizational skills.",
      "must have experience with media",
      "bilingualism or language skills is an asset."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "video",
      "audio",
      "photography",
      "editing in those mediums",
      "social media"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "Press Secretary - Senior Republican seeking press secretary with superior writing skills who is energetic, creative, strategic, and quick-thinking. The successful candidate is a self-starter who is politically astute and can quickly master a range of issues in time-sensitive situations. Responsibilities include, but limited to: drafting/distributing press releases; writing weekly newsletters, Op-Eds; maintaining and updating website content; preparation of talking points and speeches; establishing and maintaining strong relations with district and DC media and executing an aggressive earned local media campaign. New media skills are a must, including knowledge of video, audio and/or photography and editing in those mediums as well as social media. No phone calls. Email resumes to PA.Resumes@mail.house.gov.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-361-13",
    "Posting_Author": "Rep. Jerry McNerney",
    "Congress_Number": null,
    "State_District": "California (District)",
    "Location": null,
    "Job_Function": "Communications Director",
    "Title_Parsed": "Communications Director - California Democrat",
    "Office_Type": null,
    "Responsibilities": [
      "serving as chief spokesperson",
      "successfully pitching stories and press events to both national and local media entities",
      "responding promptly to media inquiries",
      "effectively messaging policy and other priorities",
      "maintaining an aggressive new media profile",
      "preparing the member for live interviews",
      "writing press releases",
      "producing op-eds, speeches, talking points, and franked mail"
    ],
    "Qualifications": [
      "excellent written and oral communication skills",
      "strong editing and proofreading abilities",
      "political communications experience and the ability to respond to challenging situations quickly and strategically"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "aggressive new media profile",
      "team work",
      "writing samples"
    ],
    "Equal_Opportunity_Information": "California (District) ties and Capitol Hill experience are a plus",
    "Cleaned_Text": "MEM-361-13\nCOMMUNICATIONS DIRECTOR - California Democrat (Rep. Jerry McNerney) seeks experienced communications director to develop and execute aggressive long-term media and outreach plan.\nResponsibilities include serving as chief spokesperson, successfully pitching stories and press events to both national and local media entities, responding promptly to media inquiries, effectively messaging policy and other priorities, maintaining an aggressive new media profile, preparing the member for live interviews, writing press releases, and producing op-eds, speeches, talking points, and franked mail.\n\n\nExcellent written and oral communication skills, strong editing and proofreading abilities, and the desire to work collaboratively with a team in a fast-paced ðenvironment are required.\nCandidate must work closely with the Member and staff.\nIdeal candidate would be politically astute and have a good sense of humor.\nDesired qualities include political communications experience and the ability to respond to challenging situations quickly and strategically. This position requires n-ónon-traditional hours and travel to the District.\nCalifornia (District) ties and Capitol Hill experience are a plus. Qualified applicants should submit a cover letter, resume and two writing samples to:McNerney.Resumes@mail.house.gov\nNo calls or drop bys, please.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-356-13",
    "Posting_Author": null,
    "Congress_Number": 3,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": null,
    "Title_Parsed": "Scheduler/Office Administrator",
    "Office_Type": null,
    "Responsibilities": [
      "structuring and managing the Member's daily schedule",
      "coordinating the Member's travel and logistical details of meetings",
      "handling the Member's personal correspondence",
      "fulfilling various administrative duties including prepare/process office payments, and ethics/disclosure compliance",
      "working closely with other staff members in the district and in DC to facilitate meetings"
    ],
    "Qualifications": [
      "superior organizational skills",
      "strong oral and written communication skills",
      "strong interpersonal skills",
      "poise, patience, and a good sense of humor",
      "strategic thinker who can navigate competing demands to maximize the Member's time and come to anticipate the Member's needs"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "organizational skills",
      "oral and written communication skills",
      "interpersonal skills"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "Freshman Midwestern Democratic Member seeks an organized, detail oriented and energetic Scheduler/Office Administrator for a fast-paced, team-oriented Washington, DC office.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-349-13",
    "Posting_Author": null,
    "Congress_Number": 4,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "Communications Director",
    "Office_Type": null,
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "Florida Leadership House Democrat seeks highly motivated and experienced Communications Director to handle press, speech-writing and communications and messaging strategy. Candidates must have excellent writing skills, on-the-record press experience, strong political instincts, and new media experience.Candidates must thrive in a fast-moving, aggressive communications environment; be team-oriented, nimble, creative and strategic; and have a positive, can-do attitude. The Communications Director also develops working relationships with print, electronic and social media press as well as communications teams in other congressional offices and the Executive Branch to coordinate and execute the Member’s overall communication efforts. This position provides an opportunity to work for a highly engaged, energetic Member of Congress who has a successful record of improving the lives of women, children, seniors and fighting for the middle-class. Equal opportunity employer. Salary commensurate with experience. Hill experience and Spanish literacy is a positive. Please send resume to DCResumes@mail.house.gov. No emails, phone calls or drop-bys please.",
    "DW_NOMINATE": null,
    "LES": null
  }
]