[
  {
    "Post_ID": "MEM-048-25",
    "Posting_Author": "Democratic Staff of the House Committee on Oversight and Government Reform",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, D.C.",
    "Job_Function": "Digital Director",
    "Title_Parsed": "Digital Director",
    "Office_Type": "Full-time",
    "Responsibilities": [
      "Developing and honing a proactive digital strategy",
      "Overseeing the Committee's branding",
      "Crafting engaging content (including graphics, videos, and copy) for all social media channels",
      "Creating social media toolkits for Committee Members and the caucus as needed",
      "Tracking social media analytics",
      "Streaming live events",
      "Capturing and editing photos",
      "Managing the committee's website and social media pages",
      "Working with the Communications team to identify new ways to engage with press and digital audiences"
    ],
    "Qualifications": [
      "At least 2 years of digital experience",
      "Excellent writing skills",
      "A keen attention to details",
      "Proficiency in graphic design",
      "Ability to leverage social media and news trends to take advantage of opportunities for social engagement",
      "Passion for thinking creatively about how to translate complex ideas into compelling visuals"
    ],
    "Salary_Min": null,
    "Salary_Max": 70000,
    "Skills_Mentioned": [
      "Adobe programs (Photoshop, Canva, Illustrator, LightRoom, Premiere Pro, Audition, and After Effects)",
      "HTML"
    ],
    "Equal_Opportunity_Information": "All applicants will be considered without regard to race, color, religion, sex...}",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-047-25",
    "Posting_Author": "Brad Sherman (CA-32)",
    "Congress_Number": null,
    "State_District": "(Sherman Oaks) office",
    "Location": "(Sherman Oaks) office",
    "Job_Function": "Caseworker position",
    "Title_Parsed": "null",
    "Office_Type": "office",
    "Responsibilities": [
      "Interact with constituents via phone and email; Assist senior staff with administrative responsibilities; Contact federal agencies on behalf of constituents"
    ],
    "Qualifications": [
      "Organized, professional, highly motivated ; Strong writing, typing and interpersonal skills"
    ],
    "Salary_Min": 45000,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Microsoft Office",
      "Database software"
    ],
    "Equal_Opportunity_Information": "We strive to create an inclusive environment for all employees.",
    "Cleaned_Text": "null",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-046-25",
    "Posting_Author": "",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "Counsel (JD required) or Professional Sta5 Member",
    "Office_Type": "Republican Sta",
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "The House Committee on Homeland Security Republican Sta] is hiring for a Counsel (JD°required) or Professional Sta5 Member supporting the Director of Investigations and the Subcommittee on Oversight, Investigations, and Accountability. The ideal candidate will have at least two years of experience with a background or strong interest in congressional oversight and investigations. Experience in homeland security issues is a plus.\n\nResponsibilities include, but are not limited to, sta]ing Subcommittee and some Full Committee congressional hearings, drafting Subcommittee and some Full Committee correspondence to and from the Executive Branch as well as with outside organizations, conducting depositions/ transcribed interviews, reviewing document productions,\nresearch, managing external sources of information, and interacting with\nvarious congressional committee and personal o]ices.\n\nCandidates must possess a strong work ethic, superior attention to detail, be selfmotivated, work well under pressure, and possess excellent written and oral communication skills. The ability to work both independently and as part of a team are critical. Prior Hill experience preferred. Interested candidates should send a resume and\ncover letter to Resumes.CHS Mail.house.gov with the subject line “OIA Counsel <Applicant First and Last Name> - OIA Counsel” or “OIA PSM - <Applicant First and °ast Name>.”",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-045-25",
    "Posting_Author": "Congressman Glenn Ivey",
    "Congress_Number": null,
    "State_District": "MD-04",
    "Location": "Washington D.C.",
    "Job_Function": "Correspondence Fellow",
    "Title_Parsed": "Office of Congressman Glenn Ivey (MD-04)",
    "Office_Type": "The U.S. House of Representatives",
    "Responsibilities": [
      "drafting replies to constituent letters",
      "including any necessary research",
      "proofreading mail",
      "providing administrative assistance as required",
      "and other duties as assigned"
    ],
    "Qualifications": [
      "motivated team player",
      "exceptional writing skills",
      "scrupulous attention to detail",
      "strong organizational abilities",
      "effective time management",
      "professional demeanor",
      "college and graduate students",
      "early career candidates with a passion for writing"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "writing",
      "research",
      "proofreading"
    ],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer and does not discriminate based on race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation, or any other characteristic protected by applicable law, in any of its activities or operations.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-043-25",
    "Posting_Author": "The Office of General Counsel (“OGC•), which provides legal advice and representation to Members, committees, officers, and employees of the House on matters related to their official duties without regard to political affiliation.",
    "Congress_Number": null,
    "State_District": "Washington",
    "Location": "none, but work location in Washington D.C. can be negotiated.",
    "Job_Function": "Legal Advice and Representation",
    "Title_Parsed": "Associate General Counsel/Assistant General Counsel",
    "Office_Type": "House of Representatives",
    "Responsibilities": [
      "drafting district court pleadings and appellate briefs; appearing in court in litigation matters..."
    ],
    "Qualifications": [
      " Minimum Requirements: (1) excellent academic credentials; (2) at least three years’ experience as a practicing attorney, including any judicial clerkships; (3) excellent writing, analytical, and people skills; (4) excellent judgment; (5) ability to work with, and to provide high quality legal advice and representation..."
    ],
    "Salary_Min": null,
    "Salary_Max": 204500,
    "Skills_Mentioned": [
      "judicial clerkship or other government experience; experience drafting dispositive motions in federal district courts"
    ],
    "Equal_Opportunity_Information": "true",
    "Cleaned_Text": "The Office of General Counsel (OGC), which provides legal advice and representation to Members, committees, officers, and employees of the House on matters related to their official duties without regard to political affiliation, is accepting applications...",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-040-25",
    "Posting_Author": "Congressman Rob Wittman",
    "Congress_Number": null,
    "State_District": "VA01",
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": "Legislative Director",
    "Responsibilities": [
      "Develop and implement a comprehensive legislative strategy aligned with the Congressman’s priorities and constituents' needs.",
      "Manage and mentor a legislative team, provide guidance, and foster collaboration among sta] members.",
      "Build and maintain relationships with other lawmakers, committee sta], advocacy groups, and stakeholders to advance the Congressman’s legislative goals.",
      "Engage with district stakeholders, including local leaders, businesses, and community organizations, to understand their needs and incorporate their perspectives into legislative e]orts.",
      "Understand the political landscape and anticipate the implications of legislative actions as it relates to VA-01.',",
      "Draft legislation, amendments, and policy papers, ensuring clarity and adherence to congressional procedures.",
      "Maintains up-to-date tracking reports on all legislative items including Sponsored and Cosponsored legislation and letters, provisions in larger bills, and district wins.",
      "Review responses to all constituent mail, and review content produced by the communications team.",
      "Represent the Congressman in meetings with constituents, interest groups, and other legislative o]ices."
    ],
    "Qualifications": [
      "Minimum of 5 years of experience in legislative a]airs, public policy, or a related ﬁeld, preferably in a congressional o]ice.",
      "Strong understanding of the legislative process and federal government operations.",
      "Excellent writing, research, and communication skills.",
      "Proven ability to work collaboratively in a fast-paced environment and manage multiple priorities.",
      "Commitment to public service and the values of Congressman Wittman.",
      "Virginia ties Preferred"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "MEM-040-25\nOverview: Congressman Rob Wittman is seeking a highly motivated and experienced\nLegislative Director to lead his legislative agenda and coordinate policy initiatives in his\nWashington, D.C. o]ice. The Legislative Director would handle the Congressman’s Natural\nResources Committee assignment, as well as Energy, Environment and Chesapeake Bay,\nTax, Telecom/Broadband, Transportation & Infrastructure, Appropriations and the Budget,\nImmigration, Labor/Workforce/Federal Employees. In addition, the Legislative Director will\nhave a close working relationship with the Chief of Sta] in building and maintaining\nrelationships with other lawmakers, committee sta], and advocacy groups.\nThe Legislative Director should be knowledgeable about issues relating to Virginia and VA01, and work closely with the District Director and district stakeholders, including local\nleaders, businesses, and community organizations, to understand their needs and\nincorporate their perspectives into legislative e]orts. Most importantly, the Legislative\nDirector should have a genuine commitment to public service and advocating for the best\ninterests of Virginia’s First District.\nKey Responsibilities:\n• Develop and implement a comprehensive legislative strategy aligned with the\nCongressman’s priorities and constituents' needs.\n• Manage and mentor a legislative team, provide guidance, and foster collaboration\namong sta] members.\n• Build and maintain relationships with other lawmakers, committee sta], advocacy\ngroups, and stakeholders to advance the Congressman’s legislative goals.\n• Engage with district stakeholders, including local leaders, businesses, and\ncommunity organizations, to understand their needs and incorporate their\nperspectives into legislative e]orts.\n• Understand the political landscape and anticipate the implications of legislative\nactions as it relates to VA-01.\n• Draft legislation, amendments, and policy papers, ensuring clarity and adherence to\ncongressional procedures.\n• Maintains up-to-date tracking reports on all legislative items including Sponsored\nand Cosponsored legislation and letters, provisions in larger bills, and district wins.\n• Review responses to all constituent mail, and review content produced by the\ncommunications team.\nMonitor legislative developments and provide timely updates to the Congressman\nand his sta].\n\nQualiﬁcations:\n• Minimum of 5 years of experience in legislative a]airs, public policy, or a related \\\t ﬁeld, preferably in a congressional \\\t o]ice.\n• Strong understanding of the legislative process and federal government operations.\n• Excellent writing, research, and communication skills.\n• Proven ability to work collaboratively in a fast-paced environment and manage\nmultiple priorities.\n• Commitment to public service and the values of Congressman Wittman.\n• Virginia ties Preferred\nInterested candidates should send a resume, cover letter, and references to Carolyn.King@mail.house.gov with the subject line “Legislative Director Application.”",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-038-25",
    "Posting_Author": "Congresswoman Jahana Hayes (CT-05)",
    "Congress_Number": null,
    "State_District": "CT-05",
    "Location": "Washington, D.C.",
    "Job_Function": "Communications Director",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Lead strategy development and implementation of the Member's communications objectives in consultation with senior staff.",
      "Oversee day-to-day press activities, including responding to media inquiries, booking interviews, and pitching to media outlets.",
      "Produce press releases, speeches, op-eds, talking points, and statements.",
      "Develop and execute press conferences and public events centered around core messaging areas.",
      "Advance and staff the Member at media events and other commitments, including nights and weekends;",
      "Develop social media content creation, including rapid response;",
      "Produce franked communications, including 499s and mailers;,",
      "Stay up to date on current events and legislation relevant to the Member and the priorities of the district;",
      "Assist the Member and senior staff in other projects and duties as assigned."
    ],
    "Qualifications": [
      "Capitol Hill or political experience or a demonstrated knowledge of Congress and the legislative process;",
      "3-4 years of experience, with on the record experience as a press secretary or other communications role;",
      "Superior writing, editing, and oral communications skills;",
      "Creative thinker with innovative approaches and an understanding of traditional communications and digital media;",
      "Ability to work collaboratively and courteously with others;",
      "Ability to work in a fast-paced environment, prioritize tasks, and adapt quickly and easily for rapid response;",
      "Careful attention to detail;",
      "Availability to work non-traditional hours;",
      "Experience working with stakeholders on messaging opportunities and priorities."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "Women, minorities and candidates with Connecticut ties are strongly encouraged to apply.",
    "Cleaned_Text": "This is the cleaned text for this job listing.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-036-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Legislative Director",
    "Office_Type": null,
    "Responsibilities": [
      "works closely with the Chief of Staff in assisting with the formulation of the Member's policy and legislative strategy"
    ],
    "Qualifications": [
      "Prior Legislative Director Experience",
      "Proﬁcient at moving legislation",
      "Capitol Hill experience",
      "Great writer",
      "Management Experience",
      "Proﬁcient at Microsoft suite",
      "Detail oriented",
      "Multitasker"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "Legislative Director Job Listing",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-035-25",
    "Posting_Author": "U.S. House of Representatives",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": null,
    "Title_Parsed": "Professional Sta] Member",
    "Office_Type": "Subcommittee on Health",
    "Responsibilities": [
      "Leading oversight including organizing and participating in meetings, drafting memos, limited domestic travel, and other oversight duties as assigned.",
      "Conducting research to support oversight and legislative activities.",
      "Leading legislation drafting e]orts.",
      "Representing the Committee including meeting with other congressional sta], veteran service organizations, and external healthcare stakeholders.",
      "Perform other duties as assigned by the Subcommittee Sta] Director.",
      "Problem solving skills.",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams"
    ],
    "Qualifications": [
      "Undergraduate degree",
      "Veterans are strongly encouraged to apply",
      "Post-graduate-level writing skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Strong research and writing skills",
      "Ability to work effectively with diverse stakeholders",
      "Experience with legislation drafting e]orts"
    ],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-029-25",
    "Posting_Author": "Democratic Leader Hakeem Jeires",
    "Congress_Number": null,
    "State_District": null,
    "Location": "The O]ice of Democratic Leader Hakeem Jeires",
    "Job_Function": "Speechwriter",
    "Title_Parsed": "Speaker of the Hawaii House of Representatives",
    "Office_Type": null,
    "Responsibilities": [
      "drafting written remarks",
      "talking points",
      "press statements"
    ],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The Office is an equal opportunity employer committed to a diverse and inclusive workforce.",
    "Cleaned_Text": "The O]ice of Democratic Leader Hakeem Jeires seeks an exceptional writer and researcher to support all aspects of a fast-paced communications operation.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-028-25",
    "Posting_Author": "n/a",
    "Congress_Number": null,
    "State_District": "n/a",
    "Location": "n/a",
    "Job_Function": "Content Management",
    "Title_Parsed": "Content Partnership Manager",
    "Office_Type": null,
    "Responsibilities": [
      "[list of responsibilities 1]",
      "[list of responsibilities 2]",
      "[list of responsibilities 3]"
    ],
    "Qualifications": [
      "Digital Communications Expertise",
      "Strong Analytical Skills",
      "Ability to Work with Multiple Teams and Manage Multiple Projects"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Digital Communication",
      "Social Media Platforms",
      "Marketing Strategy"
    ],
    "Equal_Opportunity_Information": "House Democratic Policy and Communications Committee is an equal opportunity employer",
    "Cleaned_Text": "Content Partnership Manager",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-034-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": "Contracting Investigator",
    "Title_Parsed": "House Committee on Veterans’ A]airs Majority sta]",
    "Office_Type": "Committee",
    "Responsibilities": [
      "",
      "",
      ""
    ],
    "Qualifications": [
      "Undergraduate degree",
      "Work experience in procurement operations, preferably as a contract specialist or contracting o]icer in a federal agency",
      "Command of the Federal Acquisition Regulation and familiarity with major procurement laws"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "",
      "Federal Acquisition Regulation",
      "Major procurement laws"
    ],
    "Equal_Opportunity_Information": "Veterans are strongly encouraged to apply. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-033-25",
    "Posting_Author": "The Office of Congresswoman Alma S. Adams (NC12)",
    "Congress_Number": null,
    "State_District": "NC12",
    "Location": "Washington, DC office",
    "Job_Function": "Scheduler for Congresswoman's Washington, DC office",
    "Title_Parsed": ", Scheduler for Congresswoman's Washington, DC office",
    "Office_Type": null,
    "Responsibilities": [
      "",
      "Manage and maintain the Congresswoman’s daily and long-term schedule, ensuring all appointments, meetings, events, and travel are accounted for.",
      "Receive, prioritize, and organize incoming scheduling requests from internal and external stakeholders.",
      "Communicate with external organizations, constituents, and other congressional offices to coordinate scheduling requests, events, and meetings.",
      "Maintain flexibility to accommodate changes to the schedule throughout the day and ensure the Congresswoman is briefed on updates in real time.",
      "Ensure that all meetings, events, and activities are properly logged and tracked."
    ],
    "Qualifications": [
      "",
      "Exceptional time management skills",
      "Ability to prioritize and manage competing demands",
      "Capacity to perform well under pressure in a fast-paced environment"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The Office of Congresswoman Alma S. Adams (NC12) is an equal opportunity employer committed to diversity and inclusion.",
    "Cleaned_Text": ", Scheduler for Congresswoman's Washington, DC office, manages complex schedule, organizes official travel, acts as liaison with various stakeholders.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-032-25",
    "Posting_Author": "Congresswoman Janelle Bynum (OR-5)",
    "Congress_Number": null,
    "State_District": "OR-5",
    "Location": "Washington, D.C.",
    "Job_Function": "Legislative Assistant",
    "Title_Parsed": "Legislative Assistant",
    "Office_Type": "Office of a Congressperson",
    "Responsibilities": [
      "Develop legislative initiatives and collaborate closely with the legislative and communications teams to advance the Congresswoman’s priorities.",
      "Monitor legislative developments in Congress and the Administration and provide vote recommendations.",
      "Meet with constituents and advocacy groups, draft briefing materials, and prepare talking points.",
      "Staff the Congresswoman at relevant meetings and events.",
      "Other tasks as assigned."
    ],
    "Qualifications": [
      "Previous relevant policy and/or Capitol Hill experience is required. Oregon-ties are a plus.",
      "A customer service-first attitude",
      "The ability to anticipate the evolving needs of a battleground member.",
      "Entrepreneurial skills.",
      "The ability to adapt to the fast-paced environment of a new member office."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Legislative process",
      "Policy",
      "Capitol Hill"
    ],
    "Equal_Opportunity_Information": "We encourage candidates from diverse backgrounds to apply.",
    "Cleaned_Text": "Congresswoman Janelle Bynum (OR-5) seeks a Legislative Assistant to join her Washington, D.C. office.\n\nThe position will primarily be responsible for managing an active policy portfolio based on both the office’s needs and the selected candidate’s interests.\n\nThe Congresswoman’s priorities include advocating for family-first policies, lowering the cost of living, promoting economic growth, and making government work better for all Americans.\n\nThis position will not handle the House Financial Services Committee portfolio.\n\nResponsibilities\n• Develop legislative initiatives and collaborate closely with the legislative and communications teams to advance the Congresswoman’s priorities.\n• Monitor legislative developments in Congress and the Administration and provide vote recommendations.\n\n\ffi• Meet with constituents and advocacy groups, draft briefing materials, and prepare talking points.\n• Staff the Congresswoman at relevant meetings and events.\n• Other tasks as assigned\n\nThis is not an entry-level position and previous relevant policy and/or Capitol Hill experience is required. Oregon-ties are a plus.\nPreference will be given to candidates who understand the appropriations process, have a customer service-first attitude, and can anticipate the evolving needs of a battleground member.\nSuccessful candidates are those who have a constant appetite to learn about legislative processes, possess entrepreneurial skills, and demonstrate the ability to adapt to the fast-paced environment of a new member office.\nOur office is committed to diversity and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity, disability, age, or national origin. We encourage candidates from diverse backgrounds to apply.\nTo apply, please send in a single PDF: cover letter, resume, and contact information for three professional references to BynumOregonJobs@gmail.com with the subject line ",
    "DW_NOMINATE": 0.1669999957084656,
    "LES": 1.452904462814331
  },
  {
    "Post_ID": "MEM-030-25",
    "Posting_Author": "Representative Jill Tokuda (D-HI-02)",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "Legislative Assistant / senior LA / policy advisor",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "sta]ing the Representative",
      "monitoring committee and Floor activities",
      "developing and advancing legislative initiatives",
      "reviewing constituent correspondence",
      "coordinating with the communications team and District O]ice"
    ],
    "Qualifications": [
      "strong communication skills",
      "relevant policy experience",
      "positive and can-do attitude",
      "willingness to work in a fast-paced, collaborative environment"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "The o]ice is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Diverse candidates are strongly encouraged to apply.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-026-25",
    "Posting_Author": "Congressman Greg Steube",
    "Congress_Number": null,
    "State_District": "null",
    "Location": "Washington D.C.",
    "Job_Function": "Communications Director",
    "Title_Parsed": "Communications Director",
    "Office_Type": "Congressional office",
    "Responsibilities": [
      "Pitch and book local and national media regularly to ensure strong and consistent coverage.",
      "Develop and maintain strong relationships with local and national press to amplify the Congressman’s message.",
      "Create daily social media content (including graphic design) and write compelling statements, press releases, media advisories, op--eds, radio ad scripts, and the weekly newsletter.",
      "Draft talking points, speeches, and key messaging for public appearances and interviews.",
      "Oversee and manage a large communications budget, covering areas such as mass mailers, digital ads, radio ads, text messages, surveys, and email campaigns.",
      "Produce, edit, and clip video content for use on social media and other platforms.",
      "The Communications Director will also manage a Deputy Communications Director to help execute these tasks and ensure smooth operations across all communications initiatives."
    ],
    "Qualifications": [
      "__missing information:Experience working in a Congressional office or political campaign.",
      "__missing information:Familiarity with video production tools (Adobe Premiere, Final Cut Pro, etc.)",
      "__missing information:Knowledge of local and national political landscape, with a particular understanding of Congressman Steube’s policy priorities and messaging."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "__missing information:Experience managing budgets and working with vendors, including for advertising and media buys.",
      "__missing information:A self-starter who can work independently and as part of a dynamic team."
    ],
    "Equal_Opportunity_Information": "Congressman Greg Steube's office is an equal opportunity employer.",
    "Cleaned_Text": "MEM-026-25\n\nCOMMUNICATIONS DIRECTOR\nCongressman Greg Steube is seeking an experienced, highly motivated Communications Director to spearhead the office’s strategic communications efforts. This individual will manage all aspects of media relations, content creation, and digital strategy. The ideal candidate will be an exception….",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-022-25",
    "Posting_Author": "Congresswoman Madeleine Dean",
    "Congress_Number": null,
    "State_District": "PA-04",
    "Location": "Glenside, PA",
    "Job_Function": null,
    "Title_Parsed": "Caseworker (Social Security and Medicare)",
    "Office_Type": "District Office",
    "Responsibilities": [
      "Acts as the representa9ve for the Member in the realm of Social Security and Medicare...",
      "Informs the Member and District Director of all happenings in his or her assigned issue areas.",
      "Handles and priori9zes casework assignments...",
      "Maintains up-to-date ﬁles on all cases and issues of importance to the o﬊ce."
    ],
    "Qualifications": [
      "Strong oral and wriYen communica9on skills.",
      "Knowledge of legisla9ve process and of House organiza9on and procedures.",
      "Professional telephone manner.",
      "Temperament to communicate with a variety of personali9es...",
      "Ability to work coopera9vely and courteously with others."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Strong oral and wriYen communica9on skills.",
      "Knowledge of legisla9ve process and of House organiza9n and procedures.",
      "Professional telephone manner.",
      "Temperament to communicate with a variety of personali9es...",
      "Ability to work coopera9vely and courteously with others."
    ],
    "Equal_Opportunity_Information": "The oﬃce is an equal opportunity employer; we do not discriminate on the basis of race, color,...",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-021-25",
    "Posting_Author": "HOUSE COMMITTEE ON VETERANS’ AFFAIRS",
    "Congress_Number": null,
    "State_District": "Democratic Sta]",
    "Location": null,
    "Job_Function": "Communications Director",
    "Title_Parsed": "Communications Director",
    "Office_Type": "House Committee on Veterans’ A]airs",
    "Responsibilities": [
      "Serve as primary communications advisor for the Ranking Member and Democratic",
      "Manage the execution of the communications strategy",
      "Oversee day-to-day press activities, including responding to media inquiries,",
      "Work with policy leads to develop core messaging and talking points",
      "Produce press releases, speeches, op-eds, and materials",
      "Supervise other press sta]",
      "Assist with the development of talking points, remarks, statements, press releases",
      "Coordinate with Committee Member o]ices on any press related needs",
      "Sta] Ranking Member at press events"
    ],
    "Qualifications": [
      "Superior writing, editing, and oral communications skills",
      "Creative thinker with innovative approaches and an understanding of digital media",
      "Ability to work cooperatively and courteously with others",
      "Ability to work in a fast-paced environment, prioritize tasks, and adapt quickly and easily for rapid response"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "digital media"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "The Democratic Sta] of the House Committee on Veterans’ A]airs seeks a Communications Director to implement the Ranking Member’s Committee communications strategy.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-019-25",
    "Posting_Author": "Energy and Commerce Committee Democratic",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "communications professional",
    "Title_Parsed": "Press Assistant",
    "Office_Type": null,
    "Responsibilities": [
      "Drafting press releases, social media posts, talking points, and the committee newsletter;",
      "Designing graphics for both social media and web content;",
      "Producing and editing videos and photos;",
      "Monitoring social media;",
      "Maintaining and updating press lists;",
      "Compiling daily press clips."
    ],
    "Qualifications": [
      "Excellent written and oral communication skills",
      "Proven ability to perform under pressure while juggling multiple tasks and sound political judgment",
      "Prior Hill or campaign communications experience, as well as professional social media and digital experience (including graphic design and photo and video editing)",
      "Our o]ice deeply values the diversity of our employees and encourages candidates from diverse backgrounds to apply."
    ],
    "Salary_Min": null,
    "Salary_Max": 65000,
    "Skills_Mentioned": [
      "writing",
      "communication",
      "graphic design",
      "video editing",
      "photo editing"
    ],
    "Equal_Opportunity_Information": "Our office deeply values the diversity of our employees and encourages candidates from diverse backgrounds to apply.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-016-25",
    "Posting_Author": "The O[ice of Congresswoman Pramila Jayapal (WA-07)",
    "Congress_Number": null,
    "State_District": "WA-07",
    "Location": "Washington, DC",
    "Job_Function": "Senior Legislative Assistant",
    "Title_Parsed": "Senior Legislative Assistant",
    "Office_Type": "Congresswoman’s office",
    "Responsibilities": [
      "Driving current and new legislative initiatives including idea generation, legislative drafting and producing accompanying materials, such as speeches, policy memos, and factsheets;",
      "Preparing and stai]ing the Congresswoman for relevant committee hearing and markups; drafting hearing remarks and questions;",
      "Representing the CongressWoman’s priorities with external stakeholders;",
      "Building and maintaining relationships with external and internal stakeholders including advocacy organizations; academics; fellow Congressional and Committee o]ices;",
      "Carrying out additional duties as required."
    ],
    "Qualifications": [
      "4 -6 years of relevant experience including policy development and analysis; issue advocacy; and strategic planning;",
      "Passionate about public service and committed to progressive values;"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The O]ice of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply.",
    "Cleaned_Text": "{ \"cleaned_text\": \"MEM-016-25 Position Location: Washington, DC The O]ice of Congresswoman Pramila Jayapal (WA-07) is seeking an experienced Senior Legislative Assistant to handle a comprehensive portfolio that could include the following issues: education, childcare, tax, ﬁnancial services, housing, healthcare, labor, transportation, commerce and small business. The issue set will depend on the candidate’s experience and interests. We encourage individuals with legislative, research and writing experience to apply and we will discuss the issue set more in depth through the interview process.This position requires the ability to advance Congresswoman Jayapal's legislative priorities in their issue portfolio. The ideal candidate will come with previous legislative experience, including the knowledge and abilities to drive issues with traditional legislative tools (i.e. committee work, bill introductions) as well as organizing tools (i.e. events with partners, in district town halls).\nResponsibilities include but are not limited to:\n• Driving current and new legislative initiatives including idea generation, legislative drafting and producing accompanying materials, such as speeches, policy memos, and factsheets;\n• Preparing and stai]ing the Congresswoman for relevant committee hearing and markups; drafting hearing remarks and questions;\n• Representing the CongressWoman’s priorities with external stakeholders;\n• Building and maintaining relationships with external and internal stakeholders including advocacy organizations; academics; fellow\n Congressional and Committee o]ices;\n• Carrying out additional duties as required.\n\nJob Requirements:\n• 4 -6 years of relevant experience including policy development and analysis; issue\ndoing; and strategic planning;\n• Passionate about public service and committed to progressive values;\\\n• Excellent writing and time management skills;\n• Ability to digest new content with a political and ideological lens that is appropriate for the o]ice;\n• Poised, level-headed, ﬂexible, collaborative, team oriented; and\n• Eager to learn, grow, and thrive in a dynamic and high-paced environment.\n\nThe O]ice of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus. Prior Hill experience is strongly preferred.\nCandidates should submit their resume, cover letter, two writing samples, and references in PDF format to jobs.pramila@mail.house.gov with \\",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-015-25",
    "Posting_Author": "Congresswoman Summer L. Lee (D-Pittsburgh)",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Collaborate with the Legislative Director and Chief of Staç to formulate and advance legislative initiatives for assigned issue areas",
      "Plans, coordinates, and schedules to introduce legislation in the House (or oþring it on an appropriate vehicle if it is in an amendment)",
      "Developing and analyzing legislation and policy",
      "Drafting remarks, talking points, and memos"
    ],
    "Qualifications": [
      "Prior legislative experience",
      "Demonstrated ability to translate policy ideas into successful legislative outcomes",
      "District or state ties are a plus"
    ],
    "Salary_Min": 68000,
    "Salary_Max": 78000,
    "Skills_Mentioned": [
      "Attention to Detail",
      "Legislative Knowledge",
      "Coalition Build"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-013-25",
    "Posting_Author": "Congresswoman Sarah McBride",
    "Congress_Number": null,
    "State_District": "DE-AL",
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Legislative Assistant",
    "Office_Type": null,
    "Responsibilities": [
      "Collaborate with the Congresswoman...",
      "Represent the CongressWoman in meetings...",
      "Perform additional responsibilities..."
    ],
    "Qualifications": [
      "Legislative experience...",
      "Strong written and verbal...",
      "Ability to exercise sound judgment...",
      "Excellent organizational and time management skills..."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "The o]ice of Congresswoman Sarah McBride is an equal opportunity employer...",
    "Cleaned_Text": "---\nMEM-013-25\nPosition Overview:\nCongresswoman Sarah McBride (DE-AL) is seeking a Legislative Assistant for her\nWashington, D.C. o]ice. This position will focus on a diverse legislative portfolio, including\nthe Congresswoman's work on the Science, Space, and Technology Committee.\nThe ideal candidate will be a self-starter with strong writing, research, and communication\nskills, capable of producing high-quality work in a fast-paced environment. This is not an\ntwo entry-level position. Previous legislative experience in a congressional o]ice is required.\nA positive attitude, attention to detail, the ability to thrive in a collaborative team\nenvironment, and a good sense of humor are essential.\nKey Responsibilities:\n• Collaborate with the CongressWoman for her work on the Science, Space, and Technology\nCommittee, including writing remarks, managing relationships, and advancing legislation.\n• Sta] the CongressWoman for her work on the Science, Space, and Technology\nCommittee\ndrafting brie\fcings matria\rel for the o\frsionalsd\ndate of\nclearand preparingfor\nderings,\nmeetings.   nrepresent the Congressional Representative in meeti\ngspartialization.\nstee\ng\new York\ntate of\fi\tnia \n.assist with\nLocal initiatives.\\tional time\nmanagement skills tom anage multiple projects \n Simultaneously.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-012-25",
    "Posting_Author": "Congresswoman Shontel M. Brown (OH-11)",
    "Congress_Number": null,
    "State_District": "OH-11",
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Operations Assistant/Legislative Correspondent",
    "Office_Type": "Legislative Office",
    "Responsibilities": null,
    "Qualifications": null,
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "We are an equal opportunity employer and do not discriminate on the basis of race, sex, color, religion, national origin, age, gender identity, sexual orientation, marital or parental status, or disability. Candidates of diverse backgrounds are encouraged to apply.",
    "Cleaned_Text": "MEM-012-25Congresswoman Shontel M. Brown (OH-11) is seeking a full-time Operations Assistant/Legislative Correspondent in her Washington, D.C. office. The position reports to the Administrative Director and Legislative Director. Responsibilities include logging phone calls, greeting visitors, managing front office operations, handling tour and flag requests, assisting with drafting constituent correspondence and managing the mail program, overseeing the intern program, providing administrative support to the team, and additional duties as assigned. A successful candidate will have excellent writing and proofreading ability, outstanding organizational and time management capacity, strong attention to detail, and the ability to work independently. Ohio ties are a plus.\nTO APPLY: All interested candidates are encouraged to submit a cover letter, resume, and writing sample to Ohio11resumes@mail.house.gov with the subject \\",
    "DW_NOMINATE": -0.4449999928474426,
    "LES": 0.08653660118579865
  },
  {
    "Post_ID": "MEM-011-25",
    "Posting_Author": "Congressman Greg Stanton",
    "Congress_Number": null,
    "State_District": "Mesa",
    "Location": "Arizona",
    "Job_Function": "Outreach Coordinator (full-time)",
    "Title_Parsed": "Outreach Coordinator",
    "Office_Type": " Congressional Office",
    "Responsibilities": [
      "Act as the representative for the Congressman within their area of responsibility including answering correspondence, occasionally speaking at events, meeting with constituents, and communicating with local stakeholders.",
      "Inform the District Director of all happenings in their assigned issue areas by screening district media sources and interacting with constituents.",
      "Coordinate and organize meetings and events with local stakeholders in their assigned issue areas for the Congressman",
      "Serve as a liaison to local, state, and federal officials and other people or groups to form effective relationships for the Congressman",
      "Work with other district and DC staff to identify and promote the Congressman's legislative agenda.",
      "Track legislation, Dear Colleague Letters, and other developments in their assigned issue areas and use this information to keep constituencies apprised and connected to the Congressman's work.",
      "Congressman Stanton's office is an equal opportunity employer and candidates from diverse and underrepresented backgrounds are strongly encouraged to apply. Salary is commensurate with experience.",
      "Valid driving license and access to a car",
      "Willingness to work evenings, weekends and irregular hours",
      "Ability to speak, read and write in other languages is a plus"
    ],
    "Qualifications": [
      "Strong written and oral communications skills and the ability to work effectively in a fast-paced environment.",
      "Experience developing and maintaining relationships with constituents and community leaders.",
      "Ability to think strategically and creatively.",
      "Strong decision-making skills :], "
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Knowledge of issues and events in the district in which the Congressman has been involved as well as a good understanding of federal-level policy work",
      "Understanding of the federal legislative process as well as federal agencies and departments",
      "Previous experience working for an elected official or as an issue/community organizer",
      "Ability to work cooperatively and courteously with others",
      "Excellent organizational skills and careful attention to detail",
      "Valid driver’s license and access to a car",
      "Willingness to work evenings, weekends and irregular hours"
    ],
    "Equal_Opportunity_Information": "Congressman Stanton's office is an equal opportunity employer and candidates from diverse and underrepresented backgrounds are strongly encouraged to apply.",
    "Cleaned_Text": " congress man seeks motivated outreach coordinator (full-time) in his mesa district o]ice to implement a strong constituency-based outreach program in the 4th congressional district. this position will help build and maintain relationships with key stakeholders and work to address local issues on the federal level. an ideal candidate will have: ... ",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-009-25",
    "Posting_Author": "Congressman Rob Wittman",
    "Congress_Number": 1,
    "State_District": "VA-01",
    "Location": "",
    "Job_Function": "Digital Media Manager",
    "Title_Parsed": null,
    "Office_Type": "",
    "Responsibilities": [
      ""
    ],
    "Qualifications": [
      ""
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-008-25",
    "Posting_Author": "Congressman Mike Flood",
    "Congress_Number": null,
    "State_District": "NE-01",
    "Location": "Norfolk, NE or willingness to relocate",
    "Job_Function": "District Special Assistant",
    "Title_Parsed": null,
    "Office_Type": "Special Assistant",
    "Responsibilities": [
      "transport the Member and other sta] members to meetings and appointments as necessary",
      "Transportation of the Member for their o]icial duties",
      "Deliver and pickup materials for the o]ice, including letters, packages, and documents from other government agencies",
      "Running errands and assisting the District Director with supplies and other misc. administrative matters",
      "Assisting in sorting and delivering mail",
      "Sta]ing the Member at various meetings and events",
      "Serving as a personal aide to the Member, tending to various needs as they arise while he is in the district"
    ],
    "Qualifications": [
      "Ability to communicate e]ectively with the Member and o]ice sta],"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "This job provides equal opportunity for all qualified applicants",
    "Cleaned_Text": "District Special Assistant \\u2013 Congressman Mike Flood (NE-01)\\nThe primary responsibility of the District Special Assistant is to transport the Member and\\no] members to meetings and appointments as necessary, deliver and pickup\\no]ice, sta] the Member at various meetings, and serve as a personal aide\\nto the Member when he is in the district. When the Member is in DC, the Special As\\isitant will assist the district sta]\\f with \\field rep duties and casework. Typical responsibilities may\\ninclude, but are not limited to:\\u00a0\\u00a4\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\nTransportation of the Member for their o]icial duties.\\nDeliver and pickup materials for the o]ice, including letters, packages, and documents from other government agencies.\\nWorking with the Scheduler to be aware of the Member’s schedule.\\nRunning errands and assisting the District Director with supplies and other misc. administrative matters.\\nAssisting in sorting and delivering mail.\\nestaring the Member at various meetings and events.\\nserving as a personal aide to the Member, tending to various needs as they arise while he is in the district.\\n\\nAssisting the Field Reps with events, meetings, and correspondence as necessary.\\n\\nAssisting with casework as necessary.\\nThe requirements for this position are:\\n\\u00a4\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\u00a4\\u00a0\\u00a0\\u00a0\\u00a0\\u00a0\\nLocated in Norfolk, NE or willingness to relocate.\\nRegular, predictable and punctual attendance at assigned locations required for performance of duties.\\n\\n\\n\\n\\n\\n\\n\\n\\nThe requirements for this position are:\\nmust possess a valid driver’s license and have a good driving record. A personal vehicle used to drive the Member is not necessarily}\\nrequired.\nRegularly lifts and moves luggage, books, \\u00a0files, documents, and other o]ice materials.\\nmust be able to prioritize and perform duties under pressure in a fast-paced environment.\\nRegularly use typical o]ice equipment, software programs, and methods of communication, including, for example, a computer, email, telephone, smartphone, photocopier, fax machine, etc.\\nInterested applicants should send their resume, cover letter, and references to FloodHiring@mail.house.gov",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-530-24",
    "Posting_Author": "House Committee on Veterans’ Affairs, Majority Staffer",
    "Congress_Number": 0,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": "Research Assistant",
    "Title_Parsed": "SUBCOMMITTEE ON DISABILITY ASSISTANCE AND MEMORIAL AIARRS - RESEARCH ASSISTANT",
    "Office_Type": "Subcommittee on Disability Assistance and Memorial A]airs",
    "Responsibilities": [
      "Provide administrative and research support to Subcommittee staff and assists with duties as assigned.",
      "Maintain Subcommittee archives of activities, including Member and stakeholder engagements.",
      "Travel and conduct oversight visits at agency locations.",
      "Draft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee’s jurisdiction.",
      "Subcommittee casework as assigned.",
      "Answer telephone and respond to caller inquiries.",
      "- Keep abreast of emails, including Member inquiries and agency notifications.",
      "- Organize and maintain Subcommittee electronic records, including meeting notes, agency reports, other documents.",
      "- Participate in staff-level discussions on legislation being considered; draft policy memoranda as assigned.",
      "- Assist with due diligence being performed as part of the Subcommittee’s oversight duties, including requesting information from agencies on matters within the Subcommittee jurisdiction.",
      "- Assist with hearing preparation and coordination of hearings, including drafting memoranda and remarks for Chairman.",
      "- Attend meetings with agencies, veteran service organizations, and other parties, and maintain notes on such meetings.",
      "- Assist with the drafting of memoranda for the full Committee and Subcommittee Chairman on matters within the jurisdiction of the Subcommittee.",
      "- Review the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to Subcommittee Members and staff.",
      "- Assist with developing policy recommendations and serve as a resource for Members both on and off Committee.",
      "- Responsible for all other duties assigned by the full Committee Chairman, Subcommittee Chairman, full Committee Staff Director or Deputy Staff Director, and Subcommittee Staff Director, and assisting other Committee staff, as needed."
    ],
    "Qualifications": [
      "Bachelor of Arts or Science.",
      "Strong research skills. Legal research skills (e.g., LexisNexis) is a plus.",
      "Strong writing and editing skills.",
      "Strong Microsoft Office proficiency, including expertise in Word and the ability to use Excel.",
      "Strong organizational skills.",
      "Strong verbal communication.",
      "Excellent attention to detail.",
      "Excellent listening skills.",
      "Strong ability to manage fluctuating workloads and juggle and prioritize tasks, including managing short-, medium-, and long-term tasks.",
      "Team oriented.",
      "Excellent ability to work well under pressure and time constraints.",
      "Problem solving and analytical skills are a plus.",
      "Potential to work independently."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Legal research",
      "Writing",
      "Organizational skills"
    ],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "{\"title\":\"Research Assistant\",\"location\":\"Washington, DC\",\"employment_status\": \"full-time\",\"min_salary\":null,\"max_salary\":null,\"skills_required\":[\"research",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-517-24",
    "Posting_Author": "Congresswoman Susie Lee (D-NV)",
    "Congress_Number": null,
    "State_District": "NV",
    "Location": null,
    "Job_Function": "DC Scheduler",
    "Title_Parsed": "DC Scheduler",
    "Office_Type": "Chief of Staff office",
    "Responsibilities": [
      "The DC Scheduler will report to the Chief of Staff...",
      "Responsibilities also include tracking, evaluating...",
      "Candidates strong candidates will be creative problem solvers...",
      "The position requires the ability to multi-task...",
      "Candidates should submit in PDF format..."
    ],
    "Qualifications": null,
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "An equal opportunity employer...",
    "Cleaned_Text": "MEM-517-24\nCongresswoman Susie Lee (D-NV) seeks a highly organized..., The position requires the ability to multi-task...",
    "DW_NOMINATE": null,
    "LES": null
  }
]