[
  {
    "Post_ID": "MEM-196-25",
    "Posting_Author": "House Natural Resources Committee Democrats’",
    "Congress_Number": null,
    "State_District": "Washington",
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Fall 2025 Intern, House Committee on Natural Resources – Democratic Staff",
    "Office_Type": null,
    "Responsibilities": [
      "Assist with administrative duties",
      "Assist with legislative and policy projects",
      "Research legislation, regulations, and public law",
      "Assist with communications and outreach",
      "Respond to requests for information",
      "Attend briefings, meetings, and hearings on behalf of staff"
    ],
    "Qualifications": [
      "Demonstrates an awareness of and sensitivity to the needs and concerns of individuals from diverse cultures",
      "Understands how HNRC issues intersect with racism, economic and social inequality in the United States",
      "Has a passion for working to dismantle these systems"
    ],
    "Salary_Min": null,
    "Salary_Max": 3200,
    "Skills_Mentioned": [
      "Exceptional interpersonal skills",
      "Awareness of and sensitivity to diverse cultures"
    ],
    "Equal_Opportunity_Information": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law.",
    "Cleaned_Text": "MEM-196-25\nFall 2025 Intern, House Committee on Natural Resources – Democratic Staff\nThe House Natural Resources Committee Democrats seek full-time interns for Fall 2025\r\n(September 2 – December 12). Applicants must be organized, detail oriented, and dependable. Above all, we seek candidates who are passionate about issues within the\r\nNatural Resources Committee's jurisdiction, demonstrate exceptional interpersonal skills,\r\nand are eager to learn about committee process. Interns will conduct legislative research,\r\nprepare for hearings, assist with administrative duties, perform outreach, and aid communications.\nPreferred qualifications: Demonstrates an awareness of and sensitivity to the needs and concerns of individuals from diverse cultures, backgrounds, and orientations.\nUnderstands how HNRC issues intersect with racism, economic and social inequality in the United States, and has a passion for working to dismantle these systems.\nPrimary responsibilities include:· Assist with administrative duties\n· Assist with legislative and policy projects\n· Research legislation, regulations, and public law\n· Assist with communications and outreach\n· Respond to requests for information\n· Attend briefings, meetings, and hearings on behalf of staff\r\nThe position is based in Washington, D.C. Interns will be expected to work in-office when Congress is in session and as needed. The position comes with a monthly stipend of $3,200 plus transit benefits.\nThis office is an equal opportunity employer; we do not discriminate on the basis of race,\r\ncolor, religion, sex, gender identity or expression, national origin, age, disability, military\r\nstatus, parental status, marital status, sexual orientation, or any other factor or basis\r\nprohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring process are encouraged to request an accommodation at any time during those processes.\n\n\thttps://democrats-naturalresources.house.gov/internships.\nDue to the volume of applicants, we will only be reaching out to candidates who are being actively considered for this position.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-194-25",
    "Posting_Author": "Congressman French Hill (AR02)",
    "Congress_Number": null,
    "State_District": "AR02",
    "Location": null,
    "Job_Function": "Intern or internship positions",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "(AR02) has internship positions available for the Fall 2025 term in both his DC and Little Rock offices.",
      "Interns will work in a fast-paced environment, gaining valuable exposure and knowledge of the legislative process and the U.S. Congress while helping central Arkansans.",
      "(Interns should have a positive attitude, strong work ethic, and excellent written and oral communication skills.)",
      "Successful interns will be detail-oriented self-starters, take and listen to direction, and be willing to work both independently and as part of a team.",
      "(Applicants should have a working knowledge of current events and policy topics as well as a willingness to assist with daily office tasks.)",
      "Arkansas ties strongly preferred.",
      "(Internships are open to college and graduate students as well as recent graduates.).",
      "(The office offers paid and unpaid internships depending on availability.).",
      "(To apply, please send a resume cover letter, ...)"
    ],
    "Qualifications": [
      "to be considered for the internship positions; applicants must be current registered members of a political party.",
      "[… 40 credit hours in courses such as political science, history, economics, or other related fields …]"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "current events",
      "policy topics",
      "daily office tasks"
    ],
    "Equal_Opportunity_Information": "All applicants will receive equal consideration",
    "Cleaned_Text": "(MEM-194-25 Congressman French Hill (AR02) has internship positions available for the Fall 2025 term in both his DC and Little Rock offices. Interns will work in a fast-paced environment, gaining valuable exposure and knowledge of the legislative process and the U.S. Congress while helping central Arkansans. Intern responsibilities include answering constituent phone calls, assisting staff with administrative tasks, conducting legislative research, and assisting with correspondence. ... Arkansas ties strongly preferred. Intermships are open to college and graduate students as well as recent graduates... The office offers paid and unpaid internships depending on availability.)",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-193-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "The Democratic Staff of the Committee on Rules is seeking part- and full-time interns for the fall (September - December). Our interns work closely with Committee staff to prepare materials for Committee meetings, conduct research projects, learn about the Rules of the House and the various procedures for legislation to reach the House Floor, and complete a variety of other administrative tasks. Ideal candidates have strong writing skills, a good work ethic, an interest in learning about House floor procedures, and are detail-oriented. Interns will gain experience in legislative analysis, political communications, and institutional processes.\nA stipend will be available for qualified candidates. Massachusetts ties are a plus. All offers are conditional on completion of a federal criminal background check. The office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds or with untraditional experience to apply.\nInterested applicants should submit a resume and cover letter explaining why you want to join the Democratic Staff of the House Rules Committee to democratsrules.hmuse.gov/about/internships. No calls or drop-ins, please. The deadline to apply is July 14, 2025.\nNote: Students on quarter systems or with unusual schedules are still encouraged to apply—please apply by the appropriate deadline in advance of your desired internship term and detail your particular situation in your cover letter.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-192-25",
    "Posting_Author": "Congresswoman Mary Gay Scanlon",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "Fall 2025 Legislative Internship – DC Office of Congresswoman Mary Gay Scanlon",
    "Office_Type": null,
    "Responsibilities": [
      "Drafting constituent correspondence",
      "Researching various legislative issues and writing policy memos for the Congresswoman",
      "Attending briefings, hearings, and markups and drafting related memoranda",
      "Responding to constituent mail and answering office phones"
    ],
    "Qualifications": [
      "Strong written and oral communication skills",
      "Demonstrated interest in government and public service",
      "A strong work ethic",
      "Ability to excel in fast-paced environments",
      "Willingness to assist wherever needed",
      "Motivated team player"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Congresswoman Mary Gay Scanlon is an equal opportunity employer and values diversity and inclusion in the workplace.",
    "Cleaned_Text": "<p>MEM-192-25</p>\n<p>Title: &quot;Fall 2025 Legislative Internship – DC Office of Congresswoman Mary Gay Scanlon&quot;\r\n\r\nInternships are based in Congresswoman Scanlon’s Washington, DC office for college students and recent graduates and will be in person. Hours are flexible to accommodate students’ course schedules, but generally run from 9 a.m. to 5 p.m. The Legislative Internship is paid via monthly stipend.\r\n\r\nApplications for Fall 2025 internships will be accepted beginning June 23rd, 2025 and are due July 23rd, 2025.\r\n\r\nInternships are based in Congresswoman Scanlon’s Washington, DC office for college students and recent graduates and will be in person. Hours are flexible to accommodate students’ course schedules, but generally run from 9 a.m. to 5 p.m. The Legislative Internship is paid via monthly stipend.\r\n\r\nLegislative Internship</p>\n\r\n<p>Responsibilities include, but are not limited to:</p>\r\n\n  • Drafting constituent correspondence\r\n  • Researching various legislative issues and writing policy memos for the Congresswoman\r\n  • Attending briefings, hearings, and markups and drafting related memoranda\r\n  • Responding to constituent mail and answering office phones</p>\r\n\n<p>A strong work ethic, the ability to excel in fast-past environments, and a willingness to assist wherever needed are must-have qualities.</p>\r\n\n<p>To apply, please submit a resume, cover letter, one short writing sample, and two references to <strong>Madhumita.Gupta@mail.house.gov</strong> with the subject line &quot;Fall Legislative Internship, NAME&quot;. Please include availability in the cover letter and compile all application materials into one PDF document.</p>",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-191-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": "CA-37",
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": "Legislative office internships",
    "Responsibilities": [
      "support the Congresswoman’s policy work primarily related to her involvement on the House Judiciary Committee",
      "draft memoranda and briefs",
      "support the legislative team in stakeholder meetings",
      "prepare the Congresswoman and members of staff for meetings and hearings with research and administrative tasks",
      "work on other administrative tasks and duties as assigned"
    ],
    "Qualifications": [
      "interest in the legislative process and civic service; possess excellent writing, research, organization, time management, and communication skills;",
      "work well in a fast-paced, team environment; be detail-oriented and self-starters;",
      "have a general understanding of the US political system;",
      "possess a JD"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "None specified"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": -0.5479999780654907,
    "LES": 0.4336842596530914
  },
  {
    "Post_ID": "MEM-190-25",
    "Posting_Author": "Congresswoman Sydney Kamlager-Dove",
    "Congress_Number": null,
    "State_District": "CA-37",
    "Location": "Washington, D.C. and Los Angeles",
    "Job_Function": null,
    "Title_Parsed": "Congressional Intern",
    "Office_Type": "Legislative Office",
    "Responsibilities": [
      "Answer phones and assist in correspondence with constituents",
      "Greet constituents and office visitors",
      "Process tour requests and lead Capitol tours",
      "Handle mail",
      "Perform legislative research and draft memos"
    ],
    "Qualifications": [
      "An interest in the legislative process and civic service",
      "Excellent writing, research, organization, time management, and communication skills",
      "Ability to work well in a team environment",
      "A general understanding of the US political system"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Language skills",
      "Leadership experience"
    ],
    "Equal_Opportunity_Information": "The Office of Congresswoman Sydney Kamlager-Dove is an Equal Opportunity Employer.",
    "Cleaned_Text": "MEM-190-25\nThe Office of Congresswoman Sydney Kamlager-Dove (CA-37) is seeking Congressional Inters for our Washington, D.C. and Los Angeles offices for the Fall 2025 term.\nOur office values open communication, hard work, and creating a collegial environment.\nWe are looking for interns with a can-do attitude who are eager to grow. Interns will have great opportunities to learn from office staff and network with others to make the most of their time with our office! \n\nIntern Expectations   Candidates should have an interest in the legislative process and civic service; possess excellent writing, research, organization, time management, and communication skills; work well in a team environment; and have a general understanding of the US political system.\n  Internship Responsibilities   D.C. Inters can expect to:     Answer phones and assist in correspondence with constituents\n      Greet constituents and office visitors\n      Process tour requests and lead Capitol tours\n       Handle mail\n        Perform legislative research and draft memos\n         Assist the Communications Director and Press Assistant in drafting social media content and other materials like press releases, website content, and newsletters\n          Compile daily press clips\n           Edit video clips\n            Work on other administrative tasks as directed   \nL.A. District Office Inters can expect to:     Answer phones and assist in correspondence with constituents\n       Greet constituents and office visitors\n        Handle mail’\n         Participate in the reception area   \n  Internship Dates and Details: Fall internships are slated to start mid-August to mid-December 2025, with some flexibility based on academic schedule. Interns are expected to work in person in the office, Monday-Friday 9 a.m.- 5 p.m. Unfortunatley, we cannot accommodate remote or hydrid internships.      Deadline: Applications must be submitted by 11:59 p.m. ET on Sunday, July 6th, 2025.\n    To apply: Interested applicants should send their resume and a brief cover letter detailing weekly available hours IN ONE COMBINED DOCUMENT to:\n       • CA37.internships@mail.house.gov for DC office internship.\n       • You MUST follow these instructions:   o Use the subject line and title your document “First name Last name -Summer 2025 internship”   \n      \n      • CA37internships@mail.house.gov for Los Angeles office internship\no   Use the subject line and title your document ‘First name Last name-‗🔔 Summer 2025 Internship’   Please reach out our Intern Coordinator, Maite McPherson, with any questions at Maite.McPherson@mail.house.gov.",
    "DW_NOMINATE": -0.5479999780654907,
    "LES": 0.4336842596530914
  },
  {
    "Post_ID": "MEM-187-25",
    "Posting_Author": "Chrissy Houlahan (D-PA-06)",
    "Congress_Number": null,
    "State_District": "PA-06",
    "Location": "Washington, D.C., Reading, and West Chester",
    "Job_Function": "Press Internship",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "compiling and distributing press clips",
      "helping draft copy for press and digital materials",
      "developing digital content"
    ],
    "Qualifications": [
      "technical experience with graphic design tools (Canva, InDesign, Illustrator)",
      "photo editing programs (Photoshop, Lightroom)",
      "video editing software (Premiere, Headliner)"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "graphic design",
      "photo editing",
      "video editing"
    ],
    "Equal_Opportunity_Information": "This office is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply.",
    "Cleaned_Text": "MEM-187-25\nPress Internship: The Office of Representative Chrissy Houlahan (D-PA-06) is accepting applications for Fall 2025 Press Interns in our Washington, D.C., Reading, and West Chester offices. ...",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-186-25",
    "Posting_Author": "Chrissy Houlahan",
    "Congress_Number": null,
    "State_District": "PA-06",
    "Location": "West Chester, Reading, and Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "LEGISLATIVE INTERNSHIP: The Office of Representative Chrissy Houlahan (D-PA-06)",
    "Office_Type": "Legislative Internship",
    "Responsibilities": null,
    "Qualifications": [
      "self-starters who bring a customer service mindset and a passion for community service.",
      "intellectually curious, willing to spend a lot of time on the phone and write well.",
      "Prior volunteer, leadership, and work experience are a plus. Ties to PA-06 are also a plus."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "This office is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-184-25",
    "Posting_Author": "Congressman Mike Levin",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "null",
    "Office_Type": "null",
    "Responsibilities": [
      "Attending committee hearings and congressional briefings",
      "Conducting policy research and drafting legislative materials",
      "Authoring constituent correspondence on a range of policy issues",
      "Answering phones and processing mail",
      "Leading constituents on tours of the Capitol",
      "Working on other administrative and legislative tasks, as directed."
    ],
    "Qualifications": null,
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "null",
    "Cleaned_Text": "Congressman Mike Levin seeks press and legislative interns for his Washington, D.C., office...",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-183-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington D.C.",
    "Job_Function": null,
    "Title_Parsed": "Oversight and Investigations Law Clerk",
    "Office_Type": null,
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "The House Committee on Energy and Commerce, Subcommittee on Oversight and Investments (Democratic Staff) is seeking a Law Clerk for Fall 2025 to assist in conducting oversight and investigations of issues within the Committee’s broad jurisdiction. Law Clerks will work closely with Subcommittee counsel and professional staff on a wide range of issues related to the environment, energy, health care, and consumer protection sectors.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-178-25",
    "Posting_Author": "Congressman French Hill (AR02) · AR02",
    "Congress_Number": null,
    "State_District": "AR02",
    "Location": "(both his DC and Little Rock offices)",
    "Job_Function": "Legislative process and the U.S. Congress support",
    "Title_Parsed": "",
    "Office_Type": "DC office and Little Rock office",
    "Responsibilities": [
      "answer constituent phone calls",
      "assist staff with administrative tasks",
      "conduct legislative research",
      "assist with correspondence"
    ],
    "Qualifications": [
      "positive attitude",
      "strong work ethic",
      "excellent written and oral communication skills",
      "successful interns will be detail-oriented self-starters"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Congressman French Hill has the equal opportunity to hire",
    "Cleaned_Text": "MEM-178-25\nCongressman French Hill (AR02) has internship positions available for the Fall 2025 term in both his DC and Little Rock offices.\nInterns will work in a fast-paced environment, gaining valuable exposure and knowledge of the legislative process and the U.S. Congress while helping central Arkansans. Intern responsibilities include answering constituent phone calls, assisting staff with administrative tasks, conducting legislative research, and assisting with correspondence.\nInterns should have a positive attitude, strong work ethic, and excellent written and oral communication skills. Successful interns will be detail-oriented self-starters, take and listen to direction, and be willing to work both independently and as part of a team.\nApplicants should have a working knowledge of current events and policy topics as well as a willingness to assist with daily office tasks. Arkansas ties strongly preferred.\nInternships are open to college and graduate students as well as recent graduates. The office offers paid and unpaid internships depending on availability.\nTo apply, please send a resume and cover letter to AR02.Applications@mail.house.gov indicating which location you are applying for. Applications should be submitted by June 30 but will be accepted on a rolling basis until all positions are filled.\nIf you have any questions, you can contact the office for additional information at (202) 225-2506.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-175-25",
    "Posting_Author": "Congresswoman Suzan DelBene",
    "Congress_Number": null,
    "State_District": "1st Congressional District of Washington state",
    "Location": "Washington, D.C. and Kirkland, WA",
    "Job_Function": " congressional office",
    "Title_Parsed": "Interns for Congresswoman Suzan DelBene",
    "Office_Type": "Washington, D.C. and District offices",
    "Responsibilities": [
      "greeting constituents",
      "handling constituent phone calls",
      "assisting staff with administrative tasks",
      " Conducting research ",
      "assisting with constituent correspondence"
    ],
    "Qualifications": [
      "exceptional written and oral communication skills",
      "high degree of professionalism",
      "strong interest in public service"
    ],
    "Salary_Min": null,
    "Salary_Max": 1000,
    "Skills_Mentioned": [
      "community events",
      "US Capitol",
      "hearings and briefings"
    ],
    "Equal_Opportunity_Information": "This office is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ identification, family status, or military status.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-171-25",
    "Posting_Author": "U.S. Congressman Jeff Van Drew",
    "Congress_Number": null,
    "State_District": "NJ-02",
    "Location": "Washington, D.C.",
    "Job_Function": "full and part-time internship",
    "Title_Parsed": "Intern",
    "Office_Type": "conservative office",
    "Responsibilities": [
      "greeting visitors",
      "answering phones",
      "leading tours of the Capitol",
      "opening and sorting mail",
      "attending briefings",
      "performing legislative research",
      "various other tasks to assist staff"
    ],
    "Qualifications": null,
    "Salary_Min": 0,
    "Salary_Max": 50000,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "The office is an equal opportunity employer.",
    "Cleaned_Text": "This is a conservative office, so each intern will be required to express the Congressman's conservative perspective to constituents and people who call into the office. Interns are paid a stipend based on availability and have access to transit benefits.",
    "DW_NOMINATE": null,
    "LES": null
  }
]