[
  {
    "Post_ID": "MEM-076-25",
    "Posting_Author": "Congressman Mike Flood (NE-01)",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Driving the Member and other staO members as required for their oOicial duties, sometimes before or after typical business hours.",
      "Driving the Member to and from the airport, sometimes before or after typical business hours.",
      "Deliver and pickup materials for the oOice, including letters, packages, and documents from other government agencies."
    ],
    "Qualifications": [
      "Ability to communicate eOectively with the Member and oOice staO, Members and representatives from other oOices, outside organizations, and others.",
      "Ability to work outside of traditional business hours as the Member’s schedule dictates.",
      "Ability to handle diOicult and sometimes tense interactions with members of the public, including constituents, with tact while also prioritizing the well-being of the Member."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Nebraska ties are preferred",
      "Must possess a valid driver’s license and have a good driving record."
    ],
    "Equal_Opportunity_Information": "Nebraska ties are preferred but not required for application. Interested applicants may submit their resume and cover letter to FloodHiring@mail.house.gov.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-074-25",
    "Posting_Author": "Congressman Jonathan L. Jackson",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, D.C.",
    "Job_Function": "Press/Digital Assistant",
    "Title_Parsed": "Press/Digital Assistants",
    "Office_Type": null,
    "Responsibilities": [
      "Create and manage content for the Member’s social media platforms, including copy, graphics, and videos",
      "Assist with drafting and circulating the Member’s newsletter, press releases, statements, talking points, and speeches",
      "Work with the Communications Director to develop content and graphics for franked communications",
      "Monitor news outlets and social media and compile press clips that mention the Member",
      "Maintain Chicago and D.C. press lists",
      "Handle photography and videography at D.C.-based events",
      "Assist with updating the website"
    ],
    "Qualifications": [
      "Heart for public service and helping others",
      "Exceptional attention to detail",
      "Strong writing and creative skills",
      "Experience in graphic design and video editing",
      "An ability to work collaboratively in a fast-paced, team environment",
      "Temperament to communicate with a variety of personalities in a friendly and professional manner"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Social media management",
      "Content creation",
      "Graphic design",
      "Video editing",
      "_designer"
    ],
    "Equal_Opportunity_Information": "The office is an equal opportunity employer.",
    "Cleaned_Text": "Press/Digital Assistant—Congressman Jonathan L. Jackson seeks a full-time Press/Digital Assistant to work in his Washington, D.C. office.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-072-25",
    "Posting_Author": "The Office of Congressman Rob Wittman (VA-01)",
    "Congress_Number": null,
    "State_District": "VA-01",
    "Location": "US Congress - House",
    "Job_Function": null,
    "Title_Parsed": "Press Assistant",
    "Office_Type": null,
    "Responsibilities": [
      "drafting press releases and talking points",
      "writing email newsletters for targeted constituent coalitions",
      "promoting the congressman’s district events and engagements",
      "maintaining the communications content calendar",
      "overseeing website management and updates",
      "branding through graphic design and video/audio editing",
      "managing social media accounts and analyzing their performance metrics",
      "maintenance of the congressman’s photo and video database"
    ],
    "Qualifications": [
      "previous congressional or political communications experience",
      "ties to Virginia are helpful but not required",
      "strong candidate will have previous communications experience",
      "creative, proactive communicator familiar with social media"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "social media",
      "legislative process",
      "website maintenance",
      "photography",
      "graphic design",
      "video editing"
    ],
    "Equal_Opportunity_Information": "The Office of Congressman Rob Wittman (VA-01) is an Equal Opportunity Employer.",
    "Cleaned_Text": "Press Assistant - The Office of Congressman Rob Wittman (VA-01) is seeking a Press Assistant to help execute the congressman’s communications strategy and plan.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-067-25",
    "Posting_Author": "Congressman Jonathan L. Jackson",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Chicago OOice",
    "Job_Function": null,
    "Title_Parsed": "District Director",
    "Office_Type": "Full-time",
    "Responsibilities": [
      "Collaborates with the Member, Chief of Staff, Legislative Director, and Communications Director to ensure district office strategies and operating plans align with the Member's strategic vision and goals.",
      "Attends events, speaks to local groups, and meets with elected officials and representatives in the district to serve as a primary representative on behalf of the Member.",
      "Oversees the Member's constituent casework activities with Federal departments and agencies to monitor progress and schedule meetings as necessary.",
      "Conducts district office staff meetings to ensure tasks are delegated and addressed appropriately.",
      "Facilitates information sharing between the Member's district office and the D.C. office.",
      "Understands and navigates differing perspectives and opinions to resolve conflicts and develop solutions effectively.",
      "Interviews, selects, and trains employees of the district office to ensure the office is appropriately staffed.",
      "Plans, assigns, and directs work of employees in the district office to manage staff and evaluate their work.",
      "Oversees district office staff to ensure compliance with office policies, practices, and procedures.",
      "Travels throughout the district at regular intervals to keep abreast of local concerns.",
      "Partners with the Member's communications team to plan district-based media and press events."
    ],
    "Qualifications": [
      "Decision Making: Makes sound, well-informed, and objective decisions; perceives the impact and implications of decisions. Commits to action to accomplish organizational goals. Maintains appropriate levels of conﬁdentiality.",
      "Advising: Provides guidance and persuades others; utilizes give and take to make sure input is considered on important decisions; considers the legislative and political situation to provide valuable guidance.",
      "Managing Others: Plans, distributes, and monitors work assignments of others; evaluates work performance and provides ongoing feedback to others on their performance and opportunities to learn through formal and informal methods.",
      "Planning and Coordination: Organizes work and sets priorities. Coordinates with others to accomplish goals; monitors progress and evaluates outcomes.",
      "Political Acumen: Identiﬁes the internal and external politics that impact work. Perceives organizational and political reality and acts accordingly."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Decision Making",
      "Advising",
      "Managing Others",
      "Planning and Coordination",
      "Political Acumen"
    ],
    "Equal_Opportunity_Information": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-064-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "assist in the preparation for Congressional hearings",
      "contributing to the management of investigations of governmental and private entities",
      "conducting research, document review, and analysis",
      "drafting letters, memoranda, and investigative reports",
      "coordinating with other Subcommittees of the full Committee"
    ],
    "Qualifications": [
      "Law Clerk for Summer 2025",
      "detail-oriented and proactive problem-solver",
      "strong communication and legal research and writing skills",
      "(Women, people of color, veterans, and LGBTQ+ candidates strongly encouraged to apply)",
      "(The office is an equal opportunity employer..."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "(The office is an equal opportunity employer...)",
    "Cleaned_Text": "Oversight and Investigations Law Clerk\nThe House Committee on Energy and Commerce, Subcommittee on Oversight and Investments (Democratic Staff) is seeking a Law Clerk for Summer 2025 to assist in conducting oversight and investigations of issues within the Committee’s broad jurisdiction. Law Clerks will work closely with Subcommittee counsel and professional staff on a wide range of issues related to the environment, energy, health care, and consumer protection sectors. This is a paid position.\nResponsibilities include assisting in the preparation for Congressional hearings; contributing to the management of investigations of governmental and private entities; conducting research, document review, and analysis; drafting letters, memoranda, and investigative reports; and coordinating with other Subcommittees of the full Committee.\n\nThe ideal candidate will be in at least their second year of law school or is a recent law school graduate who is a detail-oriented and proactive problem-solver with strong communication and legal research and writing skills. Women, people of color, veterans, and LGBTQ+ candidates are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Law clerks will receive a stipend, and applicants may request the Committee’s assistance to receive credit from their educational institution.\n\nTo apply, please submit a resume, cover letter, and short writing sample\nto\n[\nInternshipResume.EC@mail.house.gov\n](mailto:InternshipResume.E.C.Mail.house.gov)\n\nwith the subject line, “E&C O&I Law Clerk.”\n\nApplications are due on March 21, 2025.\n",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-063-25",
    "Posting_Author": "Congresswoman Maxine Dexter, M.D.",
    "Congress_Number": null,
    "State_District": "OR-03",
    "Location": "Washington, D.C.",
    "Job_Function": "Digital/Press Assistant",
    "Title_Parsed": "Digital/Press Assistant",
    "Office_Type": "Congress",
    "Responsibilities": [
      "Develop and implement the oOice's digital and social media strategy; create and maintain a consistent stream of digital content for member's social media platforms and website; includes rapid response",
      "Assist with drafting newsletters, press releases, talking points, scripts, opeds/letters to the editor, newsletters, and other written materials",
      "Film and edit videos for social media, including Instagram, Facebook, YouTube, etc.",
      "Develop and update website content",
      "Create/maintain press lists",
      "Clip TV appearances, ﬂoor speeches, and other video content for social media."
    ],
    "Qualifications": [
      "comprehensive understanding of social media trends",
      "superior writing skills",
      "considerable experience with photography, graphic design, and video editing"
    ],
    "Salary_Min": null,
    "Salary_Max": 70000,
    "Skills_Mentioned": [
      "photography",
      "graphic design",
      "video editing"
    ],
    "Equal_Opportunity_Information": "This oOice is an equal-opportunity employer committed to developing an organization that is reﬂective of the district that we serve.",
    "Cleaned_Text": "MEM-063-25Congresswoman Maxine Dexter, M.D. seeks a creative, proactive Digital/Press Assistant in her Washington, D.C. office. This is a full-time positionnThe Digital/Press Assistant reports to the Communications Director and will play a crucial role in executing the office's strategic communications plan, speciﬁcally in executing the office's social media and digital communications.This position requires a comprehensive understanding of social media trends, superior writing skills, considerable experience with photography, graphic design, and video editing, and the ability to work collaboratively in a fast-paced, team environment. Oregon ties are a plus but not required.This ofﬁce is an equal-opportunity employer committed to developing an organization that is reﬂective of the district that we serve. The ofﬁce does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability.Key Responsibilities:· Develop and implement the office's digital and social media strategy; create and maintain a consistent stream of digital content for member's social media platforms and website; includes rapid response· Assist with drafting newsletters, press releases, talking points, scripts, opeds/letters to the editor, newsletters, and other written materials· Film and edit videos for social media, including Instagram, Facebook, YouTube, etc.· Develop and update website content· Create/maintain press lists· Clip TV appearances, ﬂoor speeches, and other video content for social media.· Other tasks as neededSalary range is $60,000-70,000.Candidates should submit a resume, cover letter, 2-3 digital samples, mail to:OR3Resumes@gmail.com. and with the subject line “Digital/Press Assistant - [Your Name]” to OR3Resumes@gmail.com.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-062-25",
    "Posting_Author": "Office of Congresswoman Kim Schrier",
    "Congress_Number": null,
    "State_District": "8th Congressional District",
    "Location": "Washington, D.C.",
    "Job_Function": "Staff/Press Assistant",
    "Title_Parsed": "Staff/press assistant",
    "Office_Type": "office",
    "Responsibilities": [
      "answering phone calls",
      "running the front office and greeting visitors",
      "processing mail",
      "managing the intern program",
      "oversight of tour and flag requests",
      "drafting newsletters and press releases",
      "assisting with social media",
      "updating the webpage",
      "tracking office metrics",
      "general administrative support"
    ],
    "Qualifications": [
      "strong commitment to public service",
      "attention to detail",
      "ability to work as part of a team in a fast-paced environment",
      "excellent writing skills",
      "sense of humor",
      "highly organized",
      "solution-oriented",
      "customer service experience",
      "Prior Hill/Federal government experience and/or communications experience (preference)"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Washington State"
    ],
    "Equal_Opportunity_Information": "The office is an equal opportunity employer.",
    "Cleaned_Text": "The Office of Congresswoman Kim Schrier seeks a staff/press assistant for her Washington,",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-054-25",
    "Posting_Author": "Congresswoman Melanie Stansbury",
    "Congress_Number": null,
    "State_District": "NM-01",
    "Location": "Washington, D.C.",
    "Job_Function": "Communications Advisor",
    "Title_Parsed": "Communications Advisor",
    "Office_Type": "congressional",
    "Responsibilities": [
      "strategic planning",
      "drafting speeches",
      "written remarks",
      "press statements"
    ],
    "Qualifications": [
      "Exceptional writing and researching skills",
      "Ability to work long hours",
      "Thoroughness and attention to detail",
      "Discretion and sound judgment",
      "An independent self-starter and team-player",
      "Strong organizational, time-management, and project management skills"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "exceptional writing and researching skills",
      "ability to work long hours",
      "thoroughness and attention to detail",
      "discretion and sound judgment",
      "exceptional organisational skills"
    ],
    "Equal_Opportunity_Information": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability.",
    "Cleaned_Text": "<remove>...</remove>",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-053-25",
    "Posting_Author": "Unknown or unknown e-mail address (insecure)",
    "Congress_Number": null,
    "State_District": "Unknown",
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Counsel to the Subcommittee on Capital Markets of the House Committee on Financial Services",
    "Office_Type": null,
    "Responsibilities": [
      "[conduct comprehensive legal research and analysis]",
      "[draft and review legislation]",
      "[represent the Subcommittee in meetings with Members of Congress",
      "...",
      "contribute to additional projects based on expertise and interests]"
    ],
    "Qualifications": [
      "Juris Doctor (JD) degree from an accredited law school",
      "Active membership in good standing with a state bar",
      "Minimum 5 years of experience",
      "...",
      "...",
      "[excellent analytical, research, and writing skills]",
      "[outstanding interpersonal and communication abilities]",
      "[demonstrated ability to manage multiple complex projects simultaneously]"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "capital markets regulation and policy",
      "legislative or government affairs experience",
      "..."
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "MEM-053-25 The House Committee on Financial Services is seeking an experienced securities attorney to serve as Counsel to the Subcommittee on Capital Markets of the House Committee on Financial Services.\n\nPosition Overview:\nThe Counsel will play a vital role in advancing the Subcommittee's work on capital formation and SEC institutional reforms, among other issue areas. The Counsel will work closely with Committee leadership and staO to develop legislation and policy initiatives.\n\nKey Responsibilities:\n- Conduct comprehensive legal research and analysis to support the Subcommittee's initiatives\n- Draft and review legislation within the Subcommittee's jurisdiction\n- Represent the Subcommittee in meetings with Members of Congress, interest groups, government agencies, and other stakeholders\n- Analyze complex documents, legislation, and regulatory materials to prepare brieﬁng materials for Committee members and staO\n- Provide legal counsel to the Chairman\n- Develop brie﫞ing papers and policy documents\n- Prepare and support Committee hearings and markups\n- Contribute to additional projects based on expertise and interests",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-051-25",
    "Posting_Author": "U.S. Representative Greg Landsman",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Cincinnati and Lebanon, OH",
    "Job_Function": "Communications and OOice Logistics",
    "Title_Parsed": "StaO Assistant",
    "Office_Type": null,
    "Responsibilities": [
      "drive the Congressman to and from the airport on fly-in and fly-out days",
      "capture photos; videos and write copy for the Congressman’s social media and public communications",
      "support district office operations by serving as the point of contact for office logistics"
    ],
    "Qualifications": [
      "exceptional driving record",
      "background in graphic design, video production, photography, or social media",
      "strong writing and communication skills",
      "exceptional customer service; time management and organizational skills",
      "ability to prioritize and follow through on multiple competing priorities in a fast-paced environment"
    ],
    "Salary_Min": null,
    "Salary_Max": 55000,
    "Skills_Mentioned": [
      "video production",
      "photography",
      "social media"
    ],
    "Equal_Opportunity_Information": "The office is an equal-opportunity employer and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, disability, military status, age, marital status, or parental status.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-043-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "Associate General Counsel/Assistant General Counsel",
    "Office_Type": "General Counsel’s office",
    "Responsibilities": [
      "drafting district court pleadings and appellate briefs",
      "appearing in court in litigation matters in which the House or individual Members, officers, or employees have an official interest",
      "analyzing legal problems presented by House Members, committees, officers, and employees, and formulating recommended solutions",
      "advising and counseling House Members, committees, officers, and employees on a wide range of legal issues",
      "gathering facts necessary to permit OGC to provide sound legal advice",
      "interacting with House leadership, committees, and other House offices",
      "interacting with opposing counsel (both government and private)",
      "representing witnesses in connection with investigative proceedings",
      "performing legal research on issues of constitutional, statutory, and common law",
      "working closely with other OGC attorneys and support staff in performing these functions."
    ],
    "Qualifications": [
      "Minimum Requirements: excellent academic credentials; at least three years’ experience as a practicing attorney, including any judicial clerkships; excellent writing, analytical, and people skills; excellent judgment; ability to work with, and to provide high quality legal advice and representation to House Members, committees, officers, and employees, without regard to political affiliation; and appreciation of—or at least the desire to learn about and understand—the role and functioning of the Legislative Branch.",
      "Preferred Qualifications: judicial clerkship or other government experience; experience drafting dispositive motions in federal district courts and/or briefs in federal courts of appeals; and understanding of structure and operations of the Federal Government, particularly the House of Representatives and the Department of Justice."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "none mentioned"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "Associate General Counsel/Assistant General Counsel",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-042-25",
    "Posting_Author": "Congressman Gabe Vasquez",
    "Congress_Number": null,
    "State_District": "NM-02",
    "Location": "Washington, DC and New Mexico",
    "Job_Function": "Scheduler",
    "Title_Parsed": "Scheduler for NM-02 Office",
    "Office_Type": "battleground Member",
    "Responsibilities": [
      "Evaluating, organizing, and responding to all incoming meeting and event requests in coordination with the Chief of StaO in a timely manner.",
      "Maintains the Member's daily and long-term schedule, coordinates travel, and acts as a liaison for the Member with other congressional offices, constituents, and stakeholders."
    ],
    "Qualifications": [
      "congressional work experience",
      "prior scheduling experience",
      "New Mexico ties",
      "Spanish-language proficiency"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "This office is an equal opportunity employer; the office does not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, sexual orientation, age, disability, or military status, or any other characteristic protected by applicable law.",
    "Cleaned_Text": "MEM-042-25\nThe OOice of Congressman Gabe Vasquez (NM-02) seeks an experienced, highly organized, and detail-oriented Scheduler to be based in his Washington, DC office. This is not an entry-level position. Candidates must have exceptional organizational skills, meticulous attention to detail, expertise prioritizing and managing multiple tasks under tight deadlines, and the ability to work under pressure in a fast-paced environment for a battleground Member.\nThe Scheduler serves as a key player of the team by managing the Member's time. This role reports to and works closely with the Chief of StaO but is expected to be a leader and team player in coordinating closely with the full team regarding the Member's schedule.\nCore Responsibilities\n•\n•\n•\nEvaluating, organizing, and responding to all incoming meeting and event requests in coordination with the Chief of StaO in a timely manner.\nMaintains the Member's daily and long-term schedule, coordinates travel, and acts as a liaison for the Member with other congressional offices, constituents, and stakeholders.\nBriefs the Member weekly on upcoming events, meetings, and other scheduling matters in Washington, DC and New Mexico.\n\n•\n•\n•\nCollaborates with the Member and Senior StaO to determine and finalize the Member's daily and long-term schedules, and collect briefing materials (e.g., memos, talking points, and speeches).\nManages Member and office operations in Washington, D.C. including coordination of Member movements, meetings, and office-campus events.\nWorks closely with financial administrator for travel and official expenses.\nReports directly to the Chief of StaO and Member.\n\nQualifications: The ideal candidate will have congressional work experience and prior scheduling experience.\nNew Mexico ties and Spanish-language proficiency are a plus.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-040-25",
    "Posting_Author": "Congressman Rob Wittman",
    "Congress_Number": null,
    "State_District": "VA01",
    "Location": "Washington, D.C. ofOice",
    "Job_Function": null,
    "Title_Parsed": "Legislative Director",
    "Office_Type": "Congressman’s oFice",
    "Responsibilities": [
      "Develop and implement a comprehensive legislative strategy aligned with the Congressman’s priorities and constituents' needs.",
      "Manage and mentor a legislative team, provide guidance, and foster collaboration among staO members.",
      "Build and maintain relationships with other lawmakers, committee staO, advocacy groups, and stakeholders to advance the Congressman’s legislative goals."
    ],
    "Qualifications": [
      "Minimum of 5 years of experience in legislative aOairs, public policy, or a related ﬁeld, preferably in a congressional oOice.",
      "Strong understanding of the legislative process and federal government operations.",
      "Excellent writing, research, and communication skills.",
      "Proven ability to work collaboratively in a fast-paced environment and manage multiple priorities.",
      "Commitment to public service and the values of Congressman Wittman."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Building relationships",
      "Public policy"
    ],
    "Equal_Opportunity_Information": "No restrictions apply to candidates of all backgrounds or qualifications. However, as an equal opportunity employer, we welcome candidates with VA ties.",
    "Cleaned_Text": "MEM-040-25\nOverview: Congressman Rob Wittman is seeking a highly motivated and experienced Legislative Director to lead his legislative agenda and coordinate policy initiatives in his Washington, D.C. oOice. The Legislative Director would handle the Congressman’s Natural Resources Committee assignment, as well as Energy, Environment and Chesapeake Bay, Tax, Telecom/Broadband, Transportation & Infrastructure, Appropriations and the Budget, Immigration, Labor/Workforce/Federal Employees. In addition, the Legislative Director will have a close working relationship with the Chief of StaO in building and maintaining relationships with other lawmakers, committee staO, and advocacy groups.\nThe Legislative Director should be knowledgeable about issues relating to Virginia and VA01, and work closely with the District Director and district stakeholders, including local leaders, businesses, and community organizations, to understand their needs and incorporate their perspectives into legislative eOorts. Most importantly, the Legislative Director should have a genuine commitment to public service and advocating for the best interests of Virginia’s First District.\nKey Responsibilities:\n• Develop and implement a comprehensive legislative strategy aligned with the Congressman’s priorities and constituents' needs.\n• Manage and mentor a legislative team, provide guidance, and foster collaboration among staO members.\n• Build and maintain relationships with other lawmakers, committee staO, advocacy groups, and stakeholders to advance the Congressman’s legislative goals.\nEngage with district stakeholders, including local leaders, businesses, and community organizations, to understand their needs and incorporate their perspectives into legislative eOorts.\nUnderstand the political landscape and anticipate the implications of legislative actions as it relates to VA-01.\nDraft legislation, amendments, and policy papers, ensuring clarity and adherence to congressional procedures.\nMaintains up-to-date tracking reports on all legislative items including Sponsored and Cosponsored legislation and letters, provisions in larger bills, and district wins.\nReview responses to all constituent mail, and review content produced by the communications team.\nRepresent the Congressman in meetings with constituents, interest groups, and other legislative oOices.\nMonitor legislative developments and provide timely updates to the Congressman and his staO.\nQualiﬁcations:\n• Minimum of 5 years of experience in legislative aOairs, public policy, or a related ﬁeld, preferably in a congressional oOice.\n• Strong understanding of the legislative process and federal government operations.\n• Excellent writing, research, and communication skills.\n• Proven ability to work collaboratively in a fast-paced environment and manage multiple priorities.\n• Commitment to public service and the values of Congressman Wittman.\n• Virginia ties Preferred\nInterested candidates should send a resume, cover letter, and references to Carolyn.King@mail.house.gov with the subject line “Legislative Director Application.”\n    ---\n     ",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-036-25",
    "Posting_Author": "ConservativeRep@mail.house.gov",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, D.C.",
    "Job_Function": "Legislative Director",
    "Title_Parsed": "Legislative Director",
    "Office_Type": null,
    "Responsibilities": [
      "assist with the formulation of the Member's policy and legislative strategy",
      "work with the Communications Director to ensure that the Member's legislative strategy is incorporated into the office's communications plan",
      "manage and oversee the performance of the legislative team"
    ],
    "Qualifications": [
      "Prior Legislative Director Experience",
      "Proﬁcient at moving legislation",
      "Capitol Hill experience",
      "Great writer",
      "Management Experience",
      "Proﬁcient at Microsoft suite",
      "Detail oriented",
      "Multitasker"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "moving legislation",
      "Microsoft suite"
    ],
    "Equal_Opportunity_Information": "We are an equal opportunity employer.",
    "Cleaned_Text": "A conservative Midwest Member of Congress has an immediate need to hire an experienced full-time Legislative Director in the Washington, D.C. office.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-035-25",
    "Posting_Author": "House Committee on Veterans’ AOairs (Majority)",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": "Professional StaO Member",
    "Title_Parsed": "Professional StaO Member",
    "Office_Type": "Subcommittee on Health",
    "Responsibilities": [
      "Leading oversight including organizing and participating in meetings",
      "Conducting research to support oversight and legislative activities.",
      "Leading legislation drafting eOorts.",
      "Representing the Committee including meeting with other congressional staO, veteran service organizations, and external healthcare stakeholders.",
      "Perform other duties as assigned by the Subcommittee StaO Director, Committee StaO Director, or Committee Deputy StaO Director."
    ],
    "Qualifications": [
      "Undergraduate degree",
      "Veterans are strongly encouraged to apply",
      "Post-graduate-level writing skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Problem solving skills",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "healthcare experience (strongly preferred)"
    ],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer.",
    "Cleaned_Text": "MEM-035-25House Committee on Veterans’ AOairs (Majority)Subcommittee on HealthProfessional StaO Member\nThe Majority staO of the House Committee on Veterans' AOairs is seeking a Professional StaO Member for the Subcommittee on Health. This position will support the \nSubcommittee StaO Director in conducting oversight of and drafting legislation related to\nthe Department of Veterans AOairs’ (VA) including its Veterans Health Administration (VHA),\nThe largest integrated health care system in the United States, providing care at 1,380\nhealth care facilities. The role involves research, drafting legislation, leading oversight\nincluding trips to VA facilities, leading engagements with outside stakeholders, and other\n duties as assigned. Candidates with healthcare experience or prior medical experience are\nstrongly preferred. Veterans are strongly encouraged to apply. This is a full-time, on-site\nposition in Washington, D.C. Some domestic travel is required.\nCore Responsibilities:\n• Leading oversight including organizing and participating in meetings, drafting memos,\nnreading documents, limited domestic travel, and other oversight duties as assigned.\n• Conducting research to support oversight and legislative activities.\n• Leading legislation drafting eOorts.\n• Representing the Committee including meeting with other congressional staO, veteran\nservice organizations, and external healthcare stakeholders.\n• Perform other duties as assigned by the Subcommittee StaO Director, Committee StaO\ndirector, or Committee Deputy StaO Director.\nQualiﬁcations:\n• Undergraduate degree\n• Veterans are strongly encouraged to apply\n• Post-graduate-level writing skills\n• Excellent oral communication skills\n• Thoroughness and attention to detail\n• Problem solving skills\n• Ability to work long hours, under pressure, while remaining cooperative and courteous\n• Work independently as well as in teams\n• This is a full-time, on-site position in Washington, D.C.\n• Some domestic travel is required.\nBeneﬁts (as eligible):\n• Sick and Annual Leave\n• Federal Employees Health Beneﬁts Program\n• Thrift Savings Plan\n• FederalEmployees' Group Life Insurance Program\n• Federal Long-Term Care Insurance\n• Flexible Spending Accounts (FSAFEDS)\n• Dental & Vision Insurance Program (FEDVIP)\n• Student Loan Repayment Program\nOther Information:\nEmployment with the U.S. House of Representatives is at-will. The U.S. House of\nRepresentatives is an equal opportunity employer. All applicants will be considered\nc without regard to race, color, national origin, religion, sex (including marital or parental\nstatus), disability, or age. Transportation and all related travel expenses associated with the\ninterview and hiring process must be paid by the applicant.\nHow to Apply:\nQualiﬁed candidates should send their resume to VAR.Resumes@mail.house.gov with\n“Health PSM” in the subject line. Please include a short description of why you are\ntinterested in the position in the body of the email. Writing and editing tests, and references\nmay be requested. No calls or walk-ins, please.\nWhat to Expect Next:\nYour resume will be reviewed to determine if you are among the top candidates. If you are\none of the top candidates, you will be contacted for an interview.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-034-25",
    "Posting_Author": "Unknown",
    "Congress_Number": null,
    "State_District": "Unknown",
    "Location": "Washington, DC",
    "Job_Function": "Investigator",
    "Title_Parsed": "House Committee on Veterans' Affairs (Majority) Contracts Investigator",
    "Office_Type": "Committee Staff",
    "Responsibilities": [
      "• Various responsibilities listed in the job description"
    ],
    "Qualifications": [
      "Undergraduate degree",
      "Work experience in procurement operations",
      "Command of the Federal Acquisition Regulation and familiarity with major procurement laws"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Government procurement, contracting, and acquisition"
    ],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer.",
    "Cleaned_Text": "Unknown",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-033-25",
    "Posting_Author": "Congresswoman Alma S. Adams (NC12)",
    "Congress_Number": null,
    "State_District": "NC12",
    "Location": "Washington, DC",
    "Job_Function": "Scheduler",
    "Title_Parsed": "Scheduler for Congresswoman Alma S. Adams",
    "Office_Type": "Executive Office",
    "Responsibilities": [
      "Scheduling & Coordination",
      "Travel & Logistics",
      "Briefing & Preparation",
      "Liaison & Communication",
      "Administrative Support"
    ],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Contact Congresswoman Alma S. Adams' office for more information.",
    "Cleaned_Text": "MEM-033-25\nThe Office of Congresswoman Alma S. Adams (NC12) seeks an experienced, highly organized, and detail-oriented Scheduler for her Washington, DC office. This is not an entry-level position. The ideal candidate will possess exceptional time management skills, the ability to prioritize and manage competing demands, and the capacity to perform well under pressure in a fast-paced environment. The Scheduler is responsible for managing\nthe Congresswoman's complex schedule, organizing official travel, and acting as a liaison with various stakeholders, including constituents, fellow Members of Congress,\ndistinguished guests, and leaders from public, private, and nonprofit sectors.\nThe Scheduler will work closely with the Member, Chief of Staff, and Deputy Chief of Staff/District Director to ensure the smooth coordination of the Member's day-to-day activities and long-term commitments.\n\nKey Responsibilities:\n1. Scheduling & Coordination:\n\no Manage and maintain the Congresswoman’s daily and long-term schedule, ensuring all appointments, meetings, events, and travel are accounted for.\n\no Receive, prioritize, and organize incoming scheduling requests from internal and external stakeholders.\n\no Communicate with external organizations, constituents, and other congressional offices to coordinate scheduling requests, events, and meetings.\n\n\n",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-032-25",
    "Posting_Author": "Congresswoman Janelle Bynum (OR-5)",
    "Congress_Number": null,
    "State_District": "OR-5",
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Legislative Assistant",
    "Office_Type": "Senate",
    "Responsibilities": [
      "Develop legislative initiatives and collaborate closely with the legislative and communications teams to advance the Congresswoman's priorities.",
      "Monitor legislative developments in Congress and the Administration and provide vote recommendations.",
      "Meet with constituents and advocacy groups, draft briefing materials, and prepare talking points.",
      "Staff the Congresswoman at relevant meetings and events."
    ],
    "Qualifications": [
      "previous relevant policy and/or Capitol Hill experience",
      "Oregon-ties"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "We encourage candidates from diverse backgrounds to apply.",
    "Cleaned_Text": "",
    "DW_NOMINATE": 0.1669999957084656,
    "LES": 1.452904462814331
  },
  {
    "Post_ID": "MEM-025-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": null,
    "Qualifications": [],
    "Salary_Min": 59440,
    "Salary_Max": 68093,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "The Office of Rep. French Hill (AR02) seeks to fill the position of Press Secretary.\nCandidates should have at least three years of prior relevant experience in\ncommunications and / or press roles.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-022-25",
    "Posting_Author": "Congresswoman Madeleine Dean",
    "Congress_Number": null,
    "State_District": "(PA-04)",
    "Location": "Glenside, PA",
    "Job_Function": "Caseworker",
    "Title_Parsed": "Congresswoman Madeleine Dean",
    "Office_Type": null,
    "Responsibilities": [
      "Districr case worker (Social Security and Medicare)",
      "Serves as a liaison to federal, district, and local agencies on behalf of the Member and her constituents.",
      "Handles a portfolio of issue areas while serving as the lead on all Social Security and Medicare concerns through casework correspondence and verbal communication with constituents."
    ],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Leisual processes",
      "House organization and procedures",
      "Social Security and Medicare programming"
    ],
    "Equal_Opportunity_Information": "The oﬃce is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, na<onal origin, disability, military status, age, marital status, or parental status.",
    "Cleaned_Text": "MEM-022-25 DISTRICT CASEWORKER (Social Security and Medicare) SUMMARY: Congresswoman Madeleine Dean (PA-04) seeks a mo9vated and organized individual to join her team as a Congressional Caseworker based in Glenside, PA. This posi9on serves as a liaison to federal, district, and local agencies on behalf of the Member and her constituents. The Caseworker will handle a porHolio of issue areas while serving as the lead on all Social Security and Medicare concerns through casework correspondence and verbal commu9nica9on with cons9tuents.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-021-25",
    "Posting_Author": "HOUSE COMMITTEE ON VETERANS' AFFAIRS",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Communications Director, House Committee on Veterans’ AOairs Democratic StaO ",
    "Job_Function": "Communications Director",
    "Title_Parsed": null,
    "Office_Type": "Congressional Staff Office",
    "Responsibilities": [
      "Serve as primary communications advisor for the Ranking Member and Democratic"
    ],
    "Qualifications": [
      "Superior writing, editing, and oral communications skills",
      ""
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Veterans, minorities, women, people with disabilities, and LGBTQ+ candidates are encouraged to apply.",
    "Cleaned_Text": "The Democratic StaO of the House Committee on Veterans’ AOairs seeks a\nCommunications Director to implement the Ranking Member’s Committee communications strategy.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-019-25",
    "Posting_Author": "The Energy and Commerce Committee Democratic StaO",
    "Congress_Number": null,
    "State_District": "null",
    "Location": "null",
    "Job_Function": "Press Assistant",
    "Title_Parsed": "Press Assistant",
    "Office_Type": "StaO",
    "Responsibilities": [
      "Drafting press releases, social media posts, talking points, and the committee newsletter;",
      "Designing graphics for both social media and web content;",
      "Producing and editing videos and photos;",
      "Monitoring social media;",
      "Maintaining and updating press lists;",
      "Compiling daily press clips."
    ],
    "Qualifications": [
      "excellent written and oral communication skills",
      "proven ability to perform under pressure while juggling multiple tasks",
      "sound political judgment"
    ],
    "Salary_Min": null,
    "Salary_Max": 65000,
    "Skills_Mentioned": [
      "graphic design",
      "photo and video editing"
    ],
    "Equal_Opportunity_Information": "Our oOice deeply values the diversity of our employees and encourages candidates from diverse backgrounds to apply.",
    "Cleaned_Text": "Press Assistant\nThe Energy and Commerce Committee Democratic StaO seeks a motivated and\ndesirous communications professional to join fast-paced communications team as a \nPress Assistant.\nResponsibilities include:\n  Drafting press releases, social media posts, talking points, and the committee \nnewsletter;\n  Designing graphics for both social media and web content;\n  Producing and editing videos and photos;\n  Monitoring social media;\n  Maintaining and updating press lists; and\n  Compiling daily press clips.\nQualiﬁed candidates must have excellent written and oral communication skills, a proven \nability to perform under pressure while juggling multiple tasks and sound political\njudgment.\n\n Prior Hill or campaign communications experience, as well as professional social media\nand digital experience (including graphic design and photo and video editing), is preferred.\nOur oOice deeply values the diversity of our employees and encourages candidates from\ndiverse backgrounds to apply.\nSalary: $65,000\nQualiﬁed candidates should submit a cover letter, resume, one writing sample, and two \ndigital samples to ecdjobs@mail.house.gov. Please no walk ins or phone calls.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-016-25",
    "Posting_Author": "Congresswoman Pramila Jayapal's Office",
    "Congress_Number": null,
    "State_District": "WA-07",
    "Location": "Washington, DC",
    "Job_Function": null,
    "Title_Parsed": "Senior Legislative Assistant",
    "Office_Type": "OOnce",
    "Responsibilities": [
      "Driving current and new legislative initiatives...",
      "Representing the Congresswoman's priorities...",
      "Building and maintaining relationships..."
    ],
    "Qualifications": [
      "4-6 years of relevant experience...",
      "Passionate about public service...",
      "Excellent writing and time management skills."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The OOice of Congresswoman Pramila Jayapal is an equal opportunity employer.",
    "Cleaned_Text": "{}",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-013-25",
    "Posting_Author": "Congresswoman Sarah McBride (DE-AL)",
    "Congress_Number": null,
    "State_District": "DE",
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Legislative Assistant",
    "Office_Type": "congressional office",
    "Responsibilities": [
      "Collaborate with the Congresswoman, Legislative Director, additional staO, other hill oOices, and stakeholders to develop and advance legislative initiatives within the assigned diverse legislative portfolio.",
      "StaO the Congresswoman for her work on the Science, Space, and Technology Committee, including writing remarks, managing relationships, and advancing legislation.",
      "Research and track legislation, coordinate bill co-sponsorships, and monitor relevant committee and ﬂoor activities.",
      "Draft policy memos and brieﬁng materials for the Congresswoman and senior staO.",
      "Brief the Congresswoman on legislative matters and assist in preparing her for hearings, markups, and meetings.",
      "Represent the Congresswoman in meetings with constituents, advocacy oOrganizations, and industry stakeholders.",
      "Support state oOice staO by providing relevant legislative updates and assisting with local initiatives.",
      "Perform additional responsibilities as assigned."
    ],
    "Qualifications": [
      "Legislative experience in a congressional oOice.",
      "Strong written and verbal communication skills.",
      "Ability to exercise sound judgment, make decisions under pressure, and navigate challenging situations.",
      "Excellent organizational and time management skills to manage multiple projects simultaneously."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "science policy",
      "technology policy"
    ],
    "Equal_Opportunity_Information": "The oOice of Congresswoman Sarah McBride is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.",
    "Cleaned_Text": "MEM-013-25\nPosition Overview:\nCongresswoman Sarah McBride (DE-AL) is seeking a Legislative Assistant for her\nWashington, D.C. oOice. This position will focus on a diverse legislative portfolio, including\nthe Congresswoman's work on the Science, Space, and Technology Committee.\n\nThe ideal candidate will be a self-starter with strong writing, research, and communication\nskills, capable of producing high-quality work in a fast-paced environment. This is not an\ntree-level position. Previous legislative experience in a congressional oOice is required.\nA positive attitude, attention to detail, the ability to thrive in a collaborative team\nekvironment, and a good sense of humor are essential.\n\nKey Responsibilities:\n• Collaborate with the Congresswoman, Legislative Director, additional staO, other\nhill oOices, and stakeholders to develop and advance legislative initiatives within\nthe assigned diverse legislative portfolio.\n• StaO the Congresswoman for her work on the Science, Space, and Technology\nCommittee, including writing remarks, managing relationships, and advancing legislation.\n• Research and track legislation, coordinate bill co-sponsorships, and monitor relevant committee and \\'\\u0225oor activities.\n• Draft policy memos and brieﬁng materials for the Congresswoman and senior staO.\n• Brief the Congresswoman on legislative matters and assist in preparing her for\nechairs, markups, and meetings.\n\n\\• Represent the Congresswoman in meetings with constituents, advocacy\noOrganizations, and industry stakeholders.\nSupport state oOice staO by providing relevant legislative updates and assisting with local initiatives.\nPerform additional responsibilities as assigned.\n\nQualiﬁcations:\n• Legislative experience in a congressional oOice.\n• Strong written and verbal communication skills.\n• Ability to exercise sound judgment, make decisions under pressure, and navigate challenging situations.\n• Excellent organizational and time management skills to manage multiple projects simultaneously.\n\nPreferred:\n• Familiarity with issues related to the Science, Space, and Technology Committee or\ndemonstrated interest in science and technology policy.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-012-25",
    "Posting_Author": "Congresswoman Shontel M. Brown",
    "Congress_Number": null,
    "State_District": "OH-11",
    "Location": "Washington, D.C.",
    "Job_Function": "Operations Assistant/Legislative Correspondent",
    "Title_Parsed": "Operations Assistant/Legislative Correspondent",
    "Office_Type": "Congress Office",
    "Responsibilities": [
      "logging phone calls",
      "greeting visitors",
      "managing front office operations",
      "handling tour and flag requests",
      "assisting with drafting constituent correspondence",
      "managing the mail program",
      "overseeing the intern program",
      "providing administrative support to the team",
      "additional duties as assigned"
    ],
    "Qualifications": [
      "excellent writing and proofreading ability",
      "outstanding organizational and time management capacity",
      "strong attention to detail",
      "ability to work independently"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Ohio ties"
    ],
    "Equal_Opportunity_Information": "We are an equal opportunity employer... ",
    "Cleaned_Text": "MEM-012-25Congresswoman Shontel M. Brown (OH-11) is seeking a full-time Operations Assistant/Legislative Correspondent in her Washington, D.C. office. The position reports to the Administrative Director and Legislative Director. Responsibilities include logging phone calls, greeting visitors, managing front office operations, handling tour and flag requests, assisting with drafting constituent correspondence and managing the mail program, overseeing the intern program, providing administrative support to the team, and additional duties as assigned.",
    "DW_NOMINATE": -0.4449999928474426,
    "LES": 0.08653660118579865
  },
  {
    "Post_ID": "MEM-530-24",
    "Posting_Author": "Majority StaO",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": "Subcommittee on Disability Assistance and Memorial AOairs",
    "Title_Parsed": "Research Assistant",
    "Office_Type": "Congressional Staff",
    "Responsibilities": [
      "Maintain Subcommittee archives of activities, including Member and stakeholder engagements.",
      "Travel and conduct oversight visits at agency locations.",
      "Draft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee's jurisdiction.",
      "Subcommittee casework as assigned.",
      "Answer telephone and respond to caller inquiries.",
      "Keep abreast of emails, including Member inquiries and agency notiﬁcations.",
      "Organize and maintain Subcommittee electronic records, including meeting notes, agency reports, other documents.",
      "Participate in staO-level discussions on legislation being considered; draft policy memoranda as assigned.",
      "Assist with due diligence being performed as part of the Subcommittee's oversight duties, including requesting information from agencies on matters within the Subcommittee jurisdiction.",
      "Assist with hearing preparation and coordination of hearings, including drafting memoranda and remarks for Chairman.",
      "Attend meetings with agencies, veteran service organizations, and other parties, and maintain notes on such meetings.",
      "Assist with the drafting of memoranda for the full Committee and Subcommittee Chairman on matters within the jurisdiction of the Subcommittee.",
      "Review the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to Subcommittee Members and staO.",
      "Assist with developing policy recommendations and serve as a resource for Members both on and oO Committee.",
      "Responsible for all other duties assigned by the full Committee Chairman, Subcommittee Chairman, full Committee StaO Director or Deputy StaO Director, and Subcommittee StaO Director, and assisting other Committee staO, as needed."
    ],
    "Qualifications": [
      "Bachelor of Arts or Science.",
      "Strong research skills. Legal research skills (e.g., LexisNexis) is a plus.",
      "Strong writing and editing skills.",
      "Strong Microsoft OOice proficiency, including expertise in Word and the ability to use Excel.",
      "Strong organizational skills.",
      "Strong verbal communication.",
      "Excellent attention to detail.",
      "Excellent listening skills.",
      "Strong ability to manage ﬂuctuating workloads and juggle and prioritize tasks, including managing short-, medium-, and long-term tasks.",
      "Team oriented.",
      "Excellent ability to work well under pressure and time constraints.",
      "Problem solving and analytical skills are a plus.",
      "Potential to work independently."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Strong research skills.",
      "Legal research skills (e.g., LexisNexis) is a plus.",
      "Strong writing and editing skills.",
      "Microsoft OOice proficiency including Word Excel expertise.",
      "strong organizational skills.",
      "verbal communication.",
      "attention to detail.",
      "listening skills.",
      "ability to manage workload time efficiently.",
      "team oriented.",
      "work well under pressure.",
      "problem solving analytical skills.",
      "independence potential"
    ],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM -522-24",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington D.C. office",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Maintaining relationships and booking interviews with local press outlets"
    ],
    "Qualifications": [],
    "Salary_Min": 60000,
    "Salary_Max": 80000,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The office is an equal opportunity employer; we do not discriminate",
    "Cleaned_Text": "Maintaining relationships and booking interviews with local press outlets.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-517-24",
    "Posting_Author": "Congresswoman Susie Lee (D-NV)",
    "Congress_Number": null,
    "State_District": "NV",
    "Location": "DC",
    "Job_Function": "Staffing Coordinator",
    "Title_Parsed": "DC Scheduler",
    "Office_Type": "DC Office",
    "Responsibilities": [
      "Track and evaluate invitations and scheduling requests",
      "Coordinate travel for the Member ",
      "Compile Congresswoman's nightly briefing materials",
      "Manage office operations",
      "Facilitate member meetings and calls",
      "Coordinate internal and external events",
      "Assist with onboarding and training for staff and interns",
      "Provide staffing support ",
      "Drive Senator as needed"
    ],
    "Qualifications": [
      "Create complex scheduling plans ",
      "Organize travel itinerary ",
      "Maintain the efficiency of daily schedules ",
      "Support high level executives ",
      "Manage conflicts related to sensitive topics ",
      "Prepare documents and materials for public meetings ",
      "Enhance efficiency of administrative tasks ",
      "Maintain up-to-date knowledge of Congressional rules and procedures",
      "Develop strong relationships with Member's offices"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Scheduling",
      "Time Management",
      "Attention to detail",
      "Effective communication",
      "Problem-solving",
      "Flexibility"
    ],
    "Equal_Opportunity_Information": "Candidates of diverse backgrounds are encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.",
    "Cleaned_Text": 