[
  {
    "Post_ID": "MEM-478-24",
    "Posting_Author": "",
    "Congress_Number": 25,
    "State_District": "RI-01",
    "Location": "Pawtucket, RI",
    "Job_Function": "",
    "Title_Parsed": "(no title parsed)",
    "Office_Type": "Congressional office",
    "Responsibilities": [
      "\nMeeting with local groups and constituents.\nProactively seeking opportunities to develop community outreach relationships.\nWorking closely with the District Director and Washington D.C. o<ice to implement\nplanned outreach events and to suggest new innovative ideas.\nRepresenting or speaking on behalf of the Congressman at events and local\nmeetings.\nStaying abreast of local news and issues a<ecting Rhode Islanders.\nMonitoring and updating the Congressman and sta< on district and local issues.\nResponding to casework and federal funding inquiries from constituents.\nPerforming other duties as assigned.\n"
    ],
    "Qualifications": [
      "\ndetail oriented\npositive attitude\ngenuine desire to serve constituents\nin “Able to work in a fast-paced, collaborative environment”\nsuccessfull applicants (note typo) must be detail oriented, have a positive attitude,\nand the genuine desire to serve constituents in Rhode Island’s First Congressional District.\ncongressional or other relevant grant writing and managing experience is strongly preferred. ¼hi Rhode Island ties are a plus.\ndiversity of backgrounds are encourged (note typo) to apply.",
      "\nCandidates of diverse backgrounds are encouraged to apply."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "exceptional communications skills",
      "be detail oriented",
      "proactive",
      "strong understanding of Rhode Island",
      "able to work in a fastpaced, collaborative environment",
      "communicate and meet with constituents"
    ],
    "Equal_Opportunity_Information": "The o<ice does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin.",
    "Cleaned_Text": "(no cleaned text provided)",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-474-24",
    "Posting_Author": "Unknown",
    "Congress_Number": null,
    "State_District": "Unknown",
    "Location": "House Committee on Veterans’ Aairs",
    "Job_Function": "Digital Director",
    "Title_Parsed": "Digital Director, House Committee on Veterans’ Aairs, Republican Sta< of the House Committee on Veterans’ A airs.",
    "Office_Type": "Majority",
    "Responsibilities": [
      "Drafting press releases, ༀor floor speeches, quotes, talking points, social media posts, one-pagers, and scripts for speaking engagements and video productions.",
      "Creating, developing, and managing social media posts and a broader social media strategy.",
      "Managing sending out press releases, oༀicial statements, media advisories, and other external communications.",
      "Managing the Committee website.",
      "Managing the internal and external Committee press list, to include growing the external press list.",
      "Managing hearing livestreams.",
      "Clipping and posting Committee Members’ hearing and ༀloor remarks in real-time.",
      "Photographing hearings, events, and meetings, to include occasional videography.",
      "Creating graphics for social media and visual aids.",
      "Compiling, monitoring, and distributing daily press clips.",
      "Perform other duties as assigned."
    ],
    "Qualifications": [
      "Ideal candidate will possess strong written, verbal, and digital communication skills,",
      "an interest in veterans’ issues, the ability to work in a fast-paced, collaborative, forwardthinking environment,",
      "professionalism, and a good sense of humor."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "social media strategy",
      "writing samples"
    ],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer.",
    "Cleaned_Text": "<html>...</html>",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-473-24",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "Sta< Assistant, House Committee on Veterans’ A<airs",
    "Office_Type": null,
    "Responsibilities": [
      "Foster a welcoming atmosphere and create a positive ﬁrst impression for the office's constituents, visitors, and VIPs.",
      "Provide front office administrative coverage to include answering phones, and processing mail.",
      "Maintain ﬁles for mail, bills, reports, and public laws, and other legislative papers."
    ],
    "Qualifications": [
      "Previous Hill experience is recommended but not required."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer.",
    "Cleaned_Text": "MEM-473-24\nTitle: Sta< Assistant, House Committee on Veterans’ A<airs, Republican Sta<\nReports to: Chief Clerk, House Committee on Veterans’ A<airs\nSta< assistants often serve as the ﬁrst point of contact for constituents, guests, and VIPs,\nsetting the tone for the office. The Sta< Assistant provides general administrative support\nto sta<, sta<s front office and phones, preparation for hearings/committee business,\nprocesses mail, and assists with other duties as assigned.\nCORE RESPONSIBILITIES:\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\nEnterprise communication\n•\n\nMaintain contact lists for committee sta< and committee member personal office sta<.\n\nFoster a welcoming atmosphere and create a positive ﬁrst impression for the\noffice's constituents, visitors, and VIPs.\nProvide front office administrative coverage to include answering phones, and\nprocessing mail.\nMaintain ﬁles for mail, bills, reports, and public laws, and other legislative papers.\nPrepare binders for full committee events (hearings, markups, ﬂoor, etc.).\nPrepares hearing room for hearings, markups, and other committee business.\nReview the Congressional Record daily for information that impacts the Committee.\nMaintain contact lists for committee sta< and committee member personal office sta<.\nOversee the internship program, which includes supervising and training interns.\nManages hearing room reservations\nMaintain Republican email distribution and contact lists.\nMonitor office supplies to ensure that sta< have needed supplies.\nServe as the secondary O<ice Safety Coordinator.\nPerform other duties as assigned.\nistation\nBeneﬁts:\n• Employees may be eligible for the following beneﬁts:\n• Sick and Annual Leave\n• Student Loan Repayment Program\n• Federal Employees Health Beneﬁts Program\n• Thrift Savings Plan\n• Federal Employees’ Group Life Insurance Program\n• Federal Long-Term Care (LTC) Insurance\n• Flexible Spending Accounts (FSAFEDS)\n• Dental & Vision Insurance Program (FEDVIP)\nOther Information:\nEmployment with the U.S. House of Representatives is at-will. The U.S. House of\nRepresentatives is an equal opportunity employer. All applicants will be considered without\nregard to race, color, national origin, religion, sex (including marital or parental status),\ndisability, or age. Transportation and all related travel expenses associated with the\ninterview and hiring process must be paid by the applicant.\nHow to Apply:\nInterested candidates should send their cover letter, resume, and references to\nVAR.Resumes@mail.house.gov with “Sta< Assistant” in the subject line. No calls or walkins, please.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-470-24",
    "Posting_Author": "House Judiciary Committee – Sta< Assistant",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "Sta< Assistant",
    "Title_Parsed": "Sta< Assistant",
    "Office_Type": "Assistant",
    "Responsibilities": [
      "overseeing logistics for hearings and markups",
      "providing administrative and research support to committee and subcommittee counsels",
      "coordinating calendars for the committee, the subcommittees, and the senior sta<"
    ],
    "Qualifications": [
      "excellent organizational skills",
      "strong research, writing, and communication skills"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "none mentioned in the text"
    ],
    "Equal_Opportunity_Information": "The Committee strives to ensure that our sta< reﬂects the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply.",
    "Cleaned_Text": "The Democratic sta< of the House Judiciary Committee seeks a Sta< Assistant. Candidates should have excellent organizational skills and strong research, writing, and communication skills. Responsibilities include overseeing logistics for hearings and markups; providing administrative and research support to committee and subcommittee counsels; and coordinating calendars for the committee, the subcommittees, and the senior sta<. Additional responsibilities may include serving as an assistant clerk during markups and managing the committee’s internship program. The ideal candidate will be willing to learn from our counsels and grow into more substantive role over time. The Committee strives to ensure that our sta< reﬂects the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital status, sexual orientation, and gender identity), disability, age, or national origin.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-469-24",
    "Posting_Author": "The Democratic Sta",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "Counsel for the House Judiciary Committee - National Security",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Serving as a resource for Democratic Members of the Committee on matters of law and policy within the Committee's jurisdiction"
    ],
    "Qualifications": [
      "A resume, cover letter, and writing sample"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "exceptional writing and legal research skills",
      "strong work ethic",
      "professional temperament",
      "ability to work on novel and complex matters"
    ],
    "Equal_Opportunity_Information": "The Committee strives to ensure that our sta< represents the diversity of the country's population.",
    "Cleaned_Text": "Counsel for the House Judiciary Committee – National Security\n\nThe Democratic Sta< of the House Judiciary Committee seeks a dedicated, hard-working\nlawyer with a minimum of µfive years of relevant legal experience to serve as a committee\n\ncounsel, working with counsils across multiple subcommittees and reporting to the Chief\nOversight Counsel.\n\nResponsibilities include serving as a resource for Democratic Members of the Committee\non matters of law and policy within the Committee's jurisdiction, with a focus on national\nsecurity, surveillance, and civil liberties; drafting legislation; preparing hearings; drafting\nstatements, memos, and brieüing materials; attending classiîd brieüings; and providing guidance to\nDemocratic House offices on matters of national security and constitutional law.\n\nA successful candidate must demonstrate exceptional writing and legal research skills, a strong work ethic, a professional temperament, and an ability to work on novel and complex matters. This candidate must also be able to work collaboratively with a broad range of personalities. In addition, sound political judgment, prior legislative or policy experience, a substantive background in national security law, an active security clearance, and a demonstrated commitment to public service are strongly preferred. A sense of humor is a plus.\n\nThe Committee strives to ensure that our sta\represent the diversity of the country's population.\nThe Committee also encourages women and members of historically disadvantaged minority groups to apply.\n\nThe Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-468-24",
    "Posting_Author": "Democratic Sta< of the House Judiciary Committee's Subcommittee on the Constitution – Reproductive Rights",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "serving as a resource for Democratic Members of the Committee on matters of law and policy within the Subcommittee’s jurisdiction",
      "drafting legislation",
      "preparing hearings",
      "drafting statements, memos, and briefing materials",
      "providing guidance to Democratic House oﬃces on matters of constitutional and civil rights law"
    ],
    "Qualifications": [
      "demonstrate exceptional writing and legal research skills",
      "a strong work ethic",
      "a professional temperament",
      "an ability to work on novel and complex matters",
      "sound political judgment",
      "prior legislative or policy experience",
      "a substantive background in civil rights or constitutional law",
      "a demonstrated commitment to public service",
      "a sense of humor"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "reproductive rights",
      "privacy of patients and health care providers",
      "constitutional and civil rights law"
    ],
    "Equal_Opportunity_Information": "The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin.",
    "Cleaned_Text": "counsel for the House Judiciary Subcommittee on the Constitution – Reproductive Rights",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-467-24",
    "Posting_Author": "Congressman Tom Suozzi",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, D.C.",
    "Job_Function": "Press Secretary/Communications Director",
    "Title_Parsed": "Press Secretary/Communications Director",
    "Office_Type": "Staff Office",
    "Responsibilities": [
      "writing press releases",
      "statements and media advisories",
      "creating and managing social media content",
      "drafting talking points and op-eds",
      "creating franked communications",
      "e-newsletters",
      "mailers",
      "telephone townhalls"
    ],
    "Qualifications": [
      "very strong writing skills",
      "close eye to detail",
      "ﬂuency with social media platforms and digital tools",
      "experience working with national and local press"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "writing",
      "communication",
      "social media",
      "digital tools",
      "national press experience"
    ],
    "Equal_Opportunity_Information": "All applicants will be considered without regard to...",
    "Cleaned_Text": "Press Secretary/Communications Director",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-462-24",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "MEM-462-24\nThe Washington, D.C. O<ice of Congresswoman Pramila Jayapal (WA-07), member of the\nHouse Judiciary Committee, is seeking a law clerk to work with her legislative team. Under\nthe supervision of the o<ice’s Legislative Counsel, the law clerk will conduct legal and policy research,\nattend and staJUDGY Committee hearings,\nmake vote\nrecommendations,\nand draft legal and policy memos and other documents.\nHighachieving law students interested in public law, policy, politics, or government service are\nstrongly encouraged to apply.\nLaw clerks will engage in serious, substantive work across a number of issue areas,\nincluding antitrust enforcement, administrative law reform, civil rights and civil liberties,\ncourt reform and oversight, criminal justice, voting rights, and intellectual property. The\nclerkship is unpaid but available for academic credit.\nWomen, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and\nmembers of other underrepresented communities are strongly\nencouraged to apply.\nTo apply, please email a (1) resume, (2) cover letter, (3) writing sample, and (4) list of three\nreferences with email contacts to Jayapal.DCInternships@mail.house.gov. Please send all\napplication documents in a single PDF ÷ile and include “Law Clerk – FirstName Last Name”\nin the subject line.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-458-24",
    "Posting_Author": "Steven Horsford’s District Office",
    "Congress_Number": null,
    "State_District": "District 4",
    "Location": "North Las Vegas, Nevada",
    "Job_Function": "District Representative",
    "Title_Parsed": "District Representative",
    "Office_Type": "Congressional",
    "Responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals.",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities.",
      "Build and maintain relationships with constituents and key community leaders.",
      "Organize and participate in community events, town halls, and outreach campaigns to engage constituents.",
      "Act as the representative for the Member within his or her area of responsibility",
      "Handle casework assignments and assess casework for problems requiring legislative action",
      "Maintain a good working relationship with the Member, staff, and constituents",
      "Work well under pressure and handle stress",
      "Perform other duties as assigned"
    ],
    "Qualifications": [
      "Bachelor’s degree or related job experience is required",
      "A demonstrated interest in public service and familiarity with District 4 community is preferred"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "We are an equal opportunity employer.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-452-24",
    "Posting_Author": "Congressman Brendan Boyle (PA-2)",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC office",
    "Job_Function": "Special Assistant",
    "Title_Parsed": "Special Assistant in his Washington, DC office",
    "Office_Type": "Congressional office",
    "Responsibilities": [
      "Sta<ing/driving the member when in Washington, DC.",
      "Ensuring that the member has all necessary documents and materials prior to events, including coordinating with the Operations Director and Scheduler regarding member scheduling and logistics.",
      "Working with other Washington, DC based sta< to prepare documents and other materials for the member prior to events and meetings.",
      "Managing the o<ice’s phone and voicemail system.",
      "Helping to manage the o<ice’s interns.",
      "Coordinating tours and ﬂag requests.",
      "Assisting the scheduler and legislative sta< with record keeping and other administrative tasks.",
      "Other duties as needed."
    ],
    "Qualifications": [
      "Strong organizational and communication abilities.",
      "Proﬁciency in Microsoft O<ice (Word, Outlook, Excel, Teams).",
      "The ability to multi-task and prioritize e<ectively.",
      "Being a self-starter, detail oriented and punctual at all times.",
      "Having a strong general knowledge of the physical layout of Washington, DC.",
      "Proﬁciency in Spanish or any other foreign language.",
      "Previous experience working on a political campaign or in the o<ice of an elected o<icial.",
      "Candidates with prior Washington, DC based congressional (i.e. Capitol Hill) experience will be given priority.",
      "Having a connection to Philadelphia or Southeastern Pennsylvania.",
      "Having good general knowledge of the physical layout of Capitol Hill, including House and Senate o<ice buildings, as well as the U.S. Capitol Building.",
      "Proﬁciency with Intranet Quorum or other CRM software."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Strong organizational and communication abilities.",
      "Proﬁciency in Microsoft O<ice (Word, Outlook, Excel, Teams).",
      "The ability to multi-task and prioritize e<ectively.",
      "Being a self-starter, detail oriented and punctual at all times.",
      "Having a strong general knowledge of the physical layout of Washington, DC.",
      "Proﬁciency in Spanish or any other foreign language.",
      "Previous experience working on a political campaign or in the o<ice of an elected o<icial.",
      "Candidates with prior Washington, DC based congressional (i.e. Capitol Hill) experience will be given priority.",
      "Having a connection to Philadelphia or Southeastern Pennsylvania.",
      "Having good general knowledge of the physical layout of Capitol Hill, including House and Senate o<ice buildings, as well as the U.S. Capitol Building.",
      "Proﬁciency with Intranet Quorum or other CRM software."
    ],
    "Equal_Opportunity_Information": "This o<ice is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability.",
    "Cleaned_Text": "Congressman Brendan Boyle (PA-2) is seeking a full-time sta< member to serve as a Special Assistant in his Washington, DC o<ice. Responsibilities include (but are not limited to): Sta<ing/driving the member when in Washington, DC.\r\n\r\nEnsuring that the member has all necessary documents and materials prior to events, including coordinating with the Operations Director and Scheduler regarding member scheduling and logistics.\r\n\r\nWorking with other Washington, DC based sta< to prepare documents and other materials for the member prior to events and meetings.\r\n\r\nManaging the o<ice’s phone and voicemail system.\r\n\r\nHelping to manage the o<ice’s interns.\r\n\r\nCoordinating tours and ﬂag requests.\r\n\r\nAssisting the scheduler and legislative sta< with record keeping and other administrative tasks.\r\n\r\nOther duties as needed. Required skills include the following:\r\n\r\n• Strong organizational and communication abilities.\r\n<br>\n\r\nProﬁciency in Microsoft O<ice (Word, Outlook, Excel, Teams).\r\n<br>\n\r\nThe ability to multi-task and prioritize e<ectively.\r\n<br>\n\r\nBeing a self-starter, detail oriented and punctual at all times.\r\n<br>\r\nHaving a strong general knowledge of the physical layout of Washington, DC.\r\n<br>\r\nProﬁciency in Spanish or any other foreign language.\r\n<br>\r\nPrevious experience working on a political campaign or in the o<ice of an elected o<icial.\r\n<br>\r\nCandidates with prior Washington, DC based congressional (i.e. Capitol Hill) experience will be given priority.\r\n<br>\r\nHaving a connection to Philadelphia or Southeastern Pennsylvania.\r\n<br>\r\nHaving good general knowledge of the physical layout of Capitol Hill, including House and Senate o<ice buildings, as well as the U.S. Capitol Building.\r\n<br>\r\nProﬁciency with Intranet Quorum or other CRM software.\r\n<br>\r\nProspective applicants should have a valid driver’s license, as well as full-time access to a working automobile. Prospective applicants should be able to work in dynamic and rapidly paced work environment, have a deﬁned interest in public service, and should be prepared for the need to work evenings and some weekends as needed (schedule ﬂexibility is a must, particularly during weeks Congress is in session).\r\n<br>\n\r\nCompensation will be commensurate with experience. This position includes paid leave,\r\n\r\nretirement beneﬁts,\r\n\rnfull medical,\r\n\rnvision insurance,\r\n\ntstudent loan repayment support for qualiﬁed individuals, among other beneﬁts.\r\n<br>\r\nProspective applicants should send a resume and cover letter to PA02.Jobs@mail.house.gov.\r\n<br>\r\nPlease no calls or drop ins. This o<ice is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-451-24",
    "Posting_Author": null,
    "Congress_Number": 24,
    "State_District": null,
    "Location": "D.C. office",
    "Job_Function": "Deputy Chief of Staff",
    "Title_Parsed": null,
    "Office_Type": "Member's office",
    "Responsibilities": [
      "Formulate policy positions",
      "Oversee legislative and media relations strategies",
      "Collaborate with district staff on outreach efforts"
    ],
    "Qualifications": [
      "Bachelor's degree",
      "Demonstrated interest in public service",
      "Previous Hill experience"
    ],
    "Salary_Min": 0,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "ConservativeMidwest GOP@gmail.com",
    "Cleaned_Text": "The o<ice of a conservative mid-western Member of Congress seeks to hire a Deputy Chief of Sta< based in the D.C. o<ice.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-442-24",
    "Posting_Author": "Congressman Jason Crow (CO-06)",
    "Congress_Number": null,
    "State_District": "CO-06",
    "Location": "Washington, D.C. office",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas",
      "Working with external stakeholders, CRS, Legislative Counsel, and committee staff to draft legislation based on the Member’s priorities",
      "Preparing and starting the Member for meetings, and assisting in the drafting of remarks, as needed",
      "Communicating clearly and consistently with the Member, Legislative Director, and legislative, communications, and district teams on legislative updates"
    ],
    "Qualifications": [
      "Commitment to a collaborative work environment",
      "Ability to work in a fast-paced environment and manage competing priorities",
      "Ability to communicate up and down within the team",
      "Ability to learn the Congressman’s voice and legislative priorities",
      "Interest in identifying and pursuing new opportunities and the ability to anticipate and adapt to challenges"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "This office is committed to building a diverse and inclusive team: candidates of color, women, and LGBTQIA+ candidates are encouraged to apply.",
    "Cleaned_Text": "Congressman Jason Crow (CO-06) seeks a highly motivated, hard-working Legislative Assistant, based in our Washington, D.C. office. This position reports to the Legislative Director. The LA will handle a domestic-facing portfolio, including animals, arts, postal, small business, housing, and telecom.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-382-24",
    "Posting_Author": "Raymond.Paoletta@mail.house.gov",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Medina and Parma, Ohio",
    "Job_Function": "Administrative Assistant to Congressional Liaison",
    "Title_Parsed": "Military and Veterans A@airs Liaison",
    "Office_Type": "District Office",
    "Responsibilities": [
      "Acts as the representative for the Member within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Member and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents, organizations, etc;",
      "Acts as a liaison to local, state and federal o<icials and other persons or groups to form e<ective relationships for the Member;",
      "Acts as a liaison to and notiﬁes the appropriate media when the Member will be in the liaison’s area and works with the Member’s Scheduler and Press Secretary to ensure appropriate media participation;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Director of Constituent Services;",
      "Monitors scheduled district meetings for the Member with constituents;",
      "Screens and refers cases, when appropriate, to other district o<ices;"
    ],
    "Qualifications": [
      "Bachelor's degree or equivalent combination of education and experience preferred;",
      "Previous office experience is preferred;",
      "Previous experience working for a Member of Congress, elected o<icial, or government agency preferred;"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Strong oral and written communication skills;",
      "Thorough knowledge of legislative process and of House organization and procedures;",
      "Proﬁciency in word processing."
    ],
    "Equal_Opportunity_Information": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-135-24",
    "Posting_Author": "Congresswoman Joyce Beatty (OH-03)",
    "Congress_Number": null,
    "State_District": "OH-03",
    "Location": "Washington, D.C.",
    "Job_Function": "Press Secretary",
    "Title_Parsed": "Press Secretary",
    "Office_Type": "Member of Congress",
    "Responsibilities": [
      "Serve as the primary contact for media requests...",
      "Advance press events and sta< the Member as needed...",
      "Establish and maintain relationships with Ohio media...",
      "Draft and distribute media materials including press releases...",
      "Assist with developing social media content creation..."
    ],
    "Qualifications": [
      "experienced Press Secretary",
      "established, active relationships with top-tier national media outlets",
      "on-the-record experience",
      "Ohio ties (preferred)"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "media relations",
      "press opportunities",
      "messaging",
      "relationships",
      "media outlets",
      "social media content creation"
    ],
    "Equal_Opportunity_Information": "The O<ice of Congresswoman Beatty is an Equal Opportunity Employer who does not discriminate in employment... ",
    "Cleaned_Text": "The Office of Congresswoman Joyce Beatty seeks an experienced Press Secretary...",
    "DW_NOMINATE": null,
    "LES": null
  }
]