[
  {
    "Post_ID": "MEM-040-25",
    "Posting_Author": "Congressman Rob Wittman",
    "Congress_Number": null,
    "State_District": "VA01",
    "Location": "Washington, D.C.",
    "Job_Function": "Staff Assistant",
    "Title_Parsed": "",
    "Office_Type": "",
    "Responsibilities": [
      "Develop and implement a comprehensive legislative strategy aligned with the Congressman's priorities and constituents' needs.",
      "Manage and mentor a legislative team, provide guidance, and foster collaboration among sta? members.",
      "Build and maintain relationships with other lawmakers, committee sta?, advocacy groups, and stakeholders to advance the Congressman’s legislative goals.",
      "Engage with district stakeholders, including local leaders, businesses, and community organizations, to understand their needs and incorporate their perspectives into legislative e?orts.",
      "Understand the political landscape and anticipate the implications of legislative actions as it relates to VA-01.",
      "Draft legislation, amendments, and policy papers, ensuring clarity and adherence to congressional procedures.",
      "Maintains up-to-date tracking reports on all legislative items including Sponsored and Cosponsored legislation and letters, provisions in larger bills, and district wins.",
      "Review responses to all constituent mail, and review content produced by the communications team.",
      "Represent the Congressman in meetings with constituents, interest groups, and other legislative o?ices.",
      "Monitor legislative developments and provide timely updates to the Congressman and his sta?"
    ],
    "Qualifications": [
      "Minimum of 5 years of experience in legislative a?airs, public policy, or a related field, preferably in a congressional o?ice.",
      "Strong understanding of the legislative process and federal government operations.",
      "Excellent writing, research, and communication skills.",
      "Proven ability to work collaboratively in a fast-paced environment and manage multiple priorities.",
      "Commitment to public service and the values of Congressman Wittman.",
      "Virginia ties Preferred"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Congressman Wittman is an Equal Opportunity Employer. We encourage applicants from all backgrounds to apply.,  ",
    "Cleaned_Text": "Congressman Rob Wittman is seeking a highly motivated and experienced Legislative Director to lead his legislative agenda...The Legislative Director would handle the Congressman\\u2019s Natural Resources Committee assignment, as well as Energy, Environment and Chesapeake Bay, Tax, Telecom/Broadband, Transportation ɦn Infrastructure, Appropriations and the Budget, Immigration, Labor/Workforce/Federal Employees.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-038-25",
    "Posting_Author": "Congresswoman Jahana Hayes (CT-05)",
    "Congress_Number": null,
    "State_District": "CT-05",
    "Location": "Washington, D.C.",
    "Job_Function": "Communications Director",
    "Title_Parsed": null,
    "Office_Type": "Member",
    "Responsibilities": [
      "Lead strategy development and implementation of the Member's communications objectives in consultation with senior staff...",
      "Oversee day-to-day press activities, including responding to media inquiries, booking interviews, and pitching to media outlets;",
      "...Develop social media content creation, including rapid response;",
      "...Produce franked communications, including 499s and mailers;)], "
    ],
    "Qualifications": [
      "Capitol Hill or political experience or a demonstrated knowledge of Congress and the legislative process;",
      "3-4 years of experience, with on the record experience as a press secretary or other communications role;",
      "Superior writing, editing, and oral communications skills;",
      "Creative thinker with innovative approaches and an understanding of traditional communications and digital media;"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Capitol Hill or political experience or a demonstrated knowledge of Congress and the legislative process;",
      "3-4 years of experience, with on the record experience as a press secretary or other communications role;",
      "Superior writing, editing, and oral communications skills;",
      "Creative thinker with innovative approaches and an understanding of traditional communications and digital media;"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": " Congresswoman Jahana Hayes (CT-05) seeks an experienced and creative Communications Director to join her Washington, D.C. o?ice.\n\nThe ideal candidate should have experience working on Capitol Hill, possess strong written and oral communication skills, have demonstrated political instincts with a thorough knowledge fostering and maintaining relationships with press. They should be a team player who is self-motivated,\ndetailed oriented, comfortable managing multiple projects under strict deadlines and able to explore innovative approaches to traditional communications.\n\nThis position will act as chief spokesperson for the Member, develop and execute strategic communications plans, and work closely with the Communications Team.\nThis is not an entry level position. Candidates must have previous communications and press related experience.\nConnecticut ties are a preferred but not required.\nThis is a senior level position and only applicants who meet all quali\fi cations will be considered.\n\nESSENTIAL JOB FUNCTIONS:\n\\tLead strategy development and implementation of the Member’s communications objectives in consultation with senior sta?\\tOversee day-to-day press activities, including responding to media inquiries, booking interviews,\n\nThe ideal candidate should have experience working on Capitol Hill, possess strong written and oral communication skills, have demonstrated political instincts with a thorough knowledge fostering and maintaining relationships with press. They should be a team player who is self-motivated,d detailed oriented, comfortable managing multiple projects under strict deadlines and able to explore innovative approaches to traditional communications.\n\nThis position will act as chief spokesperson for the Member, develop and execute strategic communications plans, and work closely with the Communications Team.\n\nThis is not an entry level position. Candidates must have previous communications and press related experience.\nConnecticut ties are a preferred but not required.\nThis is a senior level position and only applicants who meet all quali\fi cations will be considered.\n\nESSENTIAL JOB FUNCTIONS:\n\\tLead strategy development and implementation of the Member’s communications objectives in consultation with senior staff...",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-037-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": "DC office",
    "Job_Function": null,
    "Title_Parsed": "Legislative Counsel",
    "Office_Type": null,
    "Responsibilities": [
      "overseeing the Congresswoman's work on the Appropriations Commerce, Justice, Science Subcommittee",
      "advancing current and new legislative initiatives",
      "developing expertise in new issue areas as they arise"
    ],
    "Qualifications": [
      "A strong policy background within the portfolio",
      "A team player and a self-starter",
      "Strong written and verbal communication skills",
      "Previous Capitol Hill experience or experience working in the legal field"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "legislative process and coalition building",
      "advocacy organizations",
      "constituent organizations",
      "multiple priorities in a fast-paced environment"
    ],
    "Equal_Opportunity_Information": "_equal employment opportunity employer?",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-036-25",
    "Posting_Author": "ConservativeRep@mail.house.gov",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, D.C.",
    "Job_Function": "Legislative Director",
    "Title_Parsed": "Legislative Director",
    "Office_Type": "Chief of Sta?",
    "Responsibilities": [
      "works closely with the Chief of Sta? in assisting with the formulation of the Member’s policy and legislative strategy",
      "works with the Communications Director to ensure that the Member’s legislative strategy is incorporated into the office’s communications plan"
    ],
    "Qualifications": [
      "Prior Legislative Director Experience",
      "Proﬁcient at moving legislation",
      "Capitol Hill experience",
      "Great writer",
      "Management Experience",
      "Proﬁcient at Microsoft suite",
      "Detail oriented",
      "Multitasker"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "equal opportunity employer",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-035-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": "Professional Sta? Member",
    "Title_Parsed": null,
    "Office_Type": "Member",
    "Responsibilities": [
      "Leading oversight including organizing and participating in meetings, drafting memos, reading documents, limited domestic travel, and other oversight duties as assigned.",
      "Conducting research to support oversight and legislative activities.",
      "Leading legislation drafting e?orts.",
      "Representing the Committee including meeting with other congressional sta?, veteran service organizations, and external healthcare stakeholders.",
      "Perform other duties as assigned by the Subcommittee Sta? Director, Committee Sta?",
      "Committee Deputy Sta?",
      "Drifting memos, reading documents, limited domestic travel, and other oversight duties as assigned."
    ],
    "Qualifications": [
      "Undergraduate degree",
      "Veterans are strongly encouraged to apply",
      "Post-graduate-level writing skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail.",
      "Problem solving skills.",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous.",
      "Work independently as well as in teams."
    ],
    "Salary_Min": 75000,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Veterans healthcare",
      "Legislation drafting"
    ],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age.",
    "Cleaned_Text": "House Committee on Veterans’ A?airs (Majority) Subwayork on Health Professional StaO Member The Majority sta of the House Committee on Veterans' A?airs is seeking a Professional Sta O Member for the Subcommittee on Health. This position will support the Subcommitt sta Director in conducting oversight of and drafting legislation related to the Department of Vetera ?airs’ (VA) including its Vetera Health Administration (VHA), the largest integrated health care system in the United States, providing care at 1,380 health care facilities.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-029-25",
    "Posting_Author": "Hakeem Je?ries",
    "Congress_Number": null,
    "State_District": null,
    "Location": "The O?ice of Democratic Leader Hakeem Je?ries",
    "Job_Function": "Speechwriter",
    "Title_Parsed": "null",
    "Office_Type": "Office of a Principal",
    "Responsibilities": [
      "drafting written remarks",
      "talking points",
      "press statements"
    ],
    "Qualifications": [
      "experience writing flawless public-facing remarks and statements for a principal"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "writing flawless public-facing remarks and statements",
      "researching"
    ],
    "Equal_Opportunity_Information": "The O?ice of Democratic Leader Hakeem Je?ries is an equal opportunity employer committed to a diverse and inclusive workforce.",
    "Cleaned_Text": "null",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-028-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "Content Partnership Manager",
    "Title_Parsed": "Content Partnership Manager",
    "Office_Type": null,
    "Responsibilities": [
      "Identify, cultivate, and manage relationships with creators, streamers, and podcasters. Use these relationships to act as a liaison between content creators and Members of Congress to facilitate meaningful interactions on political and non-political topics.",
      "Secure opportunities for Members of Congress to appear on local and national digital platforms and ensure e@ective messaging and maximum audience engagement. This will include coordinating logistics for creator-driven content and events around key legislative proceedings and moments such as joint congressional addresses.",
      "Support Members and sta@ with best practices on engaging with digital media on their own, with a particular focus on strategies to connect Members of Congress with local and regional creators, streamers, and podcasters to amplify legislative priorities and personal stories.",
      "Develop and manage a robust data analytics program to track Members of Congress’ engagement with digital creators, streamers, and podcasters and use the ﬁndings to direct their work to bolster Caucus-wide digital partnerships."
    ],
    "Qualifications": [
      "A minimum of 3-5 years of experience in digital communications, political communications, public relations, or a related ﬁeld",
      "A proven track record of managing partnerships or relationships with digital creators or inﬂuencers.",
      "Strong understanding of social media platforms, trends, and digital audience engagement.",
      "Excellent written and verbal communication skills.",
      "Ability to manage multiple projects in a fast-paced environment and meet tight deadlines."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "digital communications",
      "political communications",
      "public relations",
      "project management"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-034-25",
    "Posting_Author": null,
    "Congress_Number": 25,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": null,
    "Title_Parsed": "House Committee on Veterans’ A?airs Majority sta? seeks a subject matter expert on government procurement, contracting, and acquisition.",
    "Office_Type": "position in Washington, DC",
    "Responsibilities": [
      "",
      ""
    ],
    "Qualifications": [
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "Undergraduate degree",
      "Work experience in procurement operations, preferably as a contract specialist or contracting o?icer in a federal agency"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Veterans are strongly encouraged to apply. The U.S. House of Representatives is an equal opportunity employer.",
    "Cleaned_Text": "House Committee on Veterans’ A?airs Majority sta? seeks a subject matter expert on government procurement, contracting, and acquisition.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-033-25",
    "Posting_Author": "Congresswoman Alma S. Adams (NC12)",
    "Congress_Number": null,
    "State_District": "NC12",
    "Location": "Washington, DC",
    "Job_Function": "Scheduler",
    "Title_Parsed": "Scheduler for Congresswoman Alma S. Adams",
    "Office_Type": "Congress Office",
    "Responsibilities": [
      "Manage and maintain the Congresswoman’s daily and long-term schedule..."
    ],
    "Qualifications": [
      "Exceptional time management skills, ability to prioritize and manage competing demands...",
      "Capacity to perform well under pressure in a fast-paced environment.",
      "Ability to work closely with the Member, Chief of Staff, and Deputy Chief of Staff/District Director...",
      "Proven administrative experience.",
      "Strong organizational skills.",
      "Excellent communication skills."
    ],
    "Salary_Min": null,
    "Salary_Max": 50000,
    "Skills_Mentioned": [
      "Time management",
      "Prioritization and organization",
      "Communication",
      "Leadership and management"
    ],
    "Equal_Opportunity_Information": "The Congressional Office of Congresswoman Alma S. Adams is an Equal Opportunity Employer.",
    "Cleaned_Text": "The Office of Congresswoman Alma S. Adams (NC12) seeks an experienced, highly organized, and detail-oriented Scheduler...",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-031-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": "House O?ice of the Legislative Counsel",
    "Job_Function": null,
    "Title_Parsed": "Clerk/Paralegal",
    "Office_Type": "nonpartisan, impartial, and conﬁdential basis",
    "Responsibilities": [
      "Assisting attorneys in the O?ice with the creation of legislative text",
      "Carefully editing legislative text to minimize errors during the process",
      "Drafting certain types of legislation"
    ],
    "Qualifications": [
      "Excellent written and oral communication skills",
      "Attention to detail",
      "Knowledge of, and experience with, various information and o?ice systems"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Microsoft Teams",
      "word processing",
      "XML"
    ],
    "Equal_Opportunity_Information": "The House O?ice of the Legislative Counsel is dedicated to building an inclusive...",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-030-25",
    "Posting_Author": "Representative Jill Tokuda (D-HI-02)",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": "Legislative Assistant / senior LA / policy advisor",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "stating the Representative",
      "monitoring committee and Floor activities",
      "developing and advancing legislative initiatives",
      "reviewing constituent correspondence",
      "coordinating with the communications team and District O?",
      "representing the member and the o?",
      "other topics that may include energy, the environment, financial services, and other economic issues"
    ],
    "Qualifications": [
      "strong communication skills",
      "relevant policy experience",
      "positive and can-do attitude",
      "willingness to work in a fast-paced, collaborative environment"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The o?ice is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation.",
    "Cleaned_Text": "Representative Jill Tokuda (D-HI-02) seeks an experienced candidate for a Legislative Assistant / senior LA / policy advisor to lead her work on the House Agriculture Committee. This portfolio will consist of other topics that may include energy, the environment, financial services, and other economic issues.\nThe ideal candidate will have at least two years of substantive policy experience and work on the Hill. Responsibilities include sta?ing the Representative, monitoring committee and Floor activities, developing and advancing legislative initiatives, reviewing constituent correspondence, coordinating with the communications team and District O?ice, and representing the member and the o?ice at events and meetings.\nQualiﬁed candidates will have strong communication skills, relevant policy experience, a positive and can-do attitude, and a willingness to work in a fast-paced, collaborative environment.\nThis is not an entry-level position and will report to the legislative director.\nPlease send a cover letter, resume, two writing samples, and a list of three references in a single PDF to hawaii02jobs@gmail.com with “Agriculture Legislative Sta?er – [Last Name, First Name]” in the subject line.\nThe o?ice is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Diverse candidates are strongly encouraged to apply. Salary and title will be commensurate with experience and qualiﬁcations. Please mention any Hawai‘i ties in your cover letter. This position is based in Representative Tokuda’s Washington, DC o?ice.\nThe o?ice will conduct interviews with the most qualiﬁed candidates on a rolling basis. No calls or drop-ins, please.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-027-25",
    "Posting_Author": "StaO Assistant",
    "Congress_Number": null,
    "State_District": null,
    "Location": "",
    "Job_Function": null,
    "Title_Parsed": "",
    "Office_Type": "",
    "Responsibilities": [
      "answering phone calls",
      "greeting office visitors",
      "maintaining meeting room schedules",
      "general office administrative duties",
      "compiling materials for members and staff for use during committee activity",
      "executing operational support necessary for committee events including roundtables, hearings, and markups"
    ],
    "Qualifications": [
      "well-organized",
      "dependable",
      "hardworking",
      "demonstrated experience in high-pressure work environments",
      "previous Capitol Hill internship experience is required"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "Our office is an equal opportunity employer.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-026-25",
    "Posting_Author": "Congressman Greg Steube",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington D.C.",
    "Job_Function": "Communications Director",
    "Title_Parsed": "Communications Director",
    "Office_Type": "Congressional Office",
    "Responsibilities": [
      "Pitch and book local and national media regularly to ensure strong and consistent coverage.",
      "Develop and maintain strong relationships with local and national press to amplify the Congressman's message.",
      "Create daily social media content (including graphic design) and write compelling statements, press releases, media advisories, op-eds, radio ad scripts, and the weekly newsletter.",
      "Draft talking points, speeches, and key messaging for public appearances and interviews.",
      "Oversee and manage a large communications budget, covering areas such as mass mailers, digital ads, radio ads, text messages, surveys, and email campaigns.",
      "Produce, edit, and clip video content for use on social media and other platforms."
    ],
    "Qualifications": [
      "Proven experience in strategic communications, public relations, and/or media relations—ideally in a political, public affairs, or government context.",
      "Strong writing, editing, and verbal communication skills, with the ability to craft concise, persuasive messaging under tight deadlines.",
      "Solid understanding of social media platforms, digital advertising, and video content creation."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "digital advertising",
      "video content creation"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "MEM-026-25\nCOMMUNICATIONS DIRECTOR\nCongressman Greg Steube is seeking an experienced, highly motivated Communications Director to spearhead the office’s strategic communications efforts. This individual will manage all aspects of media relations, content creation, and digital strategy. The ideal candidate will be an exceptional writer, a strong strategic thinker, and a skilled manager who thrives in a fast-paced environment.\nKey Responsibilities:· Pitch and book local and national media regularly to ensure strong and consistent coverage.· Develop and maintain strong relationships with local and national press to amplify the Congressman’s message.· Create daily social media content (including graphic design) and write compelling statements, press releases, media advisories, op-eds, radio ad scripts, and the weekly newsletter.· Draft talking points, speeches, and key messaging for public appearances and interviews.· Oversee and manage a large communications budget, covering areas such as mass mailers, digital ads, radio ads, text messages, surveys, and email campaigns.· Produce, edit, and clip video content for use on social media and other platforms.\nThe Communications Director will also manage a Deputy Communications Director to help execute these tasks and ensure smooth operations across all communications initiatives.\nQualifications & Skills:· Proven experience in strategic communications, public relations, and/or media relations—ideally in a political, public affairs, or government context.· Strong writing, editing, and verbal communication skills, with the ability to craft concise, persuasive messaging under tight deadlines.· Solid understanding of social media platforms, digital advertising, and video content creation.·´ Strong organizational, time-management, and project management skills with the ability to juggle multiple priorities simultaneously.· Experience managing budgets and working with vendors, including for advertising and media buys.· A self-starter who can work independently and as part of a dynamic team.\nPreferred Qualifications:· Experience working in a Congressional office or political campaign.· Familiarity with video production tools (Adobe Premiere, Final Cut Pro, etc.).· Knowledge of local and national political landscape, with a particular understanding of Congressman Steube’s policy priorities and messaging.· Interested applicants should send resume and cover letter to: Floridarepublicanjob@gmail.com",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-025-25",
    "Posting_Author": "Not Provided",
    "Congress_Number": null,
    "State_District": "",
    "Location": "",
    "Job_Function": "",
    "Title_Parsed": "Press Secretary",
    "Office_Type": "",
    "Responsibilities": [
      "overseeing the preparation of all communications materials",
      "managing media relations",
      "developing contacts with members of the media and community leaders"
    ],
    "Qualifications": [],
    "Salary_Min": 0,
    "Salary_Max": 57440,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "The Office of Rep. French Hill (AR02) seeks to fill...",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-022-25",
    "Posting_Author": "Congresswoman Madeleine Dean",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "District Caseworker (Social Security and Medicare)",
    "Office_Type": null,
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": " Congresswoman Madeleine Dean (PA-04) is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-019-25",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "Press Assistant",
    "Office_Type": "Committee",
    "Responsibilities": [
      "Drafting press releases, social media posts, talking points, and the committee newsletter;",
      "Designing graphics for both social media and web content;",
      "Producing and editing videos and photos;",
      "Monitoring social media;",
      "Maintaining and updating press lists;",
      "Compiling daily press clips."
    ],
    "Qualifications": [
      "Excellent written and oral communication skills",
      "Proven ability to perform under pressure while juggling multiple tasks and sound political judgment"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "Our office deeply values the diversity of our employees and encourages candidates from diverse backgrounds to apply.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-015-25",
    "Posting_Author": "Congresswoman Summer L. Lee (D-Pittsburgh)",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Senior Legislative Assistant",
    "Office_Type": null,
    "Responsibilities": [
      "stating the Education and Workforce Committee",
      "handling a diverse portfolio of issues including science, space, and technology; financial services; small business; banking; insurance; taxes; telecommunications; international affairs; defense; veterans; and economic development.",
      "drafting remarks, talking points, and memos",
      "providing information to generate ideas and make decisions pertaining to press, mass mailings, and newsletters"
    ],
    "Qualifications": [
      "prior legislative experience",
      "demonstrated ability to translate policy ideas into successful legislative outcomes",
      "District or state ties are a plus"
    ],
    "Salary_Min": null,
    "Salary_Max": 78000,
    "Skills_Mentioned": [
      "Attention to Detail: Performs work thoroughly and accurately; acts conscientiously when attending to detail.",
      "Legislative Knowledge: Applies understanding of laws, legal codes, precedents, legislative practices and documents, Government regulations, Executive orders, Government organization and functions, and the democratic political process."
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "...",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-013-25",
    "Posting_Author": "Congresswoman Sarah McBride (DE-AL)",
    "Congress_Number": null,
    "State_District": "DE-AL",
    "Location": "Washington, D.C. office",
    "Job_Function": null,
    "Title_Parsed": "Legislative Assistant",
    "Office_Type": null,
    "Responsibilities": [
      "Collaborate with the Congresswoman...",
      "Research and track legislation...",
      "Draft policy memos...",
      "Brief the Congresswoman...",
      "Represent the Congresswoman..."
    ],
    "Qualifications": [
      "Legislative experience in a congressional office.",
      "Strong written and verbal communication skills.",
      "Ability to exercise sound judgment..."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "The office of Congresswoman Sarah McBride is an equal opportunity employer...",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-012-25",
    "Posting_Author": "Congresswoman Shontel M. Brown (OH-11)",
    "Congress_Number": null,
    "State_District": "OH-11",
    "Location": "Washington, D.C.",
    "Job_Function": null,
    "Title_Parsed": "Operations Assistant/Legislative Correspondent",
    "Office_Type": null,
    "Responsibilities": [
      "logging phone calls",
      "greeting visitors",
      "managing front office operations",
      "handling tour and flag requests",
      "assisting with drafting constituent correspondence",
      "managing the mail program",
      "overseeing the intern program",
      "providing administrative support to the team"
    ],
    "Qualifications": [
      "excellent writing and proofreading ability"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "Our office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, religion, national origin, age, gender identity, sexual orientation, marital or parental status, or disability.",
    "Cleaned_Text": "",
    "DW_NOMINATE": -0.4449999928474426,
    "LES": 0.08653660118579865
  },
  {
    "Post_ID": "MEM-011-25",
    "Posting_Author": "Congressman Greg Stanton",
    "Congress_Number": null,
    "State_District": "Mesa District",
    "Location": null,
    "Job_Function": "Outreach Coordinator",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Act as the representative for the Congressman within their area of responsibility including answering correspondence, occasionally speaking at events, meeting with constituents, and communicating with local stakeholders."
    ],
    "Qualifications": [
      "Strong written and oral communications skills and the ability to work e?ectively in a fast-paced environment",
      "Experience developing and maintaining relationships with constituents and community leaders"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Excellent organizational skills and careful attention to detail",
      "Valid driver’s license and access to a car",
      "Willingness to work evenings, weekends and irregular hours"
    ],
    "Equal_Opportunity_Information": "Congressman Stanton's o?ice is an equal opportunity employer and candidates from diverse and underrepresented backgrounds are strongly encouraged to apply.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-010-25",
    "Posting_Author": "Greg Stanton",
    "Congress_Number": 25,
    "State_District": "District O?ffice in Mesa, Arizona ( District O7)",
    "Location": "Mesa",
    "Job_Function": "Senior Outreach Coordinator",
    "Title_Parsed": "Senior Outreach Coordinator",
    "Office_Type": "",
    "Responsibilities": [
      "Work with the Chief of Sta?, District Director and Communications Director to plan, coordinate, and execute the o?ice’s outreach e?orts",
      "Develop, plan and execute meetings and events with local stakeholders for the Congressman",
      "Act as a representative for the Congressman, including answering correspondence...",
      "Serve as a liaison to local, state, and federal o?icials and other people or groups to form e?ective relationships for the Congressman"
    ],
    "Qualifications": [
      "Previous experience working for an elected o?icial or as an issue/community organizer",
      "Ability to work cooperatively and courteously with others",
      "Excellent organizational skills and careful attention to detail",
      "Valid driver’s license and access to a car",
      "Flexibility to work evenings, weekends and irregular hours"
    ],
    "Salary_Min": 0,
    "Salary_Max": 0,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Congressman Stanton’s o?ice is an equal opportunity employer and candidates from diverse and underrepresented backgrounds are strongly encouraged to apply",
    "Cleaned_Text": "Congressman Greg Stanton seeks a highly motivated, detail-oriented Senior Outreach Coordinator (full-time) in his District O\\u00ffice in Mesa, Arizona, to plan, manage, and execute the outreach e\\u00f0rts of the o\\u00fcce. An ideal candidate will have:\n• Strong written and oral communications skills and the ability to work e\\u00eective in a\nfast-paced environment\n• Expertise in developing and maintaining relationships with constituents and\ncommunity leaders\n• Ability to think strategically and creatively\n• Strong decision-making skills\n• Knowledge of issues and events in the district in which the Congressman has been\ninvolved as well as a good understanding of federal-level policy work\n• Understanding of the federal legislative process as well as federal agencies and departments",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-009-25",
    "Posting_Author": "Congressman Rob Wittman (VA-01)",
    "Congress_Number": null,
    "State_District": "VA-01",
    "Location": "The O?ice of Congressman Rob Wittman (VA-01)",
    "Job_Function": "Digital Media Manager",
    "Title_Parsed": "Digital Media Manager – Congressman Rob Wittman (VA-01)",
    "Office_Type": "Congressional office",
    "Responsibilities": [
      "drafting press releases and talking points",
      "writing email newsletters for targeted constituent coalitions",
      "promoting the congressman’s district events and engagements",
      "maintaining the communications content calendar",
      "overseeing website management and updates",
      "branding through graphic design and video/audio editing",
      "managing social media accounts and analyzing their performance metrics",
      "maintaining the Member’s photo and video database"
    ],
    "Qualifications": [
      "1-2 years of experience",
      "strong candidate",
      "familiar with social media, the legislative process, website maintenance, as well as photography, graphic design, and video editing.",
      "Excellent writing and organization skills are required."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "social media",
      "legislative process",
      "website maintenance",
      "photography",
      "graphic design",
      "video editing"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "MEM-009-25\nDigital Media Manager – Congressman Rob Wittman (VA-01)\nThe O?ice of Congressman Rob Wittman (VA-01) is seeking a digital media manager.\nThis position is responsible for developing a proactive constituent communications strategy and plan.\nPrimary responsibilities include: drafting press releases and talking points,\nwriting email newsletters for targeted constituent coalitions,\npromoting the congressman’s district events and engagements,\nmaintaining the communications content calendar,\noverseeing website management and updates,\nbranding through graphic design and video/audio editing,\nmanningaging social media accounts and analyzing their performance metrics,\ndmaintaining the Member’s photo and video database.\nThey will work with the communications director to ünd new ways to grow the congressman’s following, increase his name ID in the district, and maintain synergy across communications materials.\nThis is not an entry-level position. A strong candidate will have 1-2 years of experience and\nwill be a creative, proactive communicator familiar with social media, the legislative process,\nwebsite maintenance, as well as photography, graphic design, and video editing.\nExcellent writing and organization skills are required. An ability to multitask and work under tight deadlines is necessary.\nCandidates must have previous congressional or political communications experience; ties to Virginia are helpful but not required.\nInterested applicants should email a resume and two writing samples to\nJulianne.Heberlein@mail.house.gov with “Digital Media Manager” in the subject line.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-008-25",
    "Posting_Author": "Congressman Mike Flood",
    "Congress_Number": null,
    "State_District": "NE-01",
    "Location": "Norfolk, NE or willingness to relocate",
    "Job_Function": null,
    "Title_Parsed": "District Special Assistant",
    "Office_Type": "Special Assistant",
    "Responsibilities": [
      "Transportation of the Member for their o?icial duties.",
      "Deliver and pickup materials for the o?ice, including letters, packages, and documents from other government agencies.",
      "Working with the Scheduler to be aware of the Member’s schedule.",
      "Running errands and assisting the District Director with supplies and other misc. administrative matters.",
      "Assisting in sorting and delivering mail.",
      "Sta?ing the Member at various meetings and events.",
      "Serving as a personal aide to the Member, tending to various needs as they arise while he is in the district.",
      "Assisting the Field Reps with events, meetings, and correspondence as necessary.",
      "Assisting with casework as necessary."
    ],
    "Qualifications": [
      "Located in Norfolk, NE or willingness to relocate.",
      "Regular, predictable and punctual attendance at assigned locations required for performance of duties.",
      "Ability to communicate e?ectively with the Member and o?ice sta?, Members and representatives from other o?ices, outside organizations, and others.",
      "Ability to work most weekends as the Member’s schedule dictates, with less work expected on weekdays when the Member is in DC.",
      "Ability to handle di?icult and sometimes tense interactions with members of the public, including constituents, with tact while also prioritizing the well-being of the Member."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Must possess a valid driver’s license",
      "Regularly lifts and moves luggage, books, ﬁles, documents, and other o?ice materials.",
      "Must be able to prioritize and perform duties under pressure in a fast-paced environment.",
      "Regularly use typical o?ice equipment, software programs, and methods of communication, including, for example, a computer, email, telephone, smartphone, photocopier, fax machine, etc."
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-530-24",
    "Posting_Author": "",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC.",
    "Job_Function": "",
    "Title_Parsed": "Research Assistant, Subcommittee on Disability Assistance and Memorial A?airs,",
    "Office_Type": "",
    "Responsibilities": [
      "Provide administrative and research support to Subcommittee sta?",
      "Maintain Subcommittee archives of activities, including Member and stakeholder engagements.",
      "Travel and conduct oversight visits at agency locations.",
      "Draft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee’s jurisdiction.",
      "Subcommittee casework as assigned.",
      "Answer telephone and respond to caller inquiries.",
      "Keep abreast of emails, including Member inquiries and agency notiﬁcations.",
      "Organize and maintain Subcommittee electronic records, including meeting notes, agency reports, other documents.",
      "Participate in sta?-level discussions on legislation being considered; draft policy memoranda as assigned.",
      "Assist with due diligence being performed as part of the Subcommittee’s oversight duties, including requesting information from agencies on matters within the Subcommittee jurisdiction.",
      "Assist with hearing preparation and coordination of hearings, including drafting memoranda and remarks for Chairman.",
      "Attend meetings with agencies, veteran service organizations, and other parties, and maintain notes on such meetings.",
      "Assist with the drafting of memoranda for the full Committee and Subcommittee Chairman on matters within the jurisdiction of the Subcommittee.",
      "Review the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to Subcommittee Members and sta?).",
      "Assist with developing policy recommendations and serve as a resource for Members both on and o? Committee.",
      "Responsible for all other duties assigned by the full Committee Chairman, Subcommittee Chairman, full Committee Sta? Director or Deputy Sta? Director, and Subcommittee Sta? Director, and assisting other Committee sta?, as needed."
    ],
    "Qualifications": [
      "Bachelor of Arts or Science.",
      "Strong research skills.",
      "Strong writing and editing skills.",
      "Strong Microsoft O?ice proﬁciency, including expertise in Word and the ability to use Excel.",
      "Strong organizational skills.",
      "Strong verbal communication.",
      "Excellent attention to detail.",
      "Excellent listening skills.",
      "Strong ability to manage ﬂuctuating workloads and juggle and prioritize tasks, including managing short-, medium-, and long-term tasks.",
      "Team oriented.",
      "Excellent ability to work well under pressure and time constraints.",
      "Problem solving and analytical skills are a plus.",
      "Potential to work independently."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Strong research skills.",
      "Legal research skills (e.g., LexisNexis)",
      "Strong writing and editing skills.",
      "Strong Microsoft O?ice proﬁciency, including expertise in Word and the ability to use Excel.",
      "Strong organizational skills.",
      "Strong verbal communication.",
      "Excellent attention to detail.",
      "Excellent listening skills.",
      "Strong ability to manage ﬂuctuating workloads and juggle and prioritize tasks,",
      "Team oriented.",
      "Excellent ability to work well under pressure and time constraints.",
      "Problem solving and analytical skills are a plus.",
      "Potential to work independently."
    ],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-523-24",
    "Posting_Author": "The Democratic Staff of the House Budget Committee and Ranking Member Brendan F.",
    "Congress_Number": null,
    "State_District": "PA-02",
    "Location": "Washington D.C.",
    "Job_Function": "Digital Assistant supporting digital communications and public engagement efforts",
    "Title_Parsed": "Digital Assistant",
    "Office_Type": "committee office and personal office",
    "Responsibilities": [
      "creating and scheduling content for social media platforms",
      "maintaining the committee’s website",
      "producing multimedia materials (graphics, videos, and infographics)",
      "monitoring digital analytics to optimize outreach"
    ],
    "Qualifications": null,
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "The office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status. Candidates with diverse backgrounds, women, people of color, and LGBTQIA+ candidates are strongly encouraged to apply.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-516-24",
    "Posting_Author": "Congresswoman Jennifer McClellan (VA-04)",
    "Congress_Number": null,
    "State_District": "VA-04",
    "Location": "Washington, D.C.",
    "Job_Function": "Communications Director",
    "Title_Parsed": null,
    "Office_Type": "Senior staff",
    "Responsibilities": [
      "managing all aspects of the Congresswoman's communications strategy",
      "culminating and managing relationships with both national and local press",
      "fielding all press inquiries",
      "proactively pitching stories and booking the Member for local and national TV",
      "drafting press releases, media advisories, and op-eds",
      "collaborating with Legislative and District teams to coordinate press rollouts",
      "managing a robust franked communications budget",
      "overseeing a rapid social media program",
      "overseeing and managing a communications team"
    ],
    "Qualifications": [
      "several years of demonstrated communications experience",
      "on-the-record experience, strong relationships with bookers and producers",
      "a broad network of reporter relationships",
      "strong writing and interpersonal skills",
      "good political instincts",
      "Capitol Hill experience required",
      "Virginia ties are a plus"
    ],
    "Salary_Min": null,
    "Salary_Max": 105000,
    "Skills_Mentioned": [
      "communications strategy",
      "earned media",
      "digital media",
      "franked communications",
      "press inquiries",
      "story pitching",
      "social media",
      "writing and interpersonal skills"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-476-24",
    "Posting_Author": "Congressman Dan Crenshaw (R-TX-02)",
    "Congress_Number": null,
    "State_District": "TX-02",
    "Location": "Washington, D.C. o?ice",
    "Job_Function": "Legislative Assistant",
    "Title_Parsed": "Legislative Assistant",
    "Office_Type": null,
    "Responsibilities": [
      "Communicating clearly and consistently with the Member, Legislative Director, and legislative, communications, and district teams on legislative updates",
      "Preparing and sta?ing the Member for meetings, and assisting in the drafting of remarks, as needed",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas"
    ],
    "Qualifications": [
      "strong written and oral communications skills",
      "detail-oriented",
      "organized",
      "creative"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  }
]