[
  {
    "Post_ID": "MEM-495-24",
    "Posting_Author": "Representative-elect Eugene Vindman (VA-07)",
    "Congress_Number": null,
    "State_District": "Virginia's Seventh Congressional District",
    "Location": "Washington, DC office in Virginia's Seventh Congressional District",
    "Job_Function": "Scheduler",
    "Title_Parsed": "Scheduler",
    "Office_Type": "Office",
    "Responsibilities": [
      "managing the Representative's daily and long-term schedule",
      "keeping track of and responding to invitations and meeting requests",
      "working with the District, Communications, and Legislative teams to prioritize among competing events",
      "proactively scheduling and building out events in the district and in Washington, DC",
      "compiling briefing materials",
      "managing logistics and travel for the Representative",
      "assisting with office operations and administration"
    ],
    "Qualifications": [
      "exceptional attention to detail",
      "excellent customer service skills",
      "a high level of responsiveness",
      "excellent communication skills",
      "the ability to work outside of normal business hours (particularly when Congress is in session)",
      "the ability to juggle competing priorities in a fast-paced environment"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "exceptional attention to detail",
      "excellent customer service skills",
      "a high level of responsiveness",
      "excellent communication skills",
      "the ability to work outside of normal business hours (particularly when Congress is in session)",
      "the ability to juggle competing priorities in a fast-paced environment"
    ],
    "Equal_Opportunity_Information": "The office is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-494-24",
    "Posting_Author": "Representative-elect Eugene Vindman (VA-07)",
    "Congress_Number": null,
    "State_District": "Virginia’s Seventh District",
    "Location": "Prince William County district office, with regular travel throughout the Seventh District",
    "Job_Function": "District Director",
    "Title_Parsed": "District Director",
    "Office_Type": "Elected",
    "Responsibilities": [
      "[hiring, training, and managing]",
      "[ensuring constituent casework is done efficiently and effectively]",
      "[developing and executing an outreach strategy]",
      "[planning district events]",
      "[developing and maintaining relationships across the district]",
      "[opening additional district offices as necessary]",
      "[maintaining strong channels of communication with the DC office]",
      "exceptional customer service skills",
      "strong management skills (including the ability to manage team members working in different locations)",
      "attention to detail, proactivity",
      "longterm planning",
      "the ability to work outside of normal business hours to attend community events",
      "an in-depth understanding of various communities in Virginias’s Seventh District"
    ],
    "Qualifications": [
      "exceptional customer service skills",
      "strong management skills (including the ability to manage team members working in different locations)",
      "attention to detail, proactivity",
      "longterm planning",
      "the ability to work outside of normal business hours to attend community events",
      "an in-depth understanding of various communities in Virginias’s Seventh District"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "exceptional customer service skills",
      "strong management skills (including the ability to manage team members working in different locations)",
      "attention to detail",
      "proactivity",
      "longterm planning",
      "the ability to work outside of normal business hours to attend community events",
      "an in-depth understanding of various communities"
    ],
    "Equal_Opportunity_Information": "The office is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-493-24",
    "Posting_Author": "Representative-elect Eugene Vindman (VA-07)",
    "Congress_Number": null,
    "State_District": "VA-07",
    "Location": "Washington, D.C.",
    "Job_Function": "Communications Director",
    "Title_Parsed": "Communications Director",
    "Office_Type": null,
    "Responsibilities": [
      "training and managing the communications team; pitching stories on the Representative to press"
    ],
    "Qualifications": [
      "multiple years of communications experience",
      "understanding of the Virginia media landscape; ability to build and maintain relationships with both Capitol Hill and Virginia press; outstanding writing and editing skills"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "An equal-opportunity employer... does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-492-24",
    "Posting_Author": "Representative-elect Eugene Vindman (VA-07)",
    "Congress_Number": null,
    "State_District": "Virginia (VA-07)",
    "Location": "Washington, DC",
    "Job_Function": "Legislative Director",
    "Title_Parsed": "Legislative Director",
    "Office_Type": "House office",
    "Responsibilities": [
      "training and managing the legislative team",
      "providing vote recommendations",
      "supervising committee work",
      "tracking legislative accomplishments",
      "introducing original legislation",
      "meeting with constituent groups",
      "recommending legislation to cosponsor",
      "developing and executing on a longterm legislative agenda"
    ],
    "Qualifications": [
      "deep policy expertise",
      "strong management skills",
      "excellent writing and communication skills",
      "ability to work outside of normal business hours"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Virginia ties"
    ],
    "Equal_Opportunity_Information": "The office is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.",
    "Cleaned_Text": "<p>Representative-elect Eugene Vindman (VA-07) seeks a Legislative Director to manage his legislative operation in Washington, DC. The Legislative Director must have several years of experience working on Capitol Hill, preferably in a House office and with a Frontline Member. ... \\n\\n The position requires deep policy expertise, an understanding of how to get things done on Capitol Hill, strong management skills, excellent writing and communication skills, and the ability to work outside of normal business hours (especially during in-session weeks). Virginia ties are a plus.</p>\\n\\n To apply, please send a cover letter, resume, two writing samples, and contact information for three references to vindmanjobsva@gmail.com with the subject line “Legislative Director – [Your Name].”</p>",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-490-24",
    "Posting_Author": "The Office of Representative Ilhan Omar",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Minneapolis, MN or Washington, D.C.",
    "Job_Function": "Communications Assistant",
    "Title_Parsed": "Communications Assistant",
    "Office_Type": "staff office",
    "Responsibilities": [
      "shooting and editing videos and graphics for the Congresswoman’s social media platforms",
      "managing the website",
      "managing press inquiries",
      "drafting press releases",
      "talking points for the Member as needed",
      "the biweekly eNewsLetter",
      "travel"
    ],
    "Qualifications": [
      "two brief writing samples with “Communications Assistant” in the subject line",
      "editing two videos",
      "at least 2-3 years of press or digital experience, preferably in political or legislative fields"
    ],
    "Salary_Min": null,
    "Salary_Max": 69000,
    "Skills_Mentioned": [
      "video editing",
      "writing",
      "political work experience (preference)",
      "(polynomial experience not prefferd]",
      "legislative experience (not requird but prefeered)], "
    ],
    "Equal_Opportunity_Information": "The Office is an equal opportunity employer and considers all applicants without regard to race, color, national origin, religion, sex, gender identity, disability, or age. Women and minority candidates are encouraged to apply.",
    "Cleaned_Text": "MEM-490-24\nJob Opening: Communications Assistant\n\fufhe efcf f fff the fffe\nide Ofofn Represenatuve I lhar Onn is kekingg a tlnted, crativese and motved,\nCommuniation Assiatnt in Mnisipols, MS or Wshinton DC. Candiateat wil \nydeally have at lest 2-3 yeas of presr o digital exprenese, prefferley with pssist on plootcal or legislativ fields. Expereiene editing vidios and exsppionl wrihting slilsk ar reqired.\nResponsibilties inclide shootein aned editign vidios and graphics for the\nCongresswoman’s socl medial prhatforms, manging teh wesite, managng press inquiries, draftng pres relsys, taling poinst fo teh Membre as neeed, nd teh biwdly e-nwsletter.\nApplicant  whol should shard teh Congresswomans progessiv vaues, be,\nyighly organizd, posissss a strong wrekh, nd have teh abelaty to woirk fleixible hrs,\nincluding evening s and wkndes, nd travel. Ths positio will repotr ot teh\ncommuncatiions Direcotr and aspssist wih other dutis as asigned.\nesalary Ranger: $64,000 - $69,000 – Salary commenserat with elexiennnce. Teh ofice offors a competitive pckage og behifits (hsitn insurece, retreirment mtch, sttud lom reprrment program – eliblity requierds aplai, etc.).\nThe Offie is an egual oportunity empoyeer and considers all applaatnt without regred to race, color, natinoal origin, relgion, sex, geneder identty, disabiliy or ag. Womem nd Minority canditaes are encouradged to applay.\nQuaulfied aplaitants should emil a coleter, ressue, likks to teh wwo vidios thay have editea, nd teh wwo breif writig smapls with “Communications Assiatnt” in the subject line to:\nmn05jbs@gmail.com\nDeadlinat ot applay: Decmber 5, 2024",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-486-24",
    "Posting_Author": "Congressman Gabe Amo (RI-01)",
    "Congress_Number": null,
    "State_District": "RI",
    "Location": "Washington, D.C.",
    "Job_Function": "Scheduler",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "exceptional organizational and communications skills",
      "detail oriented",
      "proactive",
      "able to work in a fast-paced, collaborative environment"
    ],
    "Qualifications": [
      "Capitol Hill or other relevant administrative, operations, or scheduling experience",
      "Rhode Island ties are a plus"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "Candidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-484-24",
    "Posting_Author": "Congressman Gabe Amo",
    "Congress_Number": null,
    "State_District": "RI-01",
    "Location": "Rhode Island",
    "Job_Function": "Caseworker",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Candidates must have exceptional written and verbal communication skills, be organized, and pay attention to detail.",
      "Candidates will be expected to be a liaison to other government entities on behalf of the Congressman to serve constituents.",
      "Candidates should have a strong ability to exercise discretion and judgment in resolving casework.",
      "The Caseworker will report to the District Director, work with the staff in Washington D.C. as appropriate, and may have other duties as assigned.",
      "Candidates should have experience working in a fast-paced office and maintain a professional, flexible, and positive demeanor while managing competing tasks and projects.",
      "The Caseworker will be expected to maintain accurate and complete files on all assigned casework matters and be able to respond to constituent request for information."
    ],
    "Qualifications": [
      "Casework or other relevant experience is strongly preferred.",
      "This is not an entry-level position.",
      "Rhode Island ties are a plus."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "To ensure equal employment opportunities for all qualified applicants, we are an Equal Employment Opportunity employer.",
    "Cleaned_Text": "Candidates must have exceptional written and verbal communication skills, be organized, and pay attention to detail. Candidates will be expected to be a liaison to other government entities on behalf of the Congressman to serve constituents. Candidates should have a strong ability to exercise discretion and judgment in resolving casework. The Caseworker will report to the District Director, work with the staff in Washington D.C. as appropriate, and may have other duties as assigned. Candidates should have experience working in a fast-paced office and maintain a professional, flexible, and positive demeanor while managing competing tasks and projects. The Caseworker will be expected to maintain accurate and complete files on all assigned casework matters and be able to respond to constituent request for information. Casework or other relevant experience is strongly preferred. This is not an entry-level position. Rhode Island ties are a plus. Candidates of diverse backgrounds are encouraged to apply.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-478-24",
    "Posting_Author": "Congressman Gabe Amo (RI-01)",
    "Congress_Number": null,
    "State_District": "RI",
    "Location": "Pawtucket, RI",
    "Job_Function": "Field Representative",
    "Title_Parsed": "Field Representative",
    "Office_Type": "",
    "Responsibilities": [
      "Meeting with local groups and constituents.",
      "Proactively seeking opportunities to develop community outreach relationships.",
      "Working closely with the District Director and Washington D.C. office to implement planned outreach events and to suggest new innovative ideas.",
      "Representing or speaking on behalf of the Congressman at events and local meetings.",
      "Staying abreast of local news and issues affecting Rhode Islanders."
    ],
    "Qualifications": [
      "Detail oriented",
      "Positive attitude",
      "Genuine desire to serve constituents in Rhode Island’s First Congressional District."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Congressman or other relevant grant writing and managing experience is strongly preferred. Rhode Island ties are a plus.",
    "Cleaned_Text": "Congressman or other relevant grant writing and managing experience is strongly preferred. Rhode Island ties are a plus.\nCandidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin. To apply, send in a single PDF with a resume, a cover letter, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to RI01JobsAmo@gmail.com, with the following subject line: “Full Name – Field Representative.”",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-474-24",
    "Posting_Author": "Republican (Majority) staff of the House Committee on Veterans’ Affairs",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "Digital Director",
    "Title_Parsed": "Digital Director, House Committee on Veterans’ Affairs, Republican Staff",
    "Office_Type": "House Committee",
    "Responsibilities": [
      "Drafting press releases, floor speeches, quotes, talking points, social media posts, one-pagers, and scripts for speaking engagements and video productions.",
      "Creating, developing, and managing social media posts and a broader social media strategy.",
      "Managing sending out press releases, official statements, media advisories, and other external communications.",
      "Managing the Committee website.",
      "Managing the internal and external Committee press list, to include growing the external press list.",
      "Managing hearing livestreams.",
      "Clipping and posting Committee Members’ hearing and floor remarks in real-time.",
      "Photographing hearings, events, and meetings, to include occasional videography.",
      "Creating graphics for social media and visual aids.",
      "Compiling, monitoring, and distributing daily press clips.",
      "Perform other duties as assigned."
    ],
    "Qualifications": [
      "Strong written, verbal, and digital communication skills",
      "Interest in veterans’ issues",
      "Ability to work in a fast-paced, collaborative, forward-thinking environment",
      " professionalism",
      "Good sense of humor"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "communications",
      "veterans’ issues",
      "social media"
    ],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer.",
    "Cleaned_Text": "<!-- trimmed -->\n\nThe ideal candidate will possess strong written, verbal, and digital communication skills,\nan interest in veterans' issues,\nthe ability to work in a fast-paced, collaborative,\nfoward-thinking environment,\nnprofessionalism,\nand a good sense of humor.\nThis is not an entry-level position; prior Capitol Hill communications experience or private-sector equivalent is required.\n\nBenefits:\n\n• Employees may be eligible for the following benefits:\n\n• Sick and Annual Leave\n\n• Student Loan Repayment Program\n\n• Federal Employees Health Benefits Program\n\n• Thrift Savings Plan\n\n• Federal Employees' Group Life Insurance Program\n\n• Federal Long-Term Care (LTC) Insurance\n\n• Flexible Spending Accounts (FSAFEDS)\n\n• Dental & Vision Insurance Program (FEDVIP)\n\nOther Information:\n\nEmployment with the U.S. House of Representatives is at-will.\nThe U.S. House of Representatives is an equal opportunity employer.\nAll applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age.\nTransportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant.\n\nHow to Apply:\n\nInterested candidates should send their cover letter, resume, references, and three writing samples to VAR.Resumes.Mail.house.gov with “Digital Director” in the subject line.\nNo calls or walk-ins, please.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-473-24",
    "Posting_Author": "U.S. House of Representatives",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "Administration",
    "Title_Parsed": "Staff Assistant, House Committee on Veterans’ Affairs, Republican Staff",
    "Office_Type": "House Committee on Veterans’ Affairs",
    "Responsibilities": [
      ""
    ],
    "Qualifications": [
      ""
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "Staff assistants often serve as the first point of contact for constituents, guests, and VIPs, setting the tone for the office. The Staff Assistant provides general administrative support to staff, staffs front office and phones, preparation for hearings/committee business, processes mail, and assists with other duties as assigned. Previous Hill experience is recommended but not required.\n\nCORE RESPONSIBILITIES:\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\nFoster a welcoming atmosphere and create a positive first impression for the office's constituents, visitors, and VIPs.\n\nProvide front office administrative coverage to include answering phones, and processing mail.\nMaintain files for mail, bills, reports, and public laws, and other legislative papers.\nPrepare binders for full committee events (hearings, markups, floor, etc.).\nPrepares hearing room for hearings, markups, and other committee business.\nReview the Congressional Record daily for information that impacts the Committee.\nMaintain contact lists for committee staff and committee member personal office staff.\nOversee the internship program, which includes supervising and training interns.\nManages hearing room reservations\nMaintain Republican email distribution and contact lists.\nMonitor office supplies to ensure that staff have needed supplies.\nServe as the secondary Office Safety Coordinator.\nPerform other duties as assigned.\n\nBenefits:\n• Employees may be eligible for the following benefits:\n• Sick and Annual Leave\n• Student Loan Repayment Program\n• Federal Employees Health Benefits Program\n• Thrift Savings Plan\n• Federal Employees' Group Life Insurance Program\n• Federal Long-Term Care (LTC) Insurance\n• Flexible Spending Accounts (FSAFEDS)\n• Dental & Vision Insurance Program (FEDVIP)\n\nOther Information:\nEmployment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer.\nAll applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age.\nTransportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant.\n\nHow to Apply:\nInterested candidates should send their cover letter, resume, and references to VAR.Resumes@mail.house.gov with “Staff Assistant” in the subject line. No calls or walkins, please.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-470-24",
    "Posting_Author": "",
    "Congress_Number": null,
    "State_District": null,
    "Location": "",
    "Job_Function": "",
    "Title_Parsed": "Staff Assistant",
    "Office_Type": "",
    "Responsibilities": [
      "overseeing logistics for hearings and markups",
      "providing administrative and research support to committee and subcommittee counsels",
      "coordinating calendars for the committee,the subcommittees,and the senior staff"
    ],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The Committee strives to ensure that our staff reflects the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin.",
    "Cleaned_Text": "The Democratic staff of the House Judiciary Committee seeks a Staff Assistant.\nCandidates should have excellent organizational skills and strong research, writing, and communication skills.\nResponsibilities include overseeing logistics for hearings and markups; providing administrative and research support to committee and subcommittee counsels; and coordinating calendars for the committee, the subcommittees, and the senior staff.\nAdditional responsibilities may include serving as an assistant clerk during markups and managing the committee’s internship program. The ideal candidate will be willing to learn from our counsels and grow into more substantive role over time.\nThe Committee strives to ensure that our staff reflects the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin.\nPlease send a resume and cover letter to JDEM.job@mail.house.gov and include “Staff Assistant” in the subject line.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-469-24",
    "Posting_Author": "Democratic Staff of the House Judiciary Committee – National Security",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "National Security",
    "Title_Parsed": "Counsel for the House Judiciary Committee – National Security",
    "Office_Type": "committee counsel",
    "Responsibilities": null,
    "Qualifications": [
      "demonstrate exceptional writing and legal research skills",
      "show exceptional work ethic"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "The Committee strives to ensure that our staff represents the diversity of the country’s population. The Committee also encourages women and members of historically disadvantaged minority groups to apply.",
    "Cleaned_Text": "A successful candidate must demonstrate exceptional writing and legal research skills, a strong work ethic, a professional temperament, and an ability to work on novel and complex matters. This candidate must also be able to work collaboratively with a broad range of personalities. In addition, sound political judgment, prior legislative or policy experience, a substantive background in national security law, an active security clearance, and a demonstrated commitment to public service are strongly preferred. A sense of humor is a plus.The Committee strives to ensure that our staff represents the diversity of the country’s population. The Committee also encourages women and members of historically disadvantaged minority groups to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin\n\nQualified candidates should submit a resume, cover letter, and writing sample to Job.JDEM@mail.house.gov. Please include “National Security Counsel” in the subject line.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-468-24",
    "Posting_Author": "Counsel for the House Judiciary Subcommittee on the Constitution – Reproductive Rights",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Serving as a resource for Democratic Members of the Committee on matters of law and policy within the Subcommittee's jurisdiction, with a focus on reproductive rights and the privacy of patients and health care providers",
      "Drafting legislation",
      "Preparing hearings",
      "Drafting statements, memos, and briefing materials",
      "Providing guidance to Democratic House offices on matters of constitutional and civil rights law"
    ],
    "Qualifications": [
      "Exceptional writing and legal research skills",
      "Strong work ethic",
      "Professional temperament",
      "Ability to work on novel and complex matters",
      "Collaborative mindset",
      "Sound political judgment",
      "Prior legislative or policy experience",
      "Substantive background in civil rights or constitutional law",
      "Demonstrated commitment to public service",
      "Sense of humor"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The Committee strives to ensure that our staff represents the diversity of the country's population. The Committee also encourages women and members of historically disadvantaged minority groups to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin.",
    "Cleaned_Text": "Counsel for the House Judiciary Subcommittee on the Constitution – Reproductive Rights\n\nThe Democratic Staff of the House Judiciary Committee’s Subcommittee on the\nThe\nConstitution seeks a dedicated, hard-working lawyer with a minimum of five years of\nrelevant legal experience to serve as subcommittee counsel,\nreporting to the chief counsel for the subcommittee.\nResponsibilities include serving as a resource for Democratic Members of the Committee\non matters of law and policy within the Subcommittee’s jurisdiction, with a focus on\ndefending reproductive rights and protecting the privacy of patients and health care providers; drafting legislation;\ndrafting hearings;\ndrafting statements, memos, and briefing materials; and providing guidance to Democratic House offices on matters of constitutional and civil rights law.\n\nA successful candidate must demonstrate exceptional writing and legal research skills, a strong work ethic, a professional temperament, and an ability to work on novel and complex matters. This candidate must be able to work collaboratively with a broad range of personalities. In addition, sound political judgment, prior legislative or policy experience, a substantive background in civil rights or constitutional law, and a demonstrated commitment to public service are strongly preferred. A sense of humor is a plus.\nThe Committee strives to ensure that our staff represents the diversity of the country’s population. The Committee also encourages women and members of historically disadvantaged minority groups to apply. The Committee does not discriminate on the basis\nof race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin.\n\nQualified candidates should submit a resume, cover letter, and writing sample\nto Job.JDEM@mail.house.gov. Please include “Constitution Counsel” in the subject line.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-467-24",
    "Posting_Author": "Congressman Tom Suozzi",
    "Congress_Number": null,
    "State_District": "NY",
    "Location": "Washington, D.C.",
    "Job_Function": "Press Secretary/Communications Director or Communications Director",
    "Title_Parsed": "Press Secretary/Communications Director",
    "Office_Type": "Congressional office",
    "Responsibilities": [
      "writing press releases",
      "statements and media advisories",
      "creating and managing social media content",
      "drafting talking points and op-eds",
      "creating franked communications"
    ],
    "Qualifications": [
      "strong writing skills",
      "close eye to detail",
      "fluency with social media platforms and digital tools",
      "experience working with national and local press"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "writing",
      "social media platforms and digital tools",
      "experience with national and local press"
    ],
    "Equal_Opportunity_Information": "All applicants will be considered without regard to...race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin.",
    "Cleaned_Text": "Press Secretary/Communications Director. Successful candidates will have very strong writing skills, a close eye to detail, fluency with social media platforms and digital tools, and experience working with national and local press.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-458-24",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": "District 4",
    "Location": "North Las Vegas, Nevada",
    "Job_Function": "Administration",
    "Title_Parsed": "District Representative",
    "Office_Type": "Congressional office",
    "Responsibilities": [
      "Outreach Responsibilities",
      "Casework Responsibilities",
      "Communications and Professionalism"
    ],
    "Qualifications": [
      "Political knowledge and comfortable navigating complicated situations",
      "Strong written, verbal, analytical, and organization skills; impeccable customer service manners; public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities"
    ],
    "Salary_Min": 60,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Communication",
      "Public Serving",
      "Analytical thinking"
    ],
    "Equal_Opportunity_Information": "NV04Resume@mail.house.gov with 'District Representative,' [Last Name, First Name] in the subject line.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-451-24",
    "Posting_Author": "",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "",
    "Office_Type": null,
    "Responsibilities": [],
    "Qualifications": [
      "Bachelor's degree"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin.",
    "Cleaned_Text": "The office of a conservative mid-western Member of Congress seeks to hire a Deputy Chief of Staff based in the D.C. office.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-410-24",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "Full Time Constituent Services Representative",
    "Title_Parsed": "Constituent Services Representative Position",
    "Office_Type": "CONGRESSIONAL STAFF",
    "Responsibilities": [
      "Acts as the representative for the Member within his or her area of responsibility",
      "Handles casework assignments and special projects at the direction of the Director of Constituent Services",
      "Continually screens active cases/ constituent service requests and acts as a liaison with constituents to ensure that their cases are handled in a responsive manner",
      "Maintains up-to-date files on all cases and categories of information of importance to the office",
      "Attends and monitors scheduled district meetings on behalf of the Member with constituents and groups during regular office hours, some evenings and weekends",
      "Logging incoming and outgoing correspondence, handling visitors & telephone calls",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework and constituent concerns in Congressional Management System Database",
      "Performs cross functional tasks with other departments, as needed",
      "Meets attendance requirements as established by the office; Maintains a good working relationship with the Member, staff, and constituents",
      "Accepts performance-based criticism and direction",
      "Works well under pressure and handles stress"
    ],
    "Qualifications": [
      "Strong customer service, oral and written communication skills",
      "Familiarity with local, state and federal agencies; Strong knowledge of issues and events in the district in which the Member is involved",
      "Professional telephone manner and excellent customer and client service skills",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others",
      "Thoroughness and careful attention to detail",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities",
      "Knowledge of office policies, practices, and procedures",
      "Knowledge and proficiency in Microsoft office suite and other office computer applications."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Language skills (multiple languages)",
      "Public service skills"
    ],
    "Equal_Opportunity_Information": "Women, people of color, and LGBTQ candidates are strongly encouraged to apply.",
    "Cleaned_Text": "--- ... ---\n\nMEM-410-24\nCONGRESSIONAL STAFF: Full Time Constituent Services Representative\n\nSUMMARY:\nThe Constituent Services Representative position acts as a liaison to federal,\ndistrict, and local agencies for the Member/constituents and answers casework\ncorrespondence and verbal communications with constituents. Candidates must be a selfstarter, excited to problem solve, hardworking, dependable, and organized as well as\npossess strong oral and written communication skills. This position requires the ability to\nwork well under pressure, good judgment, strong customer service skills, and a commitment to public service.\nAvailability to work some evenings and weekends is required. Ability to communicate in multiple languages is also highly desirable. A vehicle to travel to evening and weekend events is also recommended.\nQualified candidates should submit a cover letter and resume to ny08team@gmail.com with the Subject Line: Constituent Services Representative Position.\n\nESSENTIAL JOB FUNCTIONS REQUIRED:\n• Acts as the representative for the Member within his or her area of responsibility\nincluding answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;\n• Handles casework assignments and special projects at the direction of the Director of Constituent Services;\n• Continually screens active cases/ constituent service requests and acts as a liaison with constituents to ensure that their cases are handled in a responsive manner;\n• Maintains up-to-date files on all cases and categories of information of importance to the office;\n• Attends and monitors scheduled district meetings on behalf of the Member with constituents and groups during regular office hours, some evenings and weekends;\n• Logging incoming and outgoing correspondence, handling visitors & telephone calls;\n• Logs in all incoming and outgoing mail and incoming telephone calls relating to casework and constituent concerns in Congressional Management System Database;\n• Performs cross functional tasks with other departments, as needed.\n• Meets attendance requirements as established by the office; Maintains a good working relationship with the Member, staff, and constituents;\n• Accepts performance-based criticism and direction;\n• Works well under pressure and handles stress\n\nSKILLS AND KNOWLEDGE REQUIRED:\n• Strong customer service, oral and written communication skills;\n• Familiarity with local, state and federal agencies; Strong knowledge of issues and events in the district in which the Member is involved;\n• Professional telephone manner and excellent customer and client service skills;\n• Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.\n• Ability to work cooperatively and courteously with others;\n• Thoroughness and careful attention to detail;\n• Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;\n• Knowledge of office policies, practices, and procedures;\n• Knowledge and proficiency in Microsoft office suite and other office computer applications.\n\n---",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-382-24",
    "Posting_Author": "Congressman Max Miller",
    "Congress_Number": null,
    "State_District": "Ohio",
    "Location": "Medina and Parma",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": "Member's Office",
    "Responsibilities": [
      "Acts as the representative for the Member within his or her area of responsibility",
      "Informs the Member and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents, organizations, etc.",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Member",
      "Acts as a liaison to and notifies the appropriate media when the Member will be in the liaison’s area and works with the Member’s Scheduler and Press Secretary to ensure appropriate media participation",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Director of Constituent Services",
      "Monitors scheduled district meetings for the Member with constituents",
      "Screens and refers cases, when appropriate, to other district offices",
      "Assists with the handling of office matters such as logging incoming and outgoing correspondence, handling visitors, telephone calls, and computer operations",
      "Prepares periodic reports for the District Director on pending cases and district activities in his or her assigned issue areas",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner",
      "Maintains a good working relationship with the Member, staff, and constituents",
      "Performs other duties as assigned"
    ],
    "Qualifications": [
      "Bachelor's degree or equivalent combination of education and experience preferred",
      "Previous office experience is preferred",
      "Previous experience working for a Member of Congress, elected official, or government agency preferred"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-135-24",
    "Posting_Author": "Office of Congresswoman Joyce Beatty (OH-03)",
    "Congress_Number": null,
    "State_District": "OH-03",
    "Location": "Washington, D.C.",
    "Job_Function": "Press Secretary",
    "Title_Parsed": "Press Secretary",
    "Office_Type": "Senior member's office",
    "Responsibilities": [
      "Serve as the primary contact for media requests...",
      "Advance press events and staff the Member as needed..."
    ],
    "Qualifications": null,
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "Yes",
    "Cleaned_Text": "{\"This is not an entry-level position. Candidates with established, active relationships with top-tier national media outlets and on-the-record experience will receive preferred consideration. Ohio ties are preferred, but not required.\"}\n\nPRIMARY RESPONSIBILITIES:\n•Serve as the primary contact for media requests, pitching and securing media opportunities in top-tier national outlets, coordinating necessary preparations, messaging, and risk management.\n•Advance press events and staff the Member as needed for media engagements.\n•Establish and maintain relationships with Ohio media, and activate current relationships with national, and D.C.-based media.\n•Draft and distribute media materials including press releases, statements, media advisories, and op-eds.\n•Assist with developing social media content creation, including rapid response.\n•Complete special projects.\n•Develop and execute media strategy as part of the office’s larger communications strategy.\\nThe Office of Congresswoman Beatty is an Equal Opportunity Employer who does not discriminate in employment based on race, color, religion, sex (including pregnancy and gender identity), national origin, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. LGBTQ+, and minority candidates as well as candidates from underrepresented groups are encouraged to apply.\"}",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-451-23",
    "Posting_Author": "the Office of the Rep. Maxine Waters",
    "Congress_Number": null,
    "State_District": "CA-43",
    "Location": null,
    "Job_Function": "Legislative Director/Counsel",
    "Title_Parsed": "Member’s Legislative Director/Counsel",
    "Office_Type": "Ranking Member of the House Committee on Financial Services",
    "Responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "Qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "none specified"
    ],
    "Equal_Opportunity_Information": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability.",
    "Cleaned_Text": "",
    "DW_NOMINATE": -0.656000018119812,
    "LES": 1.28559672832489
  }
]