[
  {
    "Post_ID": "MEM-512-24",
    "Posting_Author": "Washington, D.C.-Based Executive Assistant/Scheduler",
    "Congress_Number": null,
    "State_District": "CA-51",
    "Location": "Washington, D.C.",
    "Job_Function": "Executive Assistant/Scheduler",
    "Title_Parsed": "Executive Assistant/Scheduler",
    "Office_Type": "The O&ice of Congresswoman Sara Jacobs",
    "Responsibilities": [
      "Driving and sta&ing the Congresswoman while she is in Washington, D.C",
      "The O&ice of Congresswoman Sara Jacobs is looking for an organized, adaptable, and detail-oriented Executive Assistant/Scheduler.",
      "• Driving and sta&ing the Congresswoman while she is in Washington, D.C ",
      "Overseeing the member’s daily and long-term schedule, in coordination with the Deputy Chief of Sta& and the district-based Executive Assistant/Scheduler",
      "Compiling the daily brieﬁng book and ensuring the member is prepared ahead of engagements",
      "Managing member travel, logistics, and records",
      "Liaising between all sta& and the member to e&ectively communicate needs",
      "Aiding in front o&ice management during non-session weeks",
      "This role is part of the Operations team and reports to the Deputy Chief of Sta&.",
      "It also requires close coordination with the district-based Executive Assistant/Scheduler, Communications Director, and legislative team.",
      "Assisting the Deputy Chief of Sta& with o&ice operations, events, and project management, as needed",
      "Maintaining setup and presentation of the Member O&ice and upkeep of o&icial vehicle",
      "This is not a 9-5 job; many nights and weekends will be required, especially during legislative sessions.",
      "Advance, sales, or service industry skills are preferred; a valid driver’s license and a good driving record are required.",
      "TO APPLY, please send a résumé and cover letter to SaraJacobs.Resumes@mail.house.gov",
      "with “DC Scheduler – NAME” in the subject line.",
      "Our o&ice is an equal opportunity employer.",
      "Women, people of color, LGBTQ+ individuals,new Americans,people with disabilities,and members of other underrepresented communities are strongly encouraged to apply.",
      "Applications will be accepted through Friday, January 3, 2025, though priority will be given to earlier applicants.",
      "No phone calls, emails, or drop-ins, please."
    ],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Our o&ice is an equal opportunity employer.",
    "Cleaned_Text": "",
    "DW_NOMINATE": -0.3950000107288361,
    "LES": 0.3077055811882019
  },
  {
    "Post_ID": "MEM-510-24",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "Communications Director",
    "Office_Type": null,
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": 85,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-506-24",
    "Posting_Author": "Congresswoman Sara Jacobs",
    "Congress_Number": null,
    "State_District": "CA-51",
    "Location": "(Washington, D.C. or San Diego, CA)",
    "Job_Function": "Social Media Assistant",
    "Title_Parsed": "Social Media Assistant",
    "Office_Type": "Congresswoman's o&ice",
    "Responsibilities": [
      "creating and executing digital strategies",
      "managing the Congresswoman’s social media platforms",
      "proactively drafting content in the voice of the Congresswoman each day",
      "quickly responding to breaking news, Capitol Hill and San Diego developments",
      "inovating how the Congresswoman communicates"
    ],
    "Qualifications": [
      "passion for engaging non-political audiences",
      "capitalizing on social media trends",
      "innovating how the Congresswoman communicates",
      "graphic design and video editing skills",
      "proﬁcient in digital content creation"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Digital Content",
      "Social Media",
      "Graphic Design",
      "Video Editing"
    ],
    "Equal_Opportunity_Information": "Our o&ice is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply.",
    "Cleaned_Text": "MEM-506-24\nThe O&ice of Congresswoman Sara Jacobs (CA-51) is hiring a creative, e&icient, and detailoriented Social Media Assistant based in Washington, D.C. or San Diego, CA.\nThe Social Media Assistant will be responsible for creating and executing digital strategies under the guidance of the Communications Director. The ideal candidate will be a strong writer and a digital native with an eye for detail and a passion for innovative digital engagement.\nThis is not a 9-5 job; some nights and weekends as well as frequent travel will be required.\nCalifornia ties are helpful; good judgment and common sense are a must.\n\nSocial Media: The Social Media Assistant will manage the Congresswoman’s social media platforms – including Twitter, Facebook, Threads, Instagram, TikTok, and others – in addition to her website. This individual will be expected to proactively draft content in the voice of the Congresswoman each day in addition to quickly responding to breaking news, Capitol Hill and San Diego developments, and other rapid response opportunities.\nApplicants should have a passion for engaging non-political audiences, capitalizing on social media trends, and innovating how the Congresswoman communicates.\n\nDigital Content: Applicants should be proﬁcient in graphic design and video editing. This person will be responsible for proactively creating graphics, videos, and other digital content that is compelling, engaging, on-brand, and error-free. The Social Media Assistant will also regularly take photos and videos of the Congresswoman at events and in meetings. In addition to managing a strategic content calendar, they will be expected to create content for rollouts and rapid response opportunities. This includes clipping, captioning, and posting committee remarks, ﬂoor speeches, and interviews. The Social Media Assistant is also responsible for spearheading the e-newsletter program, including drafting, franking, and sending content related to grant opportunities, the Congresswoman’s legislative priorities, and her work in San Diego.\n\nTO APPLY, please send a résumé, cover letter, video sample, graphic sample, and short writing sample to SaraJacobs.Resumes@mail.house.gov with “Social Media Assistant – NAME” in the subject line.\nOur o&ice is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply.\nApplications will be accepted through Friday, January 3, 2025, though priority will be given to earlier applicants.\n\n---\n",
    "DW_NOMINATE": -0.3950000107288361,
    "LES": 0.3077055811882019
  },
  {
    "Post_ID": "MEM-504-24",
    "Posting_Author": null,
    "Congress_Number": 24,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": null,
    "Title_Parsed": "Legislative Assistant",
    "Office_Type": "House Committee on Veterans’ A&airs, Subcommittee on Technology Modernization",
    "Responsibilities": [
      "Under the supervision of the Subcommittee Sta&amp; Director, conduct oversight of the Department of Veterans A&amp;airs (VA) enterprise technology programs and projects as well as its information technology operations.",
      "Organizing and participating in meetings, preparing for subcommittee hearings, drafting memos, reading documents, summarizing documents and meetings orally and in writing, limited domestic travel, and other oversight duties as assigned.",
      "Collect technical information and translate it into briefings, memoranda, hearing materials, and policy recommendations for a general audience.",
      "Assisting with legislation in a limited capacity including drafting bills as well as reading and tracking pending and enacted legislation.",
      "Representing the Committee in a limited capacity including meeting with other congressional sta&amp; , veteran service organizations, technical organizations, and external stakeholders.",
      "Perform other duties as assigned by the Subcommittee Sta&amp; Director, Committee Sta&amp; Director, and Committee Deputy Sta&amp; Director."
    ],
    "Qualifications": [
      "Undergraduate degree",
      "At least three years of relevant work experience, prior congressional or federal agency experience is preferred but not required",
      "Some level of subject matter expertise in information technology and federal agency administrative or management issues",
      "Veterans are strongly encouraged to apply",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Discretion and sound judgment in formulating and recommending policy positions",
      "Knowledge of current issues and events relevant to the Committee and VA",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-501-24",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "National Security Advisor",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Develop and plan legislative initiatives related to a national security",
      "Monitor legislative developments within Committees and on the House floor"
    ],
    "Qualifications": [
      "At least 1 year of legislative experience in a full-time, paid position or legislative fellowship",
      "Excellent oral and written communication skills",
      "Thorough knowledge of the legislative process",
      "Ability to exercise discretion and independent judgment in policy positions"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Legislative Experience"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "House GOP Member Seeks National Security Advisor",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-500-24",
    "Posting_Author": "U.S. House Committee on Veterans’ A[airs",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": "Legislative Assistant",
    "Title_Parsed": "Legislative Assistant, U.S. House Committee on Veterans” A[airs, Republican Sta&",
    "Office_Type": "Staff",
    "Responsibilities": [
      "Conduct oversight of Subcommittee issue areas, including Department implementation of laws, regulations, and programs",
      "Review evidence and data to analyze, develop, and provide detailed written and oral reports of findings",
      "Assist the Subcommittee Director in advising the Full Committee leadership and Subcommittee leadership on legislative initiatives",
      "Draft hearing, markup, and floor statements for the Full Committee leadership and Subcommittee leadership",
      "Draft trip reports, requests to agencies for information, letters to agencies, hearing recaps, and other work product relevant to the Subcommittee’s jurisdiction",
      "Assist in determining Full Committee and Subcommittee hearing topics and preparing for hearings"
    ],
    "Qualifications": [
      "Bachelor of Arts or Science",
      "Knowledge of the legislative drafting process",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communications skills",
      "Thoroughness and careful attention to detail",
      "Strong Microsoft Office proficiency, including expertise in Word and ability to use Excel",
      "Demonstrate the ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions",
      "Knowledge of current issues and events in which the Full Committee leadership is involved"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Legislative drafting process",
      "Writing, editing, and proofreading skills",
      "Oral communications skills",
      "Microsoft Office proficiency",
      "Analysis and problem-solving skills"
    ],
    "Equal_Opportunity_Information": "U.S. House of Representatives is an equal opportunity employer.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-498-24",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "Legislative Assistant",
    "Title_Parsed": "Legislative Assistant",
    "Office_Type": null,
    "Responsibilities": [
      "Maintain Subcommittee archives of activities, including identifying and tracking pending legislation.",
      "Travel and conduct oversight visits at agency locations.",
      "Draft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee’s jurisdiction.",
      "Subcommittee casework as assigned."
    ],
    "Qualifications": [
      "Bachelor of Arts",
      "Bachelor of Science"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Strong writing and editing skills",
      "Strong Microsoft Office proficiency (including Word and Excel)",
      "Strong organizational skills",
      "Strong verbal communication",
      "Excellent attention to detail",
      "Excellent listening skills",
      "Strong ability to manage fluctuating workloads and juggle tasks",
      "Team oriented",
      "Excellent ability to work well under pressure",
      "Strong research skills (including legal research)",
      "Problem solving and analytical skills"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "MEM-498-24\nThe Subcommittee on Disability Assistance and Memorial A&airs, House\nCommittee on Veterans’ A&airs, Majority Sta& (DAMA) is seeking\na Legislative Assistant to provide administrative, legislative, and research\nsupport to Subcommittee sta&, and assists with duties as assigned.\nDUTIES:\n• Maintain Subcommittee archives of activities, including identifying and tracking pending\nlegislation.\n• Travel and conduct oversight visits at agency locations.\n• Draft trip reports, requests to agencies for information (including tracking deadlines),\nhearing recaps,\nite other work product relevant to the Subcommittee’s jurisdiction.\n• Subcommittee casework as assigned.\n• Answer telephone and respond to caller inquiries.\n• Keep abreast of emails, including Member inquiries and agency notiﬁcations,\nand schedule meetings with parties as appropriate.\n• Organize and maintain Subcommittee electronic records, including meeting notes,\ndocumentsother documents.\n• Analyze current law and proposed legislation; assist with the drafting of\nlegislation within\nite Majority agenda as assigned; participate in sta&-level discussions\ngeneral knowledge on legislation being considered; draft policy memoranda as\ntasked.\n• Assist with due diligence bing performed as part of the Subcommittee’s oversight duties,\nincluding requesting information from agencies on matters within the Subcommittee\njurisdiction.\n• Assist with hearing preparation and coordination of hearings, including developing\nrecommendations of hearing topics, breﬁng of Subcommittee Members, drafting\nmemoranda and remarks for Chairman, nnd development of questions.\n• Coordinate with Member oﬁce sta& on logistics, including Subcommittee Member\ntendance, for Subcommittee activities, including hearings.\n• Attend meetings with agencies, veteran service organizations, nd other parties,\nidMaintain notes on such meetings.\n• Draft memoranda for the full Committee nd Subcommittee Chairman on matters within\nthe jurisdiction of the Subcommittee.\n• Review the Congressional Record, Federal Register, House Calendar, nd other\npublications for matters of interest to Subcommittee Members and sta&.\n• Assist with developing policy recommendations nd serve s a resource for Members\nboth on nd off n n d Committee.\n• Responsible for all oth er duties assigned by the full Committee Chairman, Subcommittee\nChairman, full Committee Sta& Director or Deputy Sta& Director,\nistubcommittee Sta&Director, nd assisting other Committee sta&, s needed. \nis an in  n-site position i Washington, DC.\nm INMINIMUM QUALIFICATIONS:\nBachelor of Arts r Science.\nREQUIRED SKILLS:\n•Stron writing editing skills, including for work product of dierent types with dierent\naudiences.\n•Strong Microsoft Oﬁce proﬁciency, including expertise in Word nd the ability to use\nExcel.\n•Strong organizational skills.\n•S trong verbal communication, including with dierent audiences.\n•Excellent attention oodetail.\n•Excellent listening skiis.\n•Strong ability ot mgerate fluctuating workloads nnd jogle nd prioritize tasks,\nincluding ngaging short-, medium-, nd long-term tasks.\n•Team oriented.\n•Excellent ability ot work well under pressure nd time constra in\ntion. \nStrong research skirt s (e., LexisNexis) is  plus.\n•Problem solving nd nlytical skiis re plus.\n•Poential to work independently\nHo t Apply: Qualiﬁed candidates please send their cover letter, resume, nd three (3)\nwriting sam ples to the following e-mail addre: VAR.Resumes@nail.house.gov with\nt“DAMS Republican Legislative Assistant” in the subject line.\nNo calls nd walk-ins, please.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-497-24",
    "Posting_Author": "Midwest Republican",
    "Congress_Number": null,
    "State_District": "Washington, D.C.",
    "Location": "o&ice",
    "Job_Function": "Scheduler",
    "Title_Parsed": "Scheduler",
    "Office_Type": "Member's office",
    "Responsibilities": [
      "Maintaining the Member’s day-to-day schedule",
      "Preparing daily itineraries for the Member",
      "Working closely with the Member, Chief of Sta&, and Legislative Director"
    ],
    "Qualifications": [
      "Excellent organizational skills",
      "Attention to detail",
      "Ability to multitask in a fast-paced environment"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Organizational skills",
      "Attention to detail",
      "Multitasking"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "Maintaining the Member’s day-to-day schedule, preparing daily itineraries for the Member, working closely with the Member, Chief of Sta&, and Legislative Director...",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-476-24",
    "Posting_Author": "Congressman Dan Crenshaw (R-TX-02)",
    "Congress_Number": null,
    "State_District": "TX-02",
    "Location": "Washington, D.C. o&ice",
    "Job_Function": "Legislative Assistant (LA)",
    "Title_Parsed": "Legislative Assistant (LA)",
    "Office_Type": "House",
    "Responsibilities": [
      "Communicating clearly and consistently with the Member, Legislative Director, and legislative, communications, and district teams on legislative updates",
      "Preparing and sta&ing the Member for meetings, and assisting in the drafting of remarks, as needed"
    ],
    "Qualifications": [
      "strong written and oral communications skills",
      "detailoriented, organized, and creative",
      "Ability to work in a fast-paced environment and manage competing priorities",
      "Ability to communicate up and down within the team",
      "Interest in identifying and pursuing new opportunities and the ability to anticipate and adapt to challenges"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "legislative updates",
      "budget",
      "appropriations",
      "financial services",
      "tax",
      "communications",
      "district management"
    ],
    "Equal_Opportunity_Information": "No phone calls or drop-ins please.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  }
]