[
  {
    "Post_ID": "MEM-529-24",
    "Posting_Author": "Rep. Nanette Barragán (CA-44)",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC oDice",
    "Job_Function": "Legislative Assistant or Senior Policy Advisor",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "handling the Member's work on telecommunications issues as a member of the Energy and Commerce Committee",
      "drafting legislation, policy letters, memos, and talking points",
      "preparing for and standing committee hearings",
      "making vote recommendations",
      "meeting and maintaining relationships with constituents and advocacy groups",
      "working closely with the communications team and district staD",
      "advancing a number of the Member's legislative priorities",
      "other tasks as required"
    ],
    "Qualifications": [
      "strong written and oral communication skills",
      "ability to manage multiple priorities in a fast-paced work environment",
      "collaborative teamwork experience",
      "detail-oriented and organized",
      "positive attitude",
      "experience with Capitol Hill or relevant policy",
      "organizational and time-management skills",
      "previous experience working on housing and homelessness issues, Los Angeles Metro Area|Southern California ties"
    ],
    "Salary_Min": 60000,
    "Salary_Max": 80000,
    "Skills_Mentioned": [
      "telecommunications policy",
      "FCC and NTIA",
      "coalition building",
      "strategic relationships with constituent organizations"
    ],
    "Equal_Opportunity_Information": "The oDice is an equal opportunity employer",
    "Cleaned_Text": "<html><body>Rep. Nanette Barragán (CA-44) seeks a highly talented and motivated Legislative Assistant or Senior Policy Advisor in her Washington, DC - position title dependent on experience.</body></html>",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-528-24",
    "Posting_Author": "Congresswoman Nanette Diaz Barragán (CA-44)",
    "Congress_Number": null,
    "State_District": "CA-44",
    "Location": "Los Angeles Metro|Southern California ties are a plus",
    "Job_Function": "Communications Director",
    "Title_Parsed": "Communications Director",
    "Office_Type": "Congress office",
    "Responsibilities": null,
    "Qualifications": null,
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "fluent in Spanish",
      "experience with video editing and graphic design are a plus.",
      "experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus."
    ],
    "Equal_Opportunity_Information": "This oDice is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, marital status, parental status, military status, or any other factor or basis prohibited by applicable federal law.",
    "Cleaned_Text": "{",
    "DW_NOMINATE": -0.5,
    "LES": 0.199034184217453
  },
  {
    "Post_ID": "MEM-526-24",
    "Posting_Author": "Member-elect Maggie Goodlander (NH-02)",
    "Congress_Number": null,
    "State_District": "NH-02",
    "Location": "Washington, D.C.",
    "Job_Function": "Legislative Assistant",
    "Title_Parsed": "Legislative Assistant",
    "Office_Type": null,
    "Responsibilities": [
      "maintaining policy expertise and tracking legislative activity within the assigned policy portfolio; drafting vote, bill cosponsor, and letter recommendations; writing policy memos and brieﬁng materials; reviewing constituent correspondence within assigned policy portfolio; meeting with constituents and stakeholders and ensuring their concerns are shared with the Member and policy team; researching and drafting legislation; and working to advance the Member’s legislative agenda."
    ],
    "Qualifications": [
      "legislative experience",
      "good understanding of House and committee procedures",
      "understanding of the legislative process",
      "demonstrated ability to translate policy ideas into legislative outcomes",
      "strong written and verbal communication skills",
      "strong organizational skills",
      "Previous experience as a Legislative Assistant or on Capitol Hill",
      "New Hampshire ties",
      "demonstrated interest in public service"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "previous experience as a Legislative Assistant",
      "on Capitol Hill",
      "New Hampshire ties"
    ],
    "Equal_Opportunity_Information": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-525-24",
    "Posting_Author": "Member-elect Maggie Goodlander (NH-02)",
    "Congress_Number": null,
    "State_District": "NH-02",
    "Location": "Washington, D.C.",
    "Job_Function": "Legislative Correspondent",
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "building a new mail program",
      "assisting with tracking and sorting constituent mail, email, and phone outreach",
      "drafting responses",
      "ensuring constituents get timely, accurate, and helpful responses",
      "communicating constituent opinions and priorities to the Member and legislative team",
      "legislative issue research and tracking of legislative activity"
    ],
    "Qualifications": [
      "strong writing",
      "proofreading",
      "organizational skills",
      "attention to detail",
      "familiarity with Intranet Quorum or other House CRM software",
      "New Hampshire ties",
      "demonstrated interest in public service"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "legislative issue research and tracking of legislative activity",
      "Intranet Quoronr otheouseCRMsofware",
      "(NH-02) ",
      "(public service) "
    ],
    "Equal_Opportunity_Information": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-524-24",
    "Posting_Author": null,
    "Congress_Number": 49,
    "State_District": "California's 49th Congressional District",
    "Location": "Oceanside",
    "Job_Function": "District Representative",
    "Title_Parsed": null,
    "Office_Type": "Distict",
    "Responsibilities": [
      "building and maintaining relationships with a variety of communities throughout CA-49",
      "handling constituent casework with various federal agencies",
      "planning and standing in-district events, meetings, and site visits",
      "working closely with the District Office and Washington, DC office on local and assigned policy issues"
    ],
    "Qualifications": [
      "thorough knowledge of California’s 49th district",
      "familiarity with the communities of Encinitas, Solana Beach, and Del Mar",
      "service-oriented attitude",
      "strong organizational skills",
      "proficiency at prioritizing and managing multiple projects at one time",
      "capacity to work both independently and as part of a team",
      "strong written and oral communications skills"
    ],
    "Salary_Min": null,
    "Salary_Max": 60000,
    "Skills_Mentioned": [
      "federal agencies",
      "department of homeland security",
      "department of state"
    ],
    "Equal_Opportunity_Information": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-523-24",
    "Posting_Author": "The Democratic Staff of the House Budget Committee and Ranking Member Brendan F. Boyle (PA-02)",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington D.C.",
    "Job_Function": "Digital Assistant",
    "Title_Parsed": "Digital Assistant",
    "Office_Type": "committee office and personal office",
    "Responsibilities": [
      "creating and scheduling content for social media platforms",
      "maintaining the committee’s website",
      "producing multimedia materials (graphics, videos, and infographics)",
      "monitoring digital analytics to optimize outreach"
    ],
    "Qualifications": null,
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "digital communications, social media management",
      "design and editing tools (e.g., Adobe Creative Suite, Canva)",
      "writing and editing skills",
      "progressive policymaking"
    ],
    "Equal_Opportunity_Information": "This office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status. Candidates with diverse backgrounds, women, people of color, and LGBTQIA+ candidates are strongly encouraged to apply.",
    "Cleaned_Text": "MEM-523-24\r\nThe Democratic Staff of the House Budget Committee and Ranking Member Brendan F. Boyle (PA-02)\r\nseek a creative and detail-oriented Digital Assistant to support digital communications and public engagement efforts. This position will be split between the committee office and personal office and will be based out of Washington D.C.\r\n\r\nThis position involves creating and scheduling content for social media platforms, maintaining the committee’s website, producing multimedia materials (graphics, videos, and infographics), and monitoring digital analytics to optimize outreach. The ideal candidate will have 1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred), proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva), strong writing and editing skills, and a passion for progressive policymaking.\r\n\r\nCandidates should be highly organized, comfortable working under tight deadlines, and familiar with social media analytics and website content management systems. A bachelor’s degree in communications, political science, or a related field is preferred. Salary is commensurate with experience, and the position includes a competitive benefits package.\r\n\r\nThis office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status. Candidates with diverse backgrounds, women, people of color, and LGBTQIA+ candidates are strongly encouraged to apply.\r\n\r\nTo apply, email a cover letter, resume, three examples of digital content, and contact information for three references to budget-democrat.jobs@mail.house.gov with the subject line: “[Name] – Digital Assistant Application.” Applications will be reviewed on a rolling basis.\r\n\rnMEM -522-24\r\nThe Office of Congressman Pat Ryan (NY-18) seeks a Press Secretary based in the\r\nWashington DC office. Applicants should be prepared to join a highly-collaborative, highachieving team and possess an eagerness to grow and learn within the office. Ties to New York’s 18th District are a plus.\r\n\rnThe ideal candidate should demonstrate excellent writing and editing skills in addition to a strong work ethic, good sense of humor, and keen attention to detail. The position will require working non-traditional hours.\r\n\r\nResponsibilities include:\n Writing press releases, statements and media advisories\r\n Drafting talking points and op-eds\r\n Staffing the Congressman for interviews and media events\r\n Planning press conferences and in-district events\r\n Responding to press inquiries\r\n Maintaining relationships and booking interviews with local press outlets\r\n Other tasks as assigned\r\n\rnThe Press Secretary will report to the Communications Director, and work closely with the\r\nChief of Staff, the District Director, the Digital Director, the Legislative Director, and other\r\nlegislative and district staff in creating, coordinating and executing the digital and written\r\ncontent strategy to promote the Congressman’s legislative and district priorities. The salary range for this position is $60,000 - $80,000, commensurate with experience.\n\rn•\r\n•\r\n•\r\n•\r\n•\r\n•\r\n•\r\nThe office is an equal opportunity employer; we do not discriminate on the basis of race,\ncolor, religion, sex, national origin, age, disability, gender identity or expression, or sexual\rnorientation. Candidates of diverse backgrounds are strongly encouraged to apply.\r\n\rnCandidates should submit a cover letter, resume, two writing samples, and three references in a single PDF to ny18resumes@mail.house.gov with the job title and your full name in the\r\nsubject line (e.g.: “Press Secretary - Bryson Daily”). No phone calls, faxes or drop-ins, please.\r\nApplications will be considered on a rolling basis.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-521-24",
    "Posting_Author": "Congresswoman Alma S. Adams, Ph.D.",
    "Congress_Number": null,
    "State_District": "Charlotte, N.C.",
    "Location": "Washington D.C. or the Charlotte, N.C. District Office",
    "Job_Function": null,
    "Title_Parsed": null,
    "Office_Type": null,
    "Responsibilities": [
      "Develop strategic communications plans for all district and DC events/speaking engagements/member appearances, (..) ;",
      "Produce written and visual content for the office, including but not limited to press releases,(...) ;",
      "Manage, mentor, and grow the communications team, focusing on staff professional development, skill building, and efficient workflows;(...) ;",
      "(...)",
      "Prepare, brief, and staff the Member for media interviews, press conferences, roundtables, and other engagements ;",
      "Draft and edit office materials, talking points, speeches, press releases, op-eds, and other materials as necessary ;",
      "Speak on background or on the record with reporters when necessary and act as a media liaison for the Member."
    ],
    "Qualifications": [
      "Bachelor’s Degree in a relevant field or equivalent professional experience;",
      "Previous Capitol Hill, campaign or political experience strongly preferred;",
      "Exceptionally strong writing, editing, and proofreading skills;",
      "Previous on the record experience;",
      "Ability to take photographs and write content for social media",
      "Experience managing others and promoting professional development;",
      "Deep understanding of print, broadcast, and online media and how to successfully create and leverage opportunities in each;",
      "Strategic thinker, politically savvy, and ability to manage competing priorities and develop solutions under tight deadlines;",
      "(...)",
      "(...)",
      "(...)"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Exceptionally strong writing, editing, and proofreading skills;",
      "..."
    ],
    "Equal_Opportunity_Information": "Rep. Alma S. Adams’ office provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
    "Cleaned_Text": "MEM-521-24The Office of Congresswoman Alma S. Adams, Ph.D. is seeking a Communications Director that can work in Washington D.C. or the Charlotte, N.C. District Office.The Communications Director is expected to work closely with the Chief of Staff, Deputy Chief of Staff/District Director, and the Legislative Director to develop and execute a comprehensive and aggressive strategic plan to inform constituents and the media about Congresswoman Adams and her work as a member of congress. This includes making media pitches, organizing press events, and reviewing, drafting, and finalizing statements, talking points/speeches, press releases, media advisories, and other messaging (e.g., newsletters and social media). Finally, the Communications Director will oversee all Franked communications, which includes mailers. Successful candidates will be exceptional writers and have strong experience working in fast-paced environments and implementing aggressive communications plans. North Carolina ties strongly preferred.KEY RESPONSIBILITIES:\n•\n•\n•\n•\n•\n•\n•\nDevelop strategic communications plans for all district and DC events/speaking engagements/member appearances, etc. and work closely with the DC and District Offices to implement successful media strategies;\nProduce written and visual content for the office, including but not limited to press releases, statements, social media post and weekly newsletters;\nManage, mentor, and grow the communications team, focusing on staff professional development, skill building, and efficient workflows;\nBuild and sustain strong relationships with North Carolina and national print, online, radio, and broadcast media (reporters, producers, editors, columnists, etc.), and remain ready to identify creative ways to pitch the Member;\nPrepare, brief, and staff the Member for media interviews, press conferences, roundtables, and other engagements;\nDraft and edit office materials, talking points, speeches, press releases, op-eds, and other materials as necessary; and\nSpeak on background or on the record with reporters when necessary and act as a media liaison for the Member.\n•\nREQUIREMENTS:\n•\n•\n•\n•\n•\n•\n•\nBachelor’s Degree in a relevant field or equivalent professional experience;\nPrevious Capitol Hill, campaign or political experience strongly preferred;\nExceptionally strong writing, editing, and proofreading skills;\nPrevious on the record experience;\nAbility to take photographs and write content for social media\nExperience managing others and promoting professional development;\nDeep understanding of print, broadcast, and online media and how to successfully create and leverage opportunities in each;\nStrategic thinker, politically savvy, and ability to manage competing priorities and develop solutions under tight deadlines;\n(…)”, ",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM 519-24",
    "Posting_Author": "The Office of Congressman Jamie Raskin (MD-08)",
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington ,DC.",
    "Job_Function": "Scheduling Director/Operations Manager",
    "Title_Parsed": "Scheduling Director / Operations Manager ",
    "Office_Type": "full-time Scheduling Director/Operations Manager",
    "Responsibilities": [
      "managing the ´MEM’s daily and long-term schedule; organizing and tracking invitations , speaking engagements , meetings , and scheduling requests for the ´ MEM “The Office of Congressman Jamie Raskin (MD-08) seeks a Scheduling Director / Operations Manager.”\nThe Scheduling Director/Operations Manager will work closely with the Member , the Chief of Staff , and District Chief to coordinate the Member’s official schedule and provide administrative support to the Member and team to ensure efficient operations. Essential duties include but are not limited to:\nmanaging the ´MEM's daily and long-term schedule; organizing and tracking invitations, speaking engagements, meetings, and scheduling requests for the ´MEM; corresponding with outside stakeholders on scheduling matters and keeping the Member on schedule throughout the day;\ncoordinating logistics and strategic planning for events; coordinating official travel of the Member and staff; providing operational support such as overseeing leave requests and staff training; liaising with technology department and managing member’s technology and office technology; and other administrative duties as may be assigned.\nThe successful candidate ideally has experience working on the Hill and experience with scheduling and/or operations. Applicants should be motivated self-starters and highly-collaborative team players who demonstrate scrupulous attention to detail, keen organizational skills, effective time management, excellent oral and written communication skills, and has a professional demeanor. The role regularly interacts with constituents, relevant stakeholders, congressional offices, and federal agencies. The candidate should be responsive and friendly while demonstrating strategic planning and decisionmaking skills. A discreet approach to these responsibilities is essential. This position may include evening and weekend work as the Congressional and Member schedule requires.\nCandidates from diverse backgrounds and underrepresented communities are strongly encouraged to apply. The U.S. House of Representatives is an equal opportunity employer and does not discriminate based on race , color , religion , sex , national origin , age , disability , military status , gender identity and expression , marital status , parental status , or sexual orientation or any other characteristics protected by applicable laws, in any of its activities or operations.\nTo apply , please email: MD08.Resumes@mail.house.gov by January 9 , 2025 with “Scheduling Director/Operations Manager : Last Name” in the subject line and the following applications materials attached as one pdf:\r\n1. Resume\r\n2. Cover letter\r\n3. Two writing samples\r\n4.\n\r\nResume\r\nCover letter\r\nTwo writing samples\r\nThree references – including name , current title , phone number , and email address."
    ],
    "Qualifications": [
      "Strong written and verbal communication skills.",
      "Thorough knowledge of the legislative process, procedures, \\",
      "Self-starting personality.",
      "Passion for public service.)",
      "Ability to work well under pressure.",
      "Willingness to accept performance-based criticism and direction.",
      "Ability to work cooperatively and courteously with others.",
      ""
    ],
    "Salary_Min": 62,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Strong written and verbal communication skills.",
      "Thorough knowledge of the legislative process",
      "procedures,"
    ],
    "Equal_Opportunity_Information": "The Office of Congressman Jamie Raskin (MD-08) seeks a Scheduling Director / Operations Manager.\n”,. ",
    "Cleaned_Text": "MEM-520-24\r\nCongresswoman-elect °xine Dexter ¹seeking a full-time Legislative Assistant ·in Washington ,Ü . âThis is not an entry-level position. âThe salary range is $62,000 - $75,000.  Qualified candidates should submit a resume and cover letter to OR3resumes@gmail.com.©Oregon ties are strongly preferred.\n\r\nESSENTIAL JOB FUNCTIONS:\r\n\r\n• Works with the Deputy Chief of StaD & Legislative Director and Chief of StaD to formulate and advance legislative initiatives for assigned issue areas.\"\r\n\r\n• Represent the Congresswoman at meetings with constituents , district stakeholders , committee staD , and federal agencies and staDs the Congresswoman at engagements relevant to assigned issue areas.\"\r\n\r\n• Tracks legislation and coordinates co-sponsorship of bills and co-signing of letters for the ¼a\nes Woman.\n\r\n  • Develops brieﬁng materials , talking points , and policy memos for the ¼a\nes Woman.\"\r\n\r\n• Provides input to the Communications Director to draft speeches , press releases , op-eds , and statements for the CongressWoman.\"\r\n\r\n• Provides district oDice staD with targeted information for community events.\"\n\r\n MEM 519-24",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-517-24",
    "Posting_Author": "Congresswoman Susie Lee (D-NV)",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": null,
    "Title_Parsed": "DC Scheduler",
    "Office_Type": null,
    "Responsibilities": [
      "develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC",
      "track, evaluate, and respond to all invitations and scheduling requests",
      "coordinate travel for the Member",
      "compile the Congresswoman’s nightly briefing materials",
      "manage office operations",
      "facilitate Member meetings and calls",
      "coordinate internal and external events",
      "assist with onboarding and training for staff and interns",
      "provide staffing support",
      "drive the Congresswoman as needed",
      "solve problems creatively",
      "attend to details",
      "communicate effectively",
      "multi-task",
      "work under pressure",
      "be flexible",
      "be responsive to urgent scheduling needs on nights and weekends"
    ],
    "Qualifications": [
      "creative problem solving",
      "excellent attention to detail",
      "communication skills",
      "ability to multi-task",
      "understanding of fast-paced environments"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Candidates of diverse backgrounds are encouraged to apply",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-516-24",
    "Posting_Author": "Jennifer McClellan (VA-04)",
    "Congress_Number": null,
    "State_District": "VA-04",
    "Location": "Washington, D.C.",
    "Job_Function": "Communications",
    "Title_Parsed": "",
    "Office_Type": "Member's office",
    "Responsibilities": [
      "manage all aspects of the Congresswoman’s communications strategy..."
    ],
    "Qualifications": [
      "several years of demonstrated communications experience...",
      "strong relationships with bookers and producers...",
      "good political instincts..."
    ],
    "Salary_Min": null,
    "Salary_Max": 100500,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "",
    "Cleaned_Text": "MEM-516-24\nCongresswoman Jennifer McClellan (VA-04) seeks a highly motivated and proactive Communications\ndirector in her Washington, D.C. office.\nIn close collaboration with the Member and Chief of Staff, the Communications Director will manage all\naspects of the Congresswoman’s communications strategy, including her earned media, digital media,\nand franked communications.\nThe Communications Director will report directly to the Chief of Staff.\nThe Communications Director will cultivate and manage relationships with both national and local\npress, field all press inquiries, and proactively pitch stories and book the Member for local and national\nTV; draft press releases, media advisories, and op-eds; collaborate with the Legislative and District\nteams to coordinate press rollouts for new legislative efforts and in-district events;\nmanage a robust franked communications budget;\noversee a rapid social media program;\nand oversee and manage a communications team.\nThis position is part of the Member’s senior staff – this is not an entry-level position. The ideal candidate\ngroup 'for job info.' should have several years of demonstrated communications experience,\nincluding on-the-record\nexperience, strong relationships with bookers and producers,\nand a broad network of reporter\nerelationships.\nThe candidate should possess strong writing and interpersonal skills and good political\ninstincts. Capitol Hill experience required. Virginia ties are a plus.\nThe position is full-time with federal benefits, including student loan repayment,\ntransit or parking\nbenefits, generous PTO and FMLA,\nand work-from-home options. The pay range is $95,000-$105,000,\ncommensurate with experience.\nTo Apply: All interested candidates are encouraged to submit a resume,\ncover letter, and two writing\nsamples to VA04.Jobs@mail.house.gov.\nThis full-time position is based in her Washington, D.C. office.\nThe office is an equal opportunity\nerg employer and does not discriminate on the basis of race, color, religion, sex, gender identity,\nsexual orientation, religious affiliation, national origin, age, or military, marital,\nor parental status.\nThe office\nprioritizes building a diverse team: women and candidates from BIPOC, LGBTQ+, and other underrepresented communities are encouraged to apply.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-510-24",
    "Posting_Author": "Congresswoman Angie Craig (MN-02)",
    "Congress_Number": null,
    "State_District": "MN-02",
    "Location": "Washington, DC",
    "Job_Function": "Communications Director",
    "Title_Parsed": "Communications Director",
    "Office_Type": "",
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": 85,
    "Salary_Max": 95,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including marital or parental status), national origin, age, disability, gender identity, or sexual orientation.",
    "Cleaned_Text": "",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-506-24",
    "Posting_Author": "",
    "Congress_Number": null,
    "State_District": "",
    "Location": "Washington, D.C. or San Diego, CA",
    "Job_Function": "",
    "Title_Parsed": "",
    "Office_Type": "",
    "Responsibilities": [],
    "Qualifications": [],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [],
    "Equal_Opportunity_Information": "Our o<ice is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply.",
    "Cleaned_Text": "The O<ice of Congresswoman Sara Jacobs (CA-51) is hiring a creative, e<icient, and detailoriented Social Media Assistant based in Washington, D.C. or San Diego, CA.\n\nThe Social Media Assistant will be responsible for creating and executing digital strategies under the guidance of the Communications Director. The ideal candidate will be a strong writer and a digital native with an eye for detail and a passion for innovative digital engagement.\nThis is not a 9-5 job; some nights and weekends as well as frequent travel will be required.\nCalifornia ties are helpful; good judgment and common sense are a must.\n\nSocial Media: The Social Media Assistant will manage the Congresswoman's social media platforms – including Twitter, Facebook, Threads, Instagram, TikTok, and others – in addition to her website. This individual will be expected to proactively draft content in the voice of the Congresswoman each day in addition to quickly responding to breaking news, Capitol Hill and San Diego developments, and other rapid response opportunities.\nApplicants should have a passion for engaging non-political audiences, capitalizing on social media trends, and innovating how the Congresswoman communicates.\n\nDigital Content: Applicants should be proﬁcient in graphic design and video editing. This person will be responsible for proactively creating graphics, videos, and other digital content that is compelling, engaging, on-brand, and error-free. The Social Media Assistant will also regularly take photos and videos of the Congresswoman at events and in meetings. In addition to managing a strategic content calendar, they will be expected to create content for rollouts and rapid response opportunities. This includes clipping, captioning, and posting committee remarks, ﬂoor speeches, and interviews. The Social Media Assistant is also responsible for spearheading the e-newsletter program, including drafting, franking, and sending content related to grant opportunities, the Congresswoman's legislative priorities, and her work in San Diego.\n\nTO APPLY, please send a résumé, cover letter, video sample, graphic sample, and short writing sample to SaraJacobs.Resumes@mail.house.gov with ",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-504-24",
    "Posting_Author": null,
    "Congress_Number": null,
    "State_District": null,
    "Location": "Washington, DC",
    "Job_Function": "Legislative Assistant",
    "Title_Parsed": "Legislative Assistant",
    "Office_Type": null,
    "Responsibilities": [
      "Under the supervision of the Subcommittee Sta’ Director, conduct oversight of the Department of Veterans A¦airs (VA) enterprise technology programs and projects as well as its information technology operations.",
      "Organizing and participating in meetings, preparing for subcommittee hearings, drafting memos, reading documents, summarizing documents and meetings orally and in writing, limited domestic travel, and other oversight duties as assigned.",
      "Collect technical information and translate it into brieüing s, memoranda, hearing materials, and policy recommendations for a general audience.",
      "Assisting with legislation in a limited capacity including drafting bills as well as reading and tracking pending and enacted legislation.",
      "Representing the Committee in a limited capacity including meeting with other congressional sta¢, veteran service organizations, technical organizations, and external stakeholders.",
      "Perform other duties as assigned by the Subcommittee Sta© Director, Committee Sta© Director, and Committee Deputy Sta© Director."
    ],
    "Qualifications": [
      "Undergraduate degree",
      "At least three years of relevant work experience, prior congressional or federal agency experience is preferred but not required",
      "Some level of subject matter expertise in information technology and federal agency administrative or management issues",
      "Veterans are strongly encouraged to apply",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": null,
    "Equal_Opportunity_Information": "The U.S. House of Representatives is an equal opportunity employer.",
    "Cleaned_Text": "´¶Mem-504-24 The House Committee on Veterans’ A<airs majority is seeking a Legislative Assistant for the Sub-committee on Technology Modernization...\n\nThis position will conduct oversight of the Department of Veterans A<airs” (VA) enterprise technology programs and projects as well as its information technology operations.\nInformation technology is a key aspect of all VA operations including, but not limited to, supply chain, health care delivery, cybersecurity, human resources, financial management, and beneﬁts delivery. The role involves collecting technical information and translating it into brieﬁngs, memoranda, and policy recommendations for a general audience in an extremely fast-paced environment.\nSome level of subject matter expertise in information technology and federal agency administrative or management issues is also required.\nThis is a full-time, on-site position in Washington, DC. Some domestic travel is required. \nHouse Committee on Veterans’ A<airs, Subcommittee on Technology Modernization\n\nLegislative Assistant\n\nCore Responsibilities: \n\\“Under the supervision of the Subcommittee Sta©Director, conduct oversight of the Department of Veterans A{¦}airs (VA) enterprise technology programs and projects as well as its information technology operations.\\\\n\\\\Organizing and participating in meetings, preparing for subcommittee hearings, drafting memos, reading documents, summarizing documents and meetings orally and in writing, limited domestic travel, and other oversight duties as assigned.\\\\n\nCollect technical ¼information and translate it into brieﲿings, memoranda, hearing materials, and policy recommendations for a general audience.\\\\n\nAssisting with legislation in a l imited capacity including drafting bills as well as reading and tracking pending and enacted legislation.\\\\n\nRepresenting the Committee in a limited capacity including meeting with other congressional sta¢, veteran service organizations, technical organizations, and external stakeholders. \\\n\nPerform oth er duties as assigned by the Subcommittee Staﳑ Directo r, C ommittee Staﳑ0 Director , and Com mittee Deput e StaﳑD e iro r.",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-501-24",
    "Posting_Author": "House GOP Member",
    "Congress_Number": null,
    "State_District": null,
    "Location": null,
    "Job_Function": "National Security Advisor",
    "Title_Parsed": "House GOP Member Seeks National Security Advisor",
    "Office_Type": null,
    "Responsibilities": [
      "to develop and plan legislative initiatives related to a national security, cyber security, foreign affairs, and armed services portfolio.",
      "to monitor legislative developments within Committees and on the House floor;",
      "to meet with constituents and advocacy groups on behalf of the Member."
    ],
    "Qualifications": [
      "at least 1 year of legislative experience in a full-time, paid position or legislative fellowship",
      "excellent oral and written communication skills;",
      "thorough knowledge of the legislative process;",
      "ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions for the Member;",
      "ability to work cooperatively and courteously with others;",
      "ability to work well under pressure;",
      "thoroughness and careful attention to detail"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "none specified"
    ],
    "Equal_Opportunity_Information": "This job posting is subject to the terms of our Employee Equal Opportunity Policy.",
    "Cleaned_Text": "House GOP Member Seeks National Security Advisor ",
    "DW_NOMINATE": null,
    "LES": null
  },
  {
    "Post_ID": "MEM-476-24",
    "Posting_Author": "Dan Crenshaw",
    "Congress_Number": null,
    "State_District": "TX-02",
    "Location": "Washington, D.C.",
    "Job_Function": "Legislative Assistant",
    "Title_Parsed": "Legislative Assistant (LA)",
    "Office_Type": "Branch Office",
    "Responsibilities": [
      "Communicating clearly and consistently with the Member, Legislative Director, and legislative, communications, and district teams on legislative updates.",
      "Preparing and sta<ing the Member for meetings, and assisting in the drafting of remarks, as needed.",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas.",
      "Working with external stakeholders, Congressional Research Service (CRS), Legislative Counsel, and committee sta< to draft legislation based on the Member's priorities."
    ],
    "Qualifications": [
      "Strong written and oral communications skills.",
      "Detailoriented, organized, and creative.",
      "Ability to quickly learn the member's voice and think in a proactive, communications-focused manner.",
      "Commitment to a collaborative work environment",
      "Ability to work in a fast-paced environment and manage competing priorities",
      "Ability to communicate up and down within the team",
      "Interest in identifying and pursuing new opportunities and the ability to anticipate and adapt to challenges"
    ],
    "Salary_Min": null,
    "Salary_Max": null,
    "Skills_Mentioned": [
      "Legislative Management",
      "Congressional Liaison",
      "Administrative Support",
      "Policy Development",
      "Advocacy",
      "Regulatory Affairs",
      "Writing",
      "Communications",
      "Government Operations",
      "Washington Advocacy",
      "Public Policy",
      "Legislative Relations"
    ],
    "Equal_Opportunity_Information": null,
    "Cleaned_Text": "MEM-476-24\nCongressman Dan Crenshaw (R-TX-02) seeks a highly motivated, hard-working Legislative Assistant (LA), based in our Washington, D.C. office.\nThis position reports to the Legislative Director.\nThe LA will handle an economic facing portfolio, including Budget and\nAppropriations, Financial Services, and Tax, with other issues to follow.\nKey duties include:\n• Communicating clearly and consistently with the Member, Legislative Director, and\nlegislative, communications, and district teams on legislative updates\n• Preparing and sta<ing the Member for meetings, and assisting in the drafting of\nremarks,\nas needed\n• Meeting with constituents, stakeholders, and advocacy groups within the portfolio\nof issue areas\nWorking with external stakeholders, Congressional Research Service (CRS),\nLegislative Counsel, and committee sta< to draft legislation based on the\nMember's\npriorities\n• Ideal candidates will have strong written and oral communications skills and be detail-oriented,\norganized, and creative.\nThey must be able to quickly learn the member's voice and think in a proactive,\ncommunications-focused manner.\nOther key qualities include:\n• Commitment to a collaborative work environment\n• Ability to work in a fast-paced environment and manage competing priorities\n• Ability to communicate up and down within the team\n• Ability to learn the Congressman's voice and legislative priorities\n• Interest in identifying and pursuing new opportunities and the ability to anticipate and\nadapt to challenges\nHill experience is required.\nCompensation is competitive and commensurate with level of experience.\nQualified applicants should submit a resume and writing sample (no more than 3 pages)\nas one combined PDF to Kenneth.Depew@mail.house.gov.\nInclude \\\"Legislative Assistant -- \"[Full Name]\\\"in the subject line.\nApplications will be considered on a rolling basis as received.\nNo phone calls or drop-ins please.",
    "DW_NOMINATE": null,
    "LES": null
  }
]